[
{"publishDate": "2017-03-14 13:46", "category": "Careers", "author": "rschuller", "title": "Voxxed Days 2017: Learning from the best in tech", "slug": "voxxed-days-2017-learning-from-the-best-in-tech", "summary": "Hear how our graduate developers got on at Voxxed Days 2017", "content": "<p><!--more-->Having only started at Scott Logic in February 2017, it was great to so quickly be given the chance to support one of my new colleagues, Lead Developer Dan Cook, as he presented at Voxxed Days 2017. I attended the conference along with my fellow graduate developers Chris and Nikos, and as it was our first time at such a large developer conference, there was a lot to take in.</p><h2><span style=\"font-weight: 400;\">the bar is set</span></h2><p><span style=\"font-weight: 400;\">The day started with Simon Ritter giving a keynote on whether an Agile standard is possible for Java. It included an interesting history lesson on how Java got to the point it’s at today and how it might, in the future, evolve into a more Agile way of releasing new features using JDK* Enhancement Proposals (JEPs*). The audience reacted with some friction, as although it means developers will get access to new features more frequently, it also adds bureaucracy to the development process. “Are we going to switch to the next point update for this single feature or not?” is likely to become a frequently asked question in meetings, which could noticeably slow down the Agile process for developers. </span></p><p>It seemed most of the audience were happy with the current release frequency of JDK updates. Tools for developers should have some in-built stability, so unless the JCP* creates a safe and stable environment to release JEPs, it will probably be detrimental for most developers with larger, longer running projects.</p><p><span style=\"font-weight: 400;\">After the initial keynote, Chris and I went to see Lucas Fernandes da Costa’s presentation on Meta Programming in JavaScript, which focused on the inner workings of JavaScript. Given that our time so far at Scott Logic has predominantly focused on this language, this talk was extremely beneficial. </span></p><p><span style=\"font-weight: 400;\">Lucas provided us with a detailed illustration of how to improve performance through overriding the standard properties of objects such as </span><i><span style=\"font-weight: 400;\">getter</span></i><span style=\"font-weight: 400;\"> and </span><i><span style=\"font-weight: 400;\">setter</span></i><span style=\"font-weight: 400;\"> methods. The demonstration focused on adding properties to the object which served as </span><i><span style=\"font-weight: 400;\">flags</span></i><span style=\"font-weight: 400;\"> to prepare the object for the subsequent operation.</span></p><p>An example of this is:</p><p><span style=\"font-weight: 400;\">“basket.add(10).apples” -  where the add flag prepares the operation, which is actually performed for a specific property (apples) when that property is called (here the internal </span><i><span style=\"font-weight: 400;\">get </span></i><span style=\"font-weight: 400;\">method is overridden, hence the lack of function parentheses). </span></p><p><span style=\"font-weight: 400;\">This creates a chain of function calls that is very readable and logical to understand; the same technique is employed in the Chai testing library, of which Lucas is a core maintainer. Beyond this, we were shown how to use this approach to emulate the powerful features of other languages, such as Haskell’s lazy properties and infinite sequences. Overall this provided us with a strong insight into the depth and possibilities of a language we are all still relatively new to.</span></p><h2><span style=\"font-weight: 400;\">The star of the show</span></h2><p><span style=\"font-weight: 400;\">After that we went to see our colleague Dan, who had an interesting presentation on high velocity streaming. He talked about the problems he ran into using traditional processing methods (eg collect window of data -&gt; ingest it -&gt; save it -&gt; compute values from it and then send the user a signal). </span></p><p>This way the signal is always delayed until the next computation period, usually at the end of a measurement, meaning if you have a four-hour period, the signal you might want immediately could be delayed by four hours. You could make the periods smaller but when you want real time response, it’s simply not feasible to do it the traditional way. Dan showed us the way forward using a combination of Kafka (a message broker) and Apache Spark (a processing engine). He showed us how the data is safe, even when a sensor or subnetwork fails, and how it can scale to Internet of Things (IoT) proportions if you switch Apache Spark to Apache Flint.</p><p><span style=\"font-weight: 400;\">After some lunch, we went to see the colourful Szymon Warda for an introduction to graph databases. He showed us how they can greatly reduce complexity in relational databases, which allows great improvements to be found in computation time. Of course, this allows more processing to be done in the same time frame, which can lead to finding new patterns in Big Data. From this he taught us how to suggest products to customers and build a knowledge database.</span></p><p><span style=\"font-weight: 400;\">Following that we went to see IBM Software Engineer Adam Pilkington to learn about getting microservices up and running in no time through a tutorial. For this purpose, IBM has set up a text adventure game, </span><i><span style=\"font-weight: 400;\">GameOn,</span></i><span style=\"font-weight: 400;\"> which is written as a collection of microservices. Users can navigate in a map of rooms, as well as deploy rooms, connecting their own service to the larger system that comprises GameOn. Using the microservices approach, the user is enabled to try implementing a feature with various technologies almost seamlessly, as they’re independent modules. </span><i><span style=\"font-weight: 400;\">GameOn</span></i><span style=\"font-weight: 400;\"> now has an immense number of diverse rooms and loads of learning fun.</span></p><p><span style=\"font-weight: 400;\">And finally, it was on to more managerial tasks with Adaptavist CTO Dan Hardiker. His presentation, </span><i><span style=\"font-weight: 400;\">A Retrospective on Retrospectives</span></i><span style=\"font-weight: 400;\">, taught us the value of being able to voice your concerns to your peers and superiors, and touched upon how the enablers of teams could be more valuable than the superstars; a principle that seems reasonably straightforward, but needs to be repeated out loud every now and then.</span></p><p><span style=\"font-weight: 400;\">At the end of the day, we were introduced to many (maybe even too many?) new concepts and ideas and it piqued our curiosity and eagerness to learn even more. Voxxed Days 2017 was a pleasant eye opener to what’s happening in the industry, and to what awaits us further down the path of our careers. We hope to be able to continue to be part of events like this in the future.</span></p><p><em><span style=\"font-weight: 400;\">*JDK - Java Development Kit</span></em></p><p><em><span style=\"font-weight: 400;\">*JEP - Java Enhancements</span></em></p><p><em><span style=\"font-weight: 400;\">*JCP - Java Community Process</span></em></p>"},
{"publishDate": "2016-09-05 10:31", "category": "Careers", "author": "hpretswell", "title": "Software career? There is no such thing as the \"wrong degree\"", "slug": "there-is-no-such-thing-as-the-wrong-degree", "summary": "Continuous learning is part of our culture at Scott Logic, our test engineer Hannah volunteers as a STEM Ambassador in local schools. Find out more here.", "content": "<p><em><span style=\"font-weight: 400;\">Continuous learning and development are part of our culture at Scott Logic, and we encourage all staff to get involved in all kinds of activities, from mentoring, to teaching at Code Clubs to speaking at local meetups and technology events around the world.</span></em></p><p><em><span style=\"font-weight: 400;\">Our test engineer Hannah volunteers as a STEM Ambassador in local schools. Here’s a taste of what she gets up to.</span></em><br><br></p><p><!--more-->Recently, I went along to Mortimer Community College in South Shields to talk about my job in front of a small group of 10-11 year olds, and to do some hands-on problem solving tasks with them. At the end of the session the teacher told me she was surprised to hear there are so many different routes  to get a job in software engineering; she thought it was a clear-cut path -  i.e. you had to study software development, or computer science, at university. This simply confirmed to me the reason that I was there; to inform students, and teachers alike, that there are many different ways to get into software engineering, and there are different roles within it.</p><p><span style=\"font-weight: 400;\">I took quite an odd route into software; I did animation at university and worked in the gaming industry before joining Scott Logic. The look of surprise on the Year 9 and 10 students faces at Hebburn Comprehensive, which I also visited recently, at the fact I’d done animation and not a software-based degree, yet still worked in software was amusing but saddening at the same time. Some part of society has failed to inform these bright young minds that your path through life is not clear-cut: it’s an intricate web of choices and opportunities.</span></p><p><span style=\"font-weight: 400;\">I have been getting involved with a few STEM Ambassador activities with this goal in mind; to show students and teachers that a career in software can be reached from many different paths through different types of education. This is likely to become even more the case as the industry moves so fast. For example, the students were wowed when I told them about the first computer (the Difference Engine by Charles Babbage), which stood at a gaping 11ft wide and 8ft tall, and the first commercial computer UNIVAC 1, which cost $1.5million to buy.</span></p><p><span style=\"font-weight: 400;\">Different skills and personalities can lend different outlooks to problem solving; if all people building software were from the same background, all software may end up the same and we wouldn’t be building and innovating new things. This is especially true for the role of a software tester, as we want people with different backgrounds who can bring different skills, opinions and ideas to the table. I want to show young students that your degree doesn’t define your life. If you make the ‘wrong’ decision, you can still take actions later in life to get on the path you want to be on. And quite often, that ‘wrong’ decision can be what makes you an interesting and good choice for employers.</span></p><p><span style=\"font-weight: 400;\">The STEM Ambassadors event at Hebburn Comprehensive was also a part of NWED (National Women in Engineering Day), in an attempt to encourage more girls to choose STEM subjects at A level and beyond. By informing them of influential historical women (like Ada Lovelace) and also chatting to them about our own job roles, we hoped that we could interest a few of the students in a STEM path. I am very conscious of the low ratio of women to men in STEM roles, and even though we don’t know exactly why, I think it is important to do what we can to help young women to realise their potential in a STEM career.</span></p><p><span style=\"font-weight: 400;\">I hope that I can use my unusual (and apparently interesting!) background to help students either realise that choosing a STEM degree is the easiest path into a STEM job, or show that your degree choice is not the be all and end all. STEM Ambassadors is a great place to help inform the younger generations of their options that they might not get otherwise. If you want some more information on the STEM Ambassadors, click here </span><a href=\"http://www.stemnet.org.uk/ambassadors/\"><span style=\"font-weight: 400;\">http://www.stemnet.org.uk/ambassadors/</span></a><span style=\"font-weight: 400;\">. </span></p>"},
{"publishDate": "2017-03-08 11:16", "category": "Careers", "author": "swilson", "title": "#BeBoldForChange and beat the elephant in the room", "slug": "beboldforchange-and-beat-the-elephant-in-the-room", "summary": "It’s an exciting time to work in UK tech, with companies growing each year. But there's something of an elephant in the room - the lack of women entering STEM", "content": "<p><span style=\"font-weight: 400;\">It’s an exciting time to work in the UK’s technology industry, with companies growing from strength to strength each year. But there is something of an elephant in the room when it comes to the tech industry - the lack of women entering STEM roles, not just in the UK but worldwide.</span></p><p><span style=\"font-weight: 400;\">It’s widely recognised that </span><a href=\"http://techcitynews.com/2017/02/15/heres-how-we-can-solve-techs-diversity-crisis/\" target=\"_blank\"><span style=\"font-weight: 400;\">recruiting a diverse workforce inclusive of women creates a more creative and innovative environment in which to work</span></a><span style=\"font-weight: 400;\">. And well known travel brand Airbnb has vowed to increase its number of technical women to 25 per cent in 2017, but are all tech businesses taking this approach?</span></p><h2><span style=\"font-weight: 400;\">Why is it so difficult to encourage women into STEM roles?</span></h2><p><span style=\"font-weight: 400;\">The Government Equalities Office said in its 2016 report </span><a href=\"https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/500087/Government_response_-_Closing_the_Gender_Pay_Gap.pdf\" target=\"_blank\"><i><span style=\"font-weight: 400;\">Closing the gender pay gap</span></i></a><span style=\"font-weight: 400;\">: “Gendered stereotypes about what society regards as ‘men’s work’ and ‘women’s work’ are a strong influence on young people throughout their education, and can have a significant influence on the career choices they make.”</span></p><p><span style=\"font-weight: 400;\">So the issue clearly can’t be blamed on one single organisation or institution. It’s plain to see that to solve the diversity skills gap, educators, businesses, and campaigners need to come together. Tech innovators and big brands such as Airbnb and Facebook are championing women in STEM, which is leading others to follow in their direction. Unless we work together to encourage more women into STEM, it will constantly be a disjointed process, meaning more women are likely to miss out on reaching their potential in a huge range of fantastic careers.</span></p><h2><span style=\"font-weight: 400;\">Doing our bit</span></h2><p><span style=\"font-weight: 400;\">As a business, we are committed to equal opportunity, so are proud to have more than doubled the number of women in technical roles at our Bristol office over the <a href=\"http://www.scottlogic.com/beingboldforchange-international-womens-day/\" target=\"_blank\">last 12 months</a>.</span></p><p><span style=\"font-weight: 400;\">While encouraging women into STEM is something we work to do across Scott Logic, in Bristol we also support the Women’s Tech Hub, a network organisation committed to addressing this issue, and we also plan to host a Girl Geek Dinner later this year for the second time. Outside of Bristol, we’re also a long-time sponsor of the Lovelace Colloquium, a one-day conference for female STEM students, which this year is celebrating its 10th anniversary. And in Newcastle, we have our very own STEM Ambassador, Hannah, who is passionate about encouraging women and girls into STEM, attending events and taking part in initiatives at local schools and meetups to help the word.</span></p><p><span style=\"font-weight: 400;\">Scott Logic’s Head of Development in Bristol, Nic Hemley, said: “It’s been fantastic to see that our efforts to encourage and support women in STEM can actually make a difference. Whilst we recognise there is still far more for us to do to raise awareness of the gender imbalance in UK technology, we’re incredibly proud to have seen an increase in the numbers of talented women contributing to Scott Logic’s success, not just in Bristol but also nationwide. We hope to build on this momentum and employ many more women over the coming months and years”</span></p><h2><span style=\"font-weight: 400;\">Rose tinted glasses</span></h2><p><span style=\"font-weight: 400;\">Although pleased with our progress to attract a greater number of women into our technical roles, this doesn’t mean there isn’t work to be done. It’s evident from </span><a href=\"https://www.manchesterdigital.com/sites/default/files/Skills%20Audit%20Report%202017.pdf\" target=\"_blank\"><span style=\"font-weight: 400;\">Manchester Digital’s Annual Digital Skills Audit 2017</span></a><span style=\"font-weight: 400;\"> that the gender gap is definitely still apparent in tech, with a split of 72:28 male to female in the northern technology sector compared to 60:40 in 2016.</span></p><p><span style=\"font-weight: 400;\">As a company, we’ll continue to work with meetup groups, schools, and other organisations, to increase awareness of the variety of roles there are in STEM for women and girls to consider. By working together with educators, campaigners and organisations, we will hopefully and gradually be able to tackle this issue. However, it’s an ongoing, long-term process that won’t bring about change overnight. But we are seeing a difference this International Women’s Day, so let’s celebrate that and #BeBoldForChange.</span></p><p><span style=\"font-weight: 400;\">To find out more about the roles we have available, visit <a href=\"http://www.scottlogic.com/careers/vacancies\" target=\"_blank\">scottlogic.com/careers/vacancies</a>.</span></p>"},
{"publishDate": "2016-08-22 16:00", "category": "Careers", "author": "sroebuck", "title": "Building the next generation of technology professionals", "slug": "building-the-next-generation-of-technology-professionals", "summary": "Last week, five Scott Logic staff took time out of the Edinburgh office to lend a hand with the Prewired Summer Hack for young people aged eight to 19.", "content": "<p>Last week, five Scott Logic staff: Courtney, Helen, Jack, Connor and Robert, took time out of the Edinburgh office to lend a hand with the <em>Prewired Summer Hack</em> coding challenge for children and young adults from eight to 19 years of age.</p><p>I'm on the board of Prewired, which is a not-for-profit programming club for young people under the age of 19 and is based in Edinburgh. Participants attend weekly evening sessions where they improve their skills in digital technologies within a friendly, collaborative and supportive environment. The participants spend the whole week working in teams to build a game, application or website based around challenges, this year presented by Shelter Scotland and the City of Edinburgh Council.</p><h2>Bridging the skills gap </h2><p>Scotland, like the wider United Kingdom, has an imbalance between the growing demand for technology professionals and the limited number of graduates leaving universities and colleges with technology skills. The Scottish Government has said that: \"Scotland needs an estimated 11,000 new digital/ICT workers each year to meet current and future demand in the sector and we need to take urgent action to close this gap.\" (Source: <a href=\"http://news.scotland.gov.uk/news/scotland-s-first-digital-skills-academy-opens-its-doors-1e48.aspx\">http://news.scotland.gov.uk/news/scotland-s-first-digital-skills-academy-opens-its-doors-1e48.aspx</a>).</p><p><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Courtney_Yule_with_a_Hacker.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=Courtney_Yule_with_a_Hacker.jpg\" alt=\"Courtney_Yule_with_a_Hacker.jpg\" width=\"634\" height=\"422\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Courtney_Yule_with_a_Hacker.jpg?t=1511177678270&amp;width=317&amp;height=211&amp;name=Courtney_Yule_with_a_Hacker.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/Courtney_Yule_with_a_Hacker.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=Courtney_Yule_with_a_Hacker.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/Courtney_Yule_with_a_Hacker.jpg?t=1511177678270&amp;width=951&amp;height=633&amp;name=Courtney_Yule_with_a_Hacker.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/Courtney_Yule_with_a_Hacker.jpg?t=1511177678270&amp;width=1268&amp;height=844&amp;name=Courtney_Yule_with_a_Hacker.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/Courtney_Yule_with_a_Hacker.jpg?t=1511177678270&amp;width=1585&amp;height=1055&amp;name=Courtney_Yule_with_a_Hacker.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/Courtney_Yule_with_a_Hacker.jpg?t=1511177678270&amp;width=1902&amp;height=1266&amp;name=Courtney_Yule_with_a_Hacker.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></p><p>But the shortage of skilled technologists is a more complicated issue than can simply be attributed to a lack of technology places in higher education. To quote Martin Brown of the <a href=\"http://www.scotsman.com/business/companies/tech/martin-brown-tackling-tech-skills-shortages-1-3901620\" rel=\"nofollow\" target=\"_blank\">Scotsman</a>, \"One would instinctively tend to think of the technology sector as a young person’s game, but the stats tell a different story. Only 14 per cent of employees in the Scottish tech sector are aged 16-24, and the age bracket most workers fall into is 35-44. It seems that young people, despite being more tech-savvy than ever before, are just not being attracted to the industry.\"</p><h2>Tonnes of talent</h2><p>Scott Logic is very much aware of the need for talented technologists and in Scotland we spend a lot of time recruiting specialists for our Edinburgh team. Two of our specialist user experience designers, Courtney and Helen, helped all the teams during the second day to think through and organise their technology ideas and hopefully gave them a wider perspective of the range of critical talents involved in the technology industry. </p><p>Courtney said: \"I was really impressed with the skills that the students already had in coding which meant that we could just get on and focus directly on integrating the user experience within their projects. It was also really fast-paced for us as each group had unique users and projects, meaning we had to adapt our approach constantly to help them find the most value.</p><p><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg\" alt=\"Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg\" width=\"634\" height=\"422\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg?t=1511177678270&amp;width=317&amp;height=211&amp;name=Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg?t=1511177678270&amp;width=951&amp;height=633&amp;name=Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg?t=1511177678270&amp;width=1268&amp;height=844&amp;name=Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg?t=1511177678270&amp;width=1585&amp;height=1055&amp;name=Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg?t=1511177678270&amp;width=1902&amp;height=1266&amp;name=Participants_enjoy_the_Prewired_Summer_Hack_supported_by_Scott_Logic_volunteers.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></p><p>Robert, one of our experienced developers, came to help out on the fourth day and was particularly struck by the talent in the room. He said: “I think I learned more from them than them from me but hopefully they didn’t notice!\"</p><p>It's almost certainly a feeling we all shared as we witnessed the breadth of technologies and tools being used throughout the week to produce the amazing end results that were presented on the last day.</p><p>When our developer Jack was asked to take part in the judging panel I think he knew he had an almost impossible task in trying to decide which of the six great projects should get the top three prizes. But at the end of the day, it really was the achievements of the kids that made the week and everyone went away with the inspiration to keep coding! </p><p>Freda O’Byrne of Prewired generously sent us this message:</p><p>\"Scott Logic mentors enabled us to plan a developmental experience for the young people. Their input at strategic times stretched the knowledge and confidence of participants, encouraging them to reach for project goals that they otherwise might have found difficult to achieve.</p><p>\"The soft skills that the young people practiced: listening, speaking, working in teams made up of people with differing levels of technical ability and experience, valuing each others input, using agile methodology to set and achieve their goals, and then, finally, standing up in front of industry professionals to present their hacks will transfer to other parts of their lives. The graciousness and sensitivity of the mentors in dealing with organisers, other mentors and with children of different ages, needs and abilities was exceptional. Thank you!\"</p><p>To find out more about Prewired, visit <a href=\"https://www.prewired.org/\">prewired.org</a>. </p><hr><p>The Prewired Hack week prizes were donated by Amazon Development Centre Scotland, Codebase and FanDuel. Laptops used by many of the participants during the week were donated to Prewired by Skyscanner. The weeks Hackathon activities were planned and facilitated with the help of Allan Lloyd of Product Forge. Last but not least, Codebase Edinburgh provided the venue for the week, with lots of help and support from Oliver Littlejohn and the rest of the Codebase team.</p>"},
{"publishDate": "2016-10-04 13:19", "category": "Careers", "author": "jwright", "title": "An Insight Into Our 2016 Intern Projects", "slug": "insight-into-our-2016-intern-projects", "summary": "This year we welcomed seven interns to our offices. In this blog post we explore the projects they worked on over their time here.", "content": "<p>At Scott Logic we offer a paid summer internship that gives budding technologists the chance to gain valuable insight into our unique culture and the way in which we develop software for our clients.<br><span style=\"font-weight: 400;\"></span></p><p><span style=\"font-weight: 400;\">This year, we welcomed seven interns across our offices in Bristol, Edinburgh and Newcastle. They worked on a diverse series of internal projects and were supported along the way by a small team of mentors, drawn from our pool of experienced developers and testers. Before the projects begin each year, we provide training on the relevant technologies and processes, via group sessions and in-house written materials. Here is an insight into what our 2016 interns got up to over the summer, and their thoughts on the time they’ve spent with us.</span><br><!--more--></p><h2><span style=\"font-weight: 400;\">breakfast sandwich bot</span></h2><p><span style=\"font-weight: 400;\">One of the projects the interns were tasked with was creating a Slack Bot, which hungry staff could use on Friday mornings to order their weekly breakfast sandwiches. It was built on modern ES2015 JavaScript, and had natural language parsing using Wit.ai, so users could have human-like conversations with it. As bots are a new field, it was a good challenge for the interns and a great opportunity for them to try out new tools and APIs. The project was organised with a similar structure to a real world project, with weekly sprints, a product owner providing requirements, and daily stand-ups. It gave the interns an insight into how projects are run at Scott Logic, and our colleagues successfully got their sandwiches when the bot had its first run!</span></p><p><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot.png?t=1511177678270&amp;width=522&amp;height=272&amp;name=bacon_sarnie_bot.png\" alt=\"bacon_sarnie_bot.png\" width=\"522\" height=\"272\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot.png?t=1511177678270&amp;width=261&amp;height=136&amp;name=bacon_sarnie_bot.png 261w, https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot.png?t=1511177678270&amp;width=522&amp;height=272&amp;name=bacon_sarnie_bot.png 522w, https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot.png?t=1511177678270&amp;width=783&amp;height=408&amp;name=bacon_sarnie_bot.png 783w, https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot.png?t=1511177678270&amp;width=1044&amp;height=544&amp;name=bacon_sarnie_bot.png 1044w, https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot.png?t=1511177678270&amp;width=1305&amp;height=680&amp;name=bacon_sarnie_bot.png 1305w, https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot.png?t=1511177678270&amp;width=1566&amp;height=816&amp;name=bacon_sarnie_bot.png 1566w\" sizes=\"(max-width: 522px) 100vw, 522px\"></span></p><p> </p><p><span style=\"color: #c41565;\"><strong>Jade, University of York</strong></span></p><p>As a Maths student with no experience with code, I’d never considered a career in software testing; prior to my internship, my exposure had been limited to a module in Java in my second year. When I saw Scott Logic’s 12-week internship it looked like too much of a good <span style=\"font-weight: 400;\">opportunity to miss.</span></p><p>From the first day I joined, Scott Logic provided me with the help and tools I needed to learn, apply my skills and develop throughout the summer. During my first couple of weeks, I started using the online Code Academy JavaScript training and then moved onto some HTML5 training materials developed by Scott Logic, while also familiarising myself with the technologies and frameworks I was going to be using over the next three months. After two weeks of training, my skills were put to the test as we started on our main project of the summer - creating a bot for the office.</p><p><span style=\"font-weight: 400;\"><br><span style=\"font-weight: 400;\">Testing the bot was tricky as there has been very little work in this field before. We had to create a second bot which “talked” to our bot, simulating real conversations. It was a good challenge and allowed me to learn a lot about both development, as well as testing with tools such as Jasmine.</span><br></span></p><p><span style=\"color: #c41565;\"><strong>Martin, Durham University</strong></span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Interning here has given me a great insight into working in a real Agile team with modern technologies. The natural language aspect of the project was completely new to me, and provided a lot of opportunities for investigating ways of developing a stable and usable product. </span><br></span></span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot_emoji.png?t=1511177678270&amp;width=480&amp;height=144&amp;name=bacon_sarnie_bot_emoji.png\" alt=\"bacon_sarnie_bot_emoji.png\" width=\"480\" height=\"144\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot_emoji.png?t=1511177678270&amp;width=240&amp;height=72&amp;name=bacon_sarnie_bot_emoji.png 240w, https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot_emoji.png?t=1511177678270&amp;width=480&amp;height=144&amp;name=bacon_sarnie_bot_emoji.png 480w, https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot_emoji.png?t=1511177678270&amp;width=720&amp;height=216&amp;name=bacon_sarnie_bot_emoji.png 720w, https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot_emoji.png?t=1511177678270&amp;width=960&amp;height=288&amp;name=bacon_sarnie_bot_emoji.png 960w, https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot_emoji.png?t=1511177678270&amp;width=1200&amp;height=360&amp;name=bacon_sarnie_bot_emoji.png 1200w, https://smarter.scottlogic.com/hs-fs/hubfs/bacon_sarnie_bot_emoji.png?t=1511177678270&amp;width=1440&amp;height=432&amp;name=bacon_sarnie_bot_emoji.png 1440w\" sizes=\"(max-width: 480px) 100vw, 480px\"></span></span></span></p><p><strong><span style=\"color: #c41565;\">Craig, Northumbria University</span></strong></p><p>I've really enjoyed my internship at Scott Logic; it's been great doing work I'm passionate about and all the way through I’ve been helped and supported by the experienced people here.</p><p><span style=\"font-weight: 400;\">I've learned a great deal during my 12 weeks, including the practicalities of working in an Agile team and interesting areas of focus, such as natural language processing. I’ve really noticed how much my skills have progressed over the course of the summer as the project became more complex and engaging.</span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">I definitely recommend the internship to anyone considering applying, and I hope to come back full time next year as a graduate developer.</span></span></span></span></p><h2><span style=\"font-weight: 400;\">INTERVIEW QUESTIONS EXPLORER</span></h2><p><span style=\"font-weight: 400;\">Another project the interns worked on was building an online interface to the extensive library of interview questions we have in the office, <span style=\"font-weight: 400;\">they used a combination of Express, React and Docker to build a restful API, a frontend, and a containerised deployment solution.</span><span style=\"font-weight: 400;\"> We pride ourselves on offering our interns exposure to the full software development cycle, to give them a more rewarding experience than just writing documentation or attempting to fix bugs. </span></span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/iqe.png?t=1511177678270&amp;width=634&amp;height=363&amp;name=iqe.png\" alt=\"iqe.png\" width=\"634\" height=\"363\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/iqe.png?t=1511177678270&amp;width=317&amp;height=182&amp;name=iqe.png 317w, https://smarter.scottlogic.com/hs-fs/hubfs/iqe.png?t=1511177678270&amp;width=634&amp;height=363&amp;name=iqe.png 634w, https://smarter.scottlogic.com/hs-fs/hubfs/iqe.png?t=1511177678270&amp;width=951&amp;height=545&amp;name=iqe.png 951w, https://smarter.scottlogic.com/hs-fs/hubfs/iqe.png?t=1511177678270&amp;width=1268&amp;height=726&amp;name=iqe.png 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/iqe.png?t=1511177678270&amp;width=1585&amp;height=908&amp;name=iqe.png 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/iqe.png?t=1511177678270&amp;width=1902&amp;height=1089&amp;name=iqe.png 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></span></span></p><p><span style=\"color: #c41565;\"><strong>Jamie, University of Dundee</strong></span></p><p>My summer was spent working on a Full Stack JavaScript application. Initially this was daunting, as I had only written around 10 lines of JavaScript before starting the project. I also gained experience with technologies such as Docker, NGINX and Facebook's ReactJS library. The internship has improved my technical knowledge and skills, while also giving me exposure to Scrum practices in an industry environment.</p><p><strong><span style=\"color: #c41565;\">James, University of Edinburgh</span></strong></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Working at Scott Logic has been a fantastic experience, I have thoroughly enjoyed my time here, learning more than I thought possible in a company full of friendly, supportive coworkers.</span></span></span></span></span></p><h2><span style=\"font-weight: 400;\">COUNTDOWN  GAME</span></h2><p><span style=\"font-weight: 400;\">Last but by no means least was a web-based multi-player game that the interns created for the rest of the office to enjoy. This year, we opted for an implementation of Channel 4’s Countdown. The app was developed using the popular ReactJS library, supported by modern development tools and processes, such as on many of our real client projects. </span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Although our project domain was light-hearted, the delivery process was professional as we wanted to give the interns a taste of life in the real world, customers and all. One of our developers, Tom, kept the interns on their toes with new feature requests and priority changes, just like a real client would. By the end of the summer we had the whole office competing online in the word games, numbers games and conundrums.</span></span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/countdown.png?t=1511177678270&amp;width=634&amp;height=326&amp;name=countdown.png\" alt=\"countdown.png\" width=\"634\" height=\"326\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/countdown.png?t=1511177678270&amp;width=317&amp;height=163&amp;name=countdown.png 317w, https://smarter.scottlogic.com/hs-fs/hubfs/countdown.png?t=1511177678270&amp;width=634&amp;height=326&amp;name=countdown.png 634w, https://smarter.scottlogic.com/hs-fs/hubfs/countdown.png?t=1511177678270&amp;width=951&amp;height=489&amp;name=countdown.png 951w, https://smarter.scottlogic.com/hs-fs/hubfs/countdown.png?t=1511177678270&amp;width=1268&amp;height=652&amp;name=countdown.png 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/countdown.png?t=1511177678270&amp;width=1585&amp;height=815&amp;name=countdown.png 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/countdown.png?t=1511177678270&amp;width=1902&amp;height=978&amp;name=countdown.png 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></span></span></p><p><strong><span style=\"color: #c41565;\">Jamie, University of Bristol</span></strong></p><p>I’ve had a great time at Scott Logic. I spent my summer working on making Countdown cool again, by making a web-based version of the game. This was made using JavaScript, specifically the ReactJS library. This experience has given me exposure to industry standard practices, as well as an insight into how Agile development works. What made the experience even more enjoyable was being surrounded by friendly and helpful co-workers, who were always willing to help and share their own knowledge.</p><p><span style=\"color: #c41565;\"><strong>Raul, University of Bristol</strong></span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">I’ve had such a brilliant experience at Scott Logic; my 12 weeks as an intern here, and the support and advice from my mentors has helped me improve my technical knowledge. Furthermore, the use of Agile methodologies like Scrum gave me a very useful exposure to industry standard practices.  </span></span></span></span></span></span></p>"},
{"publishDate": "2016-11-15 10:32", "category": "Careers", "author": "hpretswell", "title": "Testing is boring: How we can all help destroy the myth", "slug": "testing-is-boring-how-we-can-all-help-destroy-the-myth", "summary": "Lead Test Engineer Daniel recently produced a blog tackling the myths around software testing, one of which being ‘testing is boring’. In this post, fellow Test Engineer Hannah delves a little deeper into this misconception and things we can do to dispel it.", "content": "<p><i><span style=\"font-weight: 400;\">Lead Test Engineer Daniel recently produced a blog </span></i><a href=\"//smarter.scottlogic.com/careers/tacklingthemythsaroundasoftwaretestingcareer\"><i><span style=\"font-weight: 400;\">tackling the myths around software testing</span></i></a><i><span style=\"font-weight: 400;\">, one of which being ‘testing is boring’. In this post, fellow Test Engineer Hannah delves a little deeper into this misconception and things we can do to dispel it.</span></i></p><p><!--more--></p><p><span style=\"font-weight: 400;\">Recently, six testers from around the world got together on a video call and talked about selection issues in testing. I mostly listened, with it being my first </span><i><span style=\"font-weight: 400;\">Tuesday Night Testing</span></i><span style=\"font-weight: 400;\"> and being so awed and fascinated by the experience and knowledge of the people talking. There was one issue that we covered that I feel pretty strongly about; the topic of how to rectify the perception that testing is boring. I did chime in for that one, and was subsequently encouraged to blog about my experiences. I find this topic very interesting as I've been lucky enough to work at places where testing was generally kept interesting and fresh, but I know that a lot of people have this misconception.</span></p><p>In this blog I don't want to discuss ‘why’ people perceive testing as boring (that's a whole other blog post!), but rather what can we do to dispel this myth. In this blog I'm going to share what I've personally been involved with, to help spread the word that actually, testing is fun!</p><h2><span style=\"font-weight: 400;\">starting at the beginning</span></h2><p><span style=\"font-weight: 400;\">The first thing that I got involved with was the STEM Ambassadors, which is all about encouraging children and teens, from primary school to sixth form to choose STEM subjects or careers. For some of the activities I signed up to help with, I had a chance to chat about my job and my experience. It was rewarding to see people who had never heard of testing before have a chance to learn about and question it. I'd like to think that at least one person has gone home with the words <i><span style=\"font-weight: 400;\">Software Tester</span></i><span style=\"font-weight: 400;\"> in mind and will consider it as a future path.</span></span></p><h2><span style=\"font-weight: 400;\">sharing experience</span></h2><p><span style=\"font-weight: 400;\">The second thing that I’ve been involved with is career mentoring at Newcastle University. I was partnered with a second year student from a Computer Science course who had a keen passion for testing. Our first session was simply getting to know each other and figuring out what she wanted out of the mentoring time. For the sessions after that, I encouraged her to read about certain topics, and then we would discuss what she had learnt and what she was interested in. I also brought in my laptop with some buggy software and showed her how I would test, getting her to explore the software as well. I think guiding and showing someone who has an interest in testing is a great thing to do. So few people have the chance to even talk to someone about what testing is before they decide on their career path. I would encourage anyone to get in touch with their local university and see if there are any similar opportunities.</span></p><h2><span style=\"font-weight: 400;\">talks</span></h2><p><span style=\"font-weight: 400;\">At the start of November fellow Tester Jack and myself gave a talk at Newcastle University - instead of just telling the students what testing was, we told stories of our real world experiences with testing. Hopefully hearing what testing is actually like in a real scenario will have interested a few people who perhaps aren't set on a developer role in the future.</span></p><h2><span style=\"font-weight: 400;\">we can all help!</span></h2><p><span style=\"font-weight: 400;\">If people don't know about testing, or all they’ve heard of testing is what they've learnt at university, then how can they know how to pursue it as a career? We have a fantastic community of software testing professionals out there, and we have the experience, knowledge and passion to inspire others to learn more about testing. There are so many opportunities out there for us to get involved and teach. I hope through reading this blog that some of you are inspired to inspire others: through STEM Ambassadors, presentations, mentoring, or any other opportunity you can find. Perhaps one day testing will be a career that people consider long before they enter the working world. We can start by informing people about testing. We can start by creating opportunities. We can destroy the myth one step at a time.</span></p><p><span style=\"font-weight: 400;\">If you're interested in starting a career in testing why not take a look at our <span style=\"color: #c41565;\"><a href=\"http://www.scottlogic.com/careers/vacancies/graduate-software-tester/\" style=\"color: #c41565;\">Graduate Software Tester Programme</a>.</span></span></p>"},
{"publishDate": "2017-03-21 13:42", "category": "Careers", "author": "bjedrzejewski", "title": "Working in a consultancy and working in-house – a view from the inside.", "slug": "working-in-a-consultancy-and-working-in-house-a-view-from-the-inside", "summary": "Lead Developer Bartosz discusses the differences between working for a company that provides in-house development and working as a Scott Logic consultant", "content": "<p><!--more--></p><p><span style=\"font-weight: 400;\">I joined Scott Logic after working for a product company for more than five years. There are some interesting differences between working for a company that provides in-house development and working as a Scott Logic consultant.</span></p><p>There are of course the obvious differences between the two, which may depend on the company that you’re comparing consulting with. For a start, consulting is a client-facing job, where you’ll be dealing with people outside your company on a daily basis. That changes a few things. Commercial knowledge becomes more relevant, as you may be pulled into a commercial conversation with clients. This of course increases with the level of seniority you operate at within a consultancy.</p><p>Being client facing means there are higher requirements for diplomacy and communication, less crucial in an in-house position. Another obvious difference is the level of change and adaptation required from consultants. You may need to change your technical stack completely when moving between projects. I believe this helps to stay at the cutting edge of technology.</p><p><span style=\"font-weight: 400;\">However there are some differences between these two areas that are not immediately obvious when looking from the outside in. When it comes to job satisfaction, there are a number of other areas to look at , such as motivation. I follow the ideas of </span><a href=\"http://www.danpink.com/books/drive/\"><span style=\"font-weight: 400;\">Daniel H. Pink’s </span><i><span style=\"font-weight: 400;\">Drive</span></i></a><span style=\"font-weight: 400;\">, a fascinating book about motivation and job satisfaction. The author argues that what matters most are autonomy, mastery and purpose. So, let’s see how consulting and in-house development compare in these categories.</span></p><h2><span style=\"font-weight: 400;\">autonomy</span></h2><p>Autonomy, or our desire to be self-directed. The more autonomy we have in the workplace, the more engaged we usually are. We want to be able to complete tasks in the way we think best. This, I believe, is especially true for software developers!</p><p><span style=\"font-weight: 400;\">Do working in-house and autonomy go well together? There are a few sides to this story. On one hand, being </span><i><span style=\"font-weight: 400;\">on the inside</span></i><span style=\"font-weight: 400;\"> could mean you’re watched less closely, but it may also mean you’re required to do things the way they’ve always been done in your company. You may be lucky and be able to choose your own projects and products, but more often than not, you’ll specialise in a specific product or area. You're more likely to be limited to specific technologies that are already in use.</span></p><p>I feel I’ve gained autonomy as a Scott Logic consultant. Working for a consultancy gives you opportunities to work on different projects and technologies, while keeping the same job and staying on your career track. You’re able to try different things and Scott Logic always looks for a good fit between what someone wants to do and what projects are available.</p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">As you become more experienced as a software consultant you’re often brought in as an expert, to lead and establish best practice and processes. It’s a fantastic feeling not only to have that autonomy, but also to see the positive impact it can bring. Of course, nothing is black and white and consulting also has its challenges. Sometimes you need to win trust from the client before you are given that autonomy, but I see that as a welcome challenge.</span></span></p><h2><span style=\"font-weight: 400;\">mastery</span></h2><p>Mastery is the urge to continuously improve your skills. It’s also the area in which I believe consulting has the greatest advantage over in-house development. Rather than working on a product, when working in consultancy, the product is you - the developer! This really changes the company's approach to investing in its people and encouraging learning.</p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">At Scott Logic, the most important </span><i><span style=\"font-weight: 400;\">product </span></i><span style=\"font-weight: 400;\">is the quality, skill and knowledge of its consultants, and I find it inspiring to be surrounded by like-minded developers, from graduate level right up to our CTO, genuinely dedicated to constantly learning and getting better at what they do, as well as sharing their knowledge and helping others along the way.</span></span></p><h2>purpose</h2><p><span style=\"font-weight: 400;\">Purpose is the desire to do something that matters. When you go to work, you want to make a positive impact and see that what you do makes a difference. And making a positive difference by delivering a product used by thousands can feel pretty amazing. But unless you’re working for a great start-up, or a company that constantly keeps disrupting the market with a new idea, a high-end consulting company compares quite favourably here! </span></p><p>In my experience, the kind of projects Scott Logic is involved in are crucial to the client; so it’s important to get the best people they can, to deliver the project well and potentially introduce something new to the company. In these circumstances, it’s easy to see that your work is meaningful and makes a positive impact.</p><p><span style=\"font-weight: 400;\">In addition to client work, many of us consultants find time to volunteer to teach code through </span><a href=\"https://www.codeclub.org.uk/\"><span style=\"font-weight: 400;\">Code Club</span></a><span style=\"font-weight: 400;\"> and other similar charity organisations.</span></p><h2><span style=\"font-weight: 400;\">Career prospects and progression</span></h2><p><span style=\"font-weight: 400;\">This is something I’ve found interesting and quite different from the technologists’ average experience in a product company, where you have to really work to not be seen as </span><i><span style=\"font-weight: 400;\">just a developer</span></i><span style=\"font-weight: 400;\">. Being promoted is hard in this environment, and stepping outside the traditional development role can be very difficult. At Scott Logic though, technical excellence, together with consulting experience, is a mix that can take you anywhere in your career. </span></p><p>Many people at the top of their careers are still highly technical and help run the company. You can be a software development consultant and go on to become a client manager, a head of user experience, run a whole office as head of development or even become a CTO! There seems to be no limit to where you can end up if you start as a consultant!</p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">To sum up, it’s important to remember there are no two identical companies. When it comes to being an in-house developer in a product company, you may have had very different experiences to me. But I want to highlight the fact that consulting offers a fascinating alternative, where you can really feel like you’re in the driving seat, taking your career further. When you’re gaining more skills and encouraged to take more responsibility on client projects, and the goals of the company are closely aligned with your own, it can only lead to great things!</span></span></p>"},
{"publishDate": "2017-02-08 14:17", "category": "Careers", "author": "wtrimble", "title": "The Scott Logic Bugathon: what to expect", "slug": "scott-logic-bugathon-what-to-expect", "summary": "We're hosting a Bugathon on 18th March in partnership with Newcastle University, find out about how we created it and what to expect on the day.", "content": "<p><!--more-->On joining Scott Logic in October 2016, one of my first assignments was to help organise a bugathon, an idea which had been under discussion for some time. Scott Logic frequently hosts coding events with university computing societies across the country, and it was agreed a testing-focused event was beyond due. Since then we have been in discussions with Newcastle University and arranged a bug hunt event on 18th March, in collaboration with the Newcastle University Computing and Technology Society.</p><p>The aim was to create a fun experience that would be worthwhile for organisers and attendees alike, as well as to raise awareness of software testing as a career and what it entails.</p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Often used as a means of including the wider software team in testing, a bugathon is typically a time-boxed activity in which all team members use whatever means they can think of to find bugs in developed software. By encouraging the wider team to participate, it means the software under scrutiny is exercised by people with a more diverse range of skills, perspectives and experience. This means bugs are more likely to be uncovered that otherwise may not have been found until the system was released into production.</span></span></p><h2><span style=\"font-weight: 400;\">decision,decisions</span></h2><p>As we were creating a bespoke bugathon we were able to inject bugs into the system, purposefully making some more challenging to find. Also, given the bug hunt will be relatively short, we wanted something that would be familiar to attendees, that wouldn’t require hours of briefing to set the context.</p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">After some internal discussion, we settled on  (we want to keep an element of surprise, so you will find out more about the solution on the day). We selected technologies that presented our developers with valuable experience for future client-focused projects. From my perspective, and also the other developers involved, this has been an interesting piece of work; when you’ve spent most of your career trying to make user friendly applications which provide useful outcomes for the user, purposefully doing the opposite does not come easy. </span></span></p><h2><span style=\"font-weight: 400;\">expect the unexpected</span></h2><p>As well as trying to keep track of the bugs which we wanted to insert, when making the app we found some accidental bugs that we actually wanted to put back in! That was in itself a good learning exercise, which looked easier on paper.</p><p><span style=\"font-weight: 400;\">In preparation for the bug hunt event in March, members of Scott Logic’s growing test team have now trawled through the app; we’ll be a bit embarrassed if the hunt throws up too many bugs we weren’t expecting! Come to think of it, that may make a nice prize category on the day, the team that finds the most </span><i><span style=\"font-weight: 400;\">unexpected</span></i><span style=\"font-weight: 400;\"> bugs.</span></p><p>The developed application will require testers to form teams and collaborate to effectively find bugs. This teamwork element is an important factor in making the event as fun as possible, bearing in mind the free beer and pizza won’t arrive until after the awarding of prizes.</p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">We hope attendees will leave the event and consider a career in software testing, or at the very least, appreciate the effort testers put in to help deliver high quality software, and the challenges of their role.</span></span></p><h2><span style=\"font-weight: 400;\">insider tips</span></h2><p><span style=\"font-weight: 400;\">We’ve identified a series of categories for which prizes will be awarded. Some are already defined and some will be awarded as spot prizes.</span></p><p>Teams will need to decide quickly what their test approach is going to be, how to prioritise and gain test coverage of the features, and whether to spend time looking for a few high impact, difficult to find bugs, or log more of the more straightforward ones. They’ll need to think about how much time and effort to spend describing the bug in a report, bearing in mind that it needs to be easy for someone else to understand, recreate and resolve.</p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The cynic in me expects the most popular approach will be to find the bugs that help win the prizes. Each team will be able to see how others are faring, which prizes have been won and which are still up for grabs; they may adapt their approach as everyone’s bug logs are analysed over time.  </span></span></p><h2><span style=\"font-weight: 400;\">the main event</span></h2><p><span style=\"font-weight: 400;\">As mentioned before we’ll be hosting a bugathon alongside Newcastle University Computing &amp; Technology Society (NUCATS) on campus on March 18th. </span></p><p>We’ll be projecting a leaderboard for all to see; teams will be awarded points for finding bugs and the quality of their bug reports, while points will be deducted for logging duplicates! I’m looking forward to seeing how different teams react to the changing state of the board.</p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">I’m also eager to hear from each team about how they approached the task, what information or experiences informed this, and how they adapted their approach as they learned more about the application. Individual inventiveness should never be underestimated, so I’m expecting to see each team come up with something quite different. </span></span></span></p><p>If you're interested in starting a career in testing why not take a look at our <span style=\"color: #c41565;\"><a href=\"http://www.scottlogic.com/careers/vacancies/graduate-software-tester/\" style=\"color: #c41565;\">Graduate Software Tester Programme</a>.</span></p>"},
{"publishDate": "2016-08-11 13:42", "category": "Careers", "author": "jwright", "title": "Day by day - week one as a Scott Logic 2016 graduate", "slug": "day-by-day-week-one-as-a-scott-logic-2016-graduate", "summary": "Last week was a busy week for our second lot of 2016 graduates as they embarked on their first week at Scott Logic - read on to find out what they got up to.", "content": "<p><br><span style=\"font-weight: 400;\">Last week we welcomed 11 new Software Development and User Experience (UX) graduates to the <a href=\"http://www.scottlogic.com/new-starters-launch-our-graduate-programme/\">second part</a> of our 2016 graduate programme. Our graduates are placed across the different Scott Logic offices in Bristol, Edinburgh and Newcastle so grad week is a great way to bring everyone together and get them involved in a number of team building activities such as go karting, pool and of course going to the pub! </span></p><p><!--more--><span style=\"font-weight: 400;\">It’s also a brilliant way of preparing them for the sort of things they will be working on in the future. As part of the week they’re given an initial overview of UX, Software Development and Testing to ensure they have an overall understanding of what we do as a business. </span></p><p><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/IMG_3614-1.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=IMG_3614-1.jpg\" alt=\"IMG_3614-1.jpg\" width=\"634\" height=\"422\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/IMG_3614-1.jpg?t=1511177678270&amp;width=317&amp;height=211&amp;name=IMG_3614-1.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/IMG_3614-1.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=IMG_3614-1.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/IMG_3614-1.jpg?t=1511177678270&amp;width=951&amp;height=633&amp;name=IMG_3614-1.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/IMG_3614-1.jpg?t=1511177678270&amp;width=1268&amp;height=844&amp;name=IMG_3614-1.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/IMG_3614-1.jpg?t=1511177678270&amp;width=1585&amp;height=1055&amp;name=IMG_3614-1.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/IMG_3614-1.jpg?t=1511177678270&amp;width=1902&amp;height=1266&amp;name=IMG_3614-1.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></p><h2><span style=\"font-weight: 400;\">monday</span></h2><p>The day kicked off with an overall introduction to the company - exploring what we do, who we work with and the values that Scott Logic employees have in one way, shape or form.</p><p>They were also given an insight into the types of projects they could potentially work on in the future and what we have to offer at each of our offices in Newcastle, London, Bristol and Edinburgh.</p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The graduates were then given the interesting task of building a sturdy bridge out of straws. The bridge’s strength was tested with a number of different things including a BB-8, a can of beans, a toy car and a tool box. Of course everyone was a winner in our eyes … except maybe one team that evidently lost (see below).</span></span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Building_Bridges39.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=Building_Bridges39.jpg\" alt=\"Building_Bridges39.jpg\" width=\"634\" height=\"422\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Building_Bridges39.jpg?t=1511177678270&amp;width=317&amp;height=211&amp;name=Building_Bridges39.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/Building_Bridges39.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=Building_Bridges39.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/Building_Bridges39.jpg?t=1511177678270&amp;width=951&amp;height=633&amp;name=Building_Bridges39.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/Building_Bridges39.jpg?t=1511177678270&amp;width=1268&amp;height=844&amp;name=Building_Bridges39.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/Building_Bridges39.jpg?t=1511177678270&amp;width=1585&amp;height=1055&amp;name=Building_Bridges39.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/Building_Bridges39.jpg?t=1511177678270&amp;width=1902&amp;height=1266&amp;name=Building_Bridges39.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"><br></span></span></p><h2><span style=\"font-weight: 400;\">Tuesday</span></h2><p>The second day started with the graduates delving into the Scott Logic values even further by creating models of what our values represent. We had a number of brilliant entries - you can see an example of some of the ideas below. Following that they moved onto learning about the world of finance where they hit the ground running, finding a major bug in a trading application straight away!</p><p><span style=\"font-weight: 400;\"><br><span style=\"font-weight: 400;\">At the end of the day a group of us made our way down to Lane 7 in Newcastle for the Scott Logic Pool Championships. It was a close call and the 2016 graduates put up a good fight with some of them making it to the semi-final - but 2015 graduate Drew took the overall 2016 pool championship title beating Ashley 2-0.</span></span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Values_Challenge04.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=Values_Challenge04.jpg\" alt=\"Values_Challenge04.jpg\" width=\"634\" height=\"422\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Values_Challenge04.jpg?t=1511177678270&amp;width=317&amp;height=211&amp;name=Values_Challenge04.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/Values_Challenge04.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=Values_Challenge04.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/Values_Challenge04.jpg?t=1511177678270&amp;width=951&amp;height=633&amp;name=Values_Challenge04.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/Values_Challenge04.jpg?t=1511177678270&amp;width=1268&amp;height=844&amp;name=Values_Challenge04.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/Values_Challenge04.jpg?t=1511177678270&amp;width=1585&amp;height=1055&amp;name=Values_Challenge04.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/Values_Challenge04.jpg?t=1511177678270&amp;width=1902&amp;height=1266&amp;name=Values_Challenge04.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></span></span></p><h2><span style=\"font-weight: 400;\">Wednesday</span></h2><p><span style=\"font-weight: 400;\">On the third day the graduates were given an insight into what the User Experience team get up to by creating designs for an FX trading application “GradTrader”. They were given an overview of the design process with a particular focus on the concept of designing for the user. Each group had their own user to design for, they produced personas, screen flows, feature lists and sketches for a final presentation.</span></p><p><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/UX09_1.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=UX09_1.jpg\" alt=\"UX09_1.jpg\" width=\"634\" height=\"422\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/UX09_1.jpg?t=1511177678270&amp;width=317&amp;height=211&amp;name=UX09_1.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/UX09_1.jpg?t=1511177678270&amp;width=634&amp;height=422&amp;name=UX09_1.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/UX09_1.jpg?t=1511177678270&amp;width=951&amp;height=633&amp;name=UX09_1.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/UX09_1.jpg?t=1511177678270&amp;width=1268&amp;height=844&amp;name=UX09_1.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/UX09_1.jpg?t=1511177678270&amp;width=1585&amp;height=1055&amp;name=UX09_1.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/UX09_1.jpg?t=1511177678270&amp;width=1902&amp;height=1266&amp;name=UX09_1.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></span></p><h2>THURSDAY</h2><p>After designing GradTrader on Wednesday, the graduates were introduced to Software Development at Scott Logic. The day had a number of lightning talks on subjects like: Git, HTML5, CSS and D3FC. They were then set to work on GradTrader - the app had a number of purposely placed holes in it, their task was to find and fix them.</p><p>The day was finished with the obligatory grad week go karting session. Unfortunately a huge rain cloud decided to pass through as they were on the track but  they didn’t let their drenched clothes dampen their spirits. Well done to Jonathan Hodges who was the overall winner and was rewarded with a rather oversized go karting t-shirt!</p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Returning 2015 intern Georgiana said: “This week was really enjoyable - getting to know new people and working in teams to solve various small tasks was really fun. We've also had the chance to get a better insight into the company's history and values as well as explore new technologies. Everyone was really friendly and very helpful.”  </span></span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/go_karting_rotated.jpg?t=1511177678270&amp;width=1522&amp;name=go_karting_rotated.jpg\" alt=\"go_karting_rotated.jpg\" width=\"1522\" title=\"go_karting_rotated.jpg\" caption=\"false\" data-constrained=\"true\" style=\"width: 1522px;\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/go_karting_rotated.jpg?t=1511177678270&amp;width=761&amp;name=go_karting_rotated.jpg 761w, https://smarter.scottlogic.com/hs-fs/hubfs/go_karting_rotated.jpg?t=1511177678270&amp;width=1522&amp;name=go_karting_rotated.jpg 1522w, https://smarter.scottlogic.com/hs-fs/hubfs/go_karting_rotated.jpg?t=1511177678270&amp;width=2283&amp;name=go_karting_rotated.jpg 2283w, https://smarter.scottlogic.com/hs-fs/hubfs/go_karting_rotated.jpg?t=1511177678270&amp;width=3044&amp;name=go_karting_rotated.jpg 3044w, https://smarter.scottlogic.com/hs-fs/hubfs/go_karting_rotated.jpg?t=1511177678270&amp;width=3805&amp;name=go_karting_rotated.jpg 3805w, https://smarter.scottlogic.com/hs-fs/hubfs/go_karting_rotated.jpg?t=1511177678270&amp;width=4566&amp;name=go_karting_rotated.jpg 4566w\" sizes=\"(max-width: 1522px) 100vw, 1522px\"></span></span></p><h2>friday</h2><p><span style=\"font-weight: 400;\">On Friday our Test Engineer Hannah was ready to inform the fresh faced graduates about how Scott Logic approaches testing. In the morning they focused on manual testing: she got them to think outside the box when creating mind maps and to test ideas for GradTrader. They then went away and tested using the heuristics and test ideas they’d produced. </span></p><p>In the afternoon they focused on integration and e2e testing and they wrote their own automated tests using what they had learnt in the morning. At the end of the day Hannah started them off on a “bug hunt” with prizes for the team that found the most interesting bug, and the team that found the most bugs. One team found 19 bugs in 20 minutes, and another team found that the graph in the application went back past the 1800’s, when we are pretty sure one of the currencies in question didn’t even exist…</p><p>Finally, the week was finished off with a well deserved pint at the Town Wall in Newcastle.</p><p><span style=\"font-weight: 400;\">One of our Consultants Sam, who put together the graduate programme said: “It’s been a great week for the grads to get to know each other and the company. By designing, fixing and testing GradTrader they’ve got a useful foundation of knowledge to build upon in the future.”</span></p><p> </p>"},
{"publishDate": "2016-04-01 15:50", "category": "Careers", "author": "hpretswell", "title": "The 2016 BCSWomen Lovelace Colloquium - A Retrospective", "slug": "the-2016-bcswomen-lovelace-colloquium-a-retrospective", "summary": "A first-timer at the annual BCSWomen Lovelace Colloquium, I wasn’t sure what to expect, but was keen to answer any questions about careers in software.", "content": "<p><span style=\"font-weight: 400;\">As a first-timer at the annual </span><a href=\"http://bcswomen.bcs.org/?chronosly=bcswomen-lovelace-colloquium\"><span style=\"font-weight: 400;\">BCSWomen Lovelace Colloquium</span></a><span style=\"font-weight: 400;\">, I wasn’t sure what to expect, but I was keen to attend as many of the day’s presentations as possible, as well as answer whatever questions I could from the female undergraduates hoping to find out more about their career options in software.</span></p><p><span style=\"font-weight: 400;\">We had a lot of different questions directed at us at the Scott Logic </span><a href=\"http://www.scottlogic.com\"></a><span style=\"font-weight: 400;\">stand, from the c.170 STEM (Science, Technology, Engineering and Maths) students in the hall, some of whom had travelled from as far north as Aberdeen and as far south as Exeter universities. Many enquired about what we had to offer them as an </span><a href=\"http://www.scottlogic.com/careers/life-at-scott-logic/\"><span style=\"font-weight: 400;\">employer</span></a><span style=\"font-weight: 400;\">, how to </span><a href=\"//smarter.scottlogic.com/careers/landing-your-first-graduate-job\"><span style=\"font-weight: 400;\">prepare for an interview</span></a><span style=\"font-weight: 400;\">, and whether they’d be able to get a job in software if they aren’t studying </span><a href=\"//smarter.scottlogic.com/careers/i-dont-have-a-computer-science-degree-can-i-still-work-in-software-development\"><span style=\"font-weight: 400;\">computer science</span></a><span style=\"font-weight: 400;\">. We also had quite a few approaches from people who said they didn’t want to become developers, and wanted to know what other options there were in the software field.</span></p><h2>So many options</h2><p><span style=\"font-weight: 400;\">I can’t help thinking it’s a shame to get asked this, as it shows there’s </span><a href=\"//smarter.scottlogic.com/careers/why-the-pushforparity-is-a-slow-burn\"><span style=\"font-weight: 400;\">something lacking</span></a><span style=\"font-weight: 400;\"> in educational careers advice if you aren’t given more accurate, or at least broader information, about the many paths you can take after uni. Simply Googling isn’t enough to get a really good impression of the number of options there can be. Most undergraduates I spoke with were at an early stage in their studies and career decision-making, so it was nice to feel we were being useful to them.</span></p><p><span style=\"font-weight: 400;\">So, I spoke about what I do in my day to day work as a </span><a href=\"http://www.scottlogic.com/careers/our-people/hannah-newcastle/\"><span style=\"font-weight: 400;\">tester</span></a><span style=\"font-weight: 400;\"> at Scott Logic</span><a href=\"http://www.scottlogic.com\"></a><span style=\"font-weight: 400;\">, and it was really nice to see people’s interest in </span><a href=\"//smarter.scottlogic.com/careers/tacklingthemythsaroundasoftwaretestingcareer\"><span style=\"font-weight: 400;\">software testing</span></a><span style=\"font-weight: 400;\">, as it’s a career option a lot of people haven’t really encountered before they enter the world of work. And people seemed generally interested in our </span><a href=\"http://www.scottlogic.com/careers/graduateprogramme/\"><span style=\"font-weight: 400;\">graduate programme</span></a><span style=\"font-weight: 400;\">, which is great news. It’s nice to think I may end up welcoming some of those I spoke to as colleagues in the future.</span></p><h2>Lots to take in</h2><p><span style=\"font-weight: 400;\">Grabbing a few minutes away from our sponsor’s stand, we also had a look around at some of the posters the students had put up for the event. There were a lot of very interesting ones, on topics ranging from the </span><i><span style=\"font-weight: 400;\">gender divide in technology</span></i><span style=\"font-weight: 400;\">, and whether </span><i><span style=\"font-weight: 400;\">video games are a sport,</span></i><span style=\"font-weight: 400;\"> to </span><i><span style=\"font-weight: 400;\">machine learning</span></i><span style=\"font-weight: 400;\"> and </span><i><span style=\"font-weight: 400;\">voice-controlled telepresence robots</span></i><span style=\"font-weight: 400;\">. My personal favourite was on </span><i><span style=\"font-weight: 400;\">software testing - a myth or priority</span></i><span style=\"font-weight: 400;\">. Talking to the student who wrote this, we discussed </span><span style=\"font-weight: 400;\">some of the pitfalls testers encounter, how working as a team with developers can aid in testing, and a tester’s role in getting a good quality final product out.</span></p><p><span style=\"font-weight: 400;\">I also managed to get to three of the presentations, one about </span><i><span style=\"font-weight: 400;\">open source intelligence</span></i><span style=\"font-weight: 400;\">, one on </span><i><span style=\"font-weight: 400;\">technology for social good</span></i><span style=\"font-weight: 400;\"> and another about </span><i><span style=\"font-weight: 400;\">the brain computer interface</span></i><span style=\"font-weight: 400;\">. All of these were dynamic and engaging presentations. The </span><i><span style=\"font-weight: 400;\">open source intelligence</span></i><span style=\"font-weight: 400;\"> presentation was scary to say the least; the presenter showed us how within half an hour, she was able to collect great amounts of information on one individual person: where she worked, where she lived, where her family lived and where her boyfriend lived and worked. It showed that whatever we put on the internet is out there for whoever wants to see it, and that is quite unsettling if you think about that information getting into the wrong hands.</span></p><h2>Together we stand</h2><p><span style=\"font-weight: 400;\">While my colleague John took questions as part of a panel at the end of the day, I reflected on what was all in all, a very good day. We’re already signed up to sponsor next year’s 10th annual colloquium and I’m proud we remain committed to our involvement in the event. I hope that from a Scott Logic and a recruitment perspective we were both able to give assurance to the women in attendance that there is very much a career to be had for them in tech should they wish to pursue it, and meeting so many like-minded and enthusiastic women was fantastic.</span></p><p><span style=\"font-weight: 400;\">However, as an industry moving forward, I feel events like this should include more men. After all, the issue these events try to address is the exclusion of, or unfair disadvantages for women when it comes to working in technology. There’s a danger that by having women-only groups and events, we create a bigger divide rather than minimising it, and this can sour young impressionable people towards working in STEM. We must be careful or risk creating an impression for women and girls that there’s an us and them culture in STEM, where females must stick together because they </span><i><span style=\"font-weight: 400;\">will</span></i><span style=\"font-weight: 400;\"> be discriminated against. This simply isn’t the case, and the idea is enough to put anyone off a career path into STEM. All of us as women, alongside our male colleagues, need to collaborate to tackle this issue </span><i><span style=\"font-weight: 400;\">together</span></i><span style=\"font-weight: 400;\">. It’s an issue that in the end affects all of us, not just women. </span></p><strong><br><span style=\"font-weight: 400;\">Applications for Scott Logic’s 2016 graduate programme and </span><a href=\"http://www.scottlogic.com/careers/internship/\"><span style=\"font-weight: 400;\">internships</span></a><span style=\"font-weight: 400;\"> remain open, and from October this year, we’ll also be taking applications for our 2017 opportunities. To find out more about these vacancies, visit </span><a href=\"http://www.scottlogic.com/careers/vacancies/\"><span style=\"font-weight: 400;\">scottlogic.com/careers/vacancies/</span></a><span style=\"font-weight: 400;\">, or for a less formal chat, contact us at </span><a href=\"/cdn-cgi/l/email-protection#6b0a1b1b0702080a1f020405182b1808041f1f07040c020845080406\"><span style=\"font-weight: 400;\"><span class=\"__cf_email__\" data-cfemail=\"1a7b6a6a7673797b6e737574695a6979756e6e76757d737934797577\">[email protected]</span></span></a><span style=\"font-weight: 400;\">. </span></strong>"},
{"publishDate": "2016-07-18 14:22", "category": "Careers", "author": "amjones", "title": "Euros 2016: how you can have a whole bot of fun at Scott Logic", "slug": "how-you-can-have-a-whole-bot-of-fun-at-scott-logic", "summary": "Euro 2016 may have been a little disappointing and flat, but the same can’t be said for the Scott Logic Euro 2016 table football tournament...", "content": "<p><span style=\"font-weight: 400;\">Euro 2016 may have been a little disappointing and flat (especially for England fans), but the same can’t be said for the Scott Logic Euro 2016 table football tournament. It’s the third annual competition held in the Newcastle office and as ever, it was full of surprises and enjoyment; 32 players battled it out to be crowned champion (and have bragging rights until the next noteworthy sporting event). Each player was randomly assigned a team from the real tournament, and matches were more or less synchronised with when your host nation played. The competition was so popular that we had to introduce eight additional teams in the form of micronations such as </span><a href=\"http://www.sealandgov.org/\"><span style=\"font-weight: 400;\">The Principality of Sealand</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"http://www.frestonia.org/\"><span style=\"font-weight: 400;\">Frestonia</span></a><span style=\"font-weight: 400;\">.</span></p><p><!--more-->One of the annoyances in the previous two years was organising matches, recording results and pestering people to get their matches played! These were all tasks that technology could easily solve for us, so this year we decided to use the competition to gain experience using new and exciting technologies. Slack is gaining widespread adoption globally and bots are becoming a big talking point in the tech world, so we decided to create a <span style=\"color: #000000;\">Slack table football-bot</span>, affectionately known around the office as MottyBot, after famed football commentator John Motson.</p><p><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Mottybot_capture_1-1.jpg?t=1511177678270&amp;width=634&amp;name=Mottybot_capture_1-1.jpg\" alt=\"Mottybot_capture_1-1.jpg\" width=\"634\" title=\"Mottybot_capture_1-1.jpg\" caption=\"false\" data-constrained=\"false\" style=\"width: 634px; height: 329px;\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Mottybot_capture_1-1.jpg?t=1511177678270&amp;width=317&amp;name=Mottybot_capture_1-1.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/Mottybot_capture_1-1.jpg?t=1511177678270&amp;width=634&amp;name=Mottybot_capture_1-1.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/Mottybot_capture_1-1.jpg?t=1511177678270&amp;width=951&amp;name=Mottybot_capture_1-1.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/Mottybot_capture_1-1.jpg?t=1511177678270&amp;width=1268&amp;name=Mottybot_capture_1-1.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/Mottybot_capture_1-1.jpg?t=1511177678270&amp;width=1585&amp;name=Mottybot_capture_1-1.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/Mottybot_capture_1-1.jpg?t=1511177678270&amp;width=1902&amp;name=Mottybot_capture_1-1.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></p><p><span>See MottyBot in action <a href=\"https://drive.google.com/file/d/0B3qUddq0nkQ2aFRrd3l1NVJEZXc/view?usp=sharing\">here</a>.</span></p><h2><span style=\"font-weight: 400;\">BOTS it all about?</span></h2><p><span style=\"font-weight: 400;\">Coupled with the rise of bots there has been a massive surge of interest in natural language text processors, or parsers, with Facebook’s </span><a href=\"https://wit.ai/\"><span style=\"font-weight: 400;\">Wit</span></a><span style=\"font-weight: 400;\">, Google’s Parsey McParseface and many others still in development. We wanted our bot to be easy to talk to, so incorporating a natural language parser would allow us to gather information using specific commands. To make quick progress we used several packages to handle the core functionality: </span><a href=\"https://howdy.ai/botkit/\"><span style=\"font-weight: 400;\">Botkit</span></a><span style=\"font-weight: 400;\"> provided easy integration with Slack, and Microsoft’s recently released Botbuilder provided integrated access to its natural language parser </span><a href=\"https://www.luis.ai/\"><span style=\"font-weight: 400;\">LUIS</span></a><span style=\"font-weight: 400;\">. </span></p><p><span style=\"font-weight: 400;\">With these packages as a foundation, we quickly enabled the bot to record results, display upcoming matches and post new results to the main table football channel. Thanks to LUIS, people were able to interact with these core features in a natural way, talking to the bot rather than issuing instructions. There were plenty of features we still wanted to add, as well as challenges caused by working with emerging technologies. On several occasions LUIS, which was in beta, suffered outages and the bot failed as a result. Alongside that, the two bot kits were so new (Botbuilder was only three weeks old when we started), we had to inspect their code to understand or find functions and communicate directly with the developers to get help or report bugs. Working with such young technologies was certainly challenging, but it felt great to be part of such an early stage in its development.</span></p><h2><span style=\"font-weight: 400;\">Bot’s next?</span></h2><p><span style=\"font-weight: 400;\">One of our main goals was to make the bot feel less bot-like. Having the bot understand natural language helped with this, but only with one direction of the conversation. We worked hard to train the parser to interpret incoming sentences, but if the bot always replied with the exact same messages and only spoke when spoken to, it would still appear robotic. We solved this by introducing a great deal of randomness to the bot’s communication. This made it increasingly difficult to test. </span></p><p><br><span style=\"font-weight: 400;\">For every possible function we provided a plethora of replies the bot could randomly pick from and personalise. We also added functionality to allow it to react to simple things such as “hello” and “thank you”. As well as randomising the responses, we gave the bot the capability to initiate posts, sending gifs, jokes and news stories randomly throughout working hours. This helped give the impression that it was active and not just waiting for people to talk to it. In the end you could have an interesting, albeit table football-based <span style=\"color: #c41565;\"><a href=\"https://drive.google.com/file/d/0B3qUddq0nkQ2eFdxbDlnUnpDMVE/view?usp=sharing\" style=\"color: #c41565;\">conversation</a> </span>with the bot.</span></p><h2><span style=\"font-weight: 400;\">Woops - botty mouth!</span></h2><p><span style=\"font-weight: 400;\">When it came to releasing the bot we quickly realised how differently everyone speaks. The bot had been trained to understand as many different ways to be asked and told things as we could imagine, and we were pretty confident in how it would perform. Within the first few hours we realised how wrong we’d been. LUIS made it easy to examine incorrectly parsed sentences and correct them, so the more the bot was used the better it became. It wasn’t long before MottyBot started to understand everything again, but this exposed him as a bot, and limited the user interactions we received.</span></p><p><span style=\"font-weight: 400;\">One unintended effect of MottyBot’s randomness was that he could be inappropriate. While his replies were specifically written by us, his joke and gif sources were </span><i><span style=\"font-weight: 400;\">scraped</span></i><span style=\"font-weight: 400;\"> from rss feeds and websites. We checked these to ensure they were appropriate for the workplace, but one slipped past us. We quickly implemented a censorship feature that made the bot check with us whether a joke was ok to post. After Microsoft’s bot which went a little </span><a href=\"http://www.telegraph.co.uk/technology/2016/03/24/microsofts-teen-girl-ai-turns-into-a-hitler-loving-sex-robot-wit/\"><span style=\"font-weight: 400;\">too far</span></a><span style=\"font-weight: 400;\">, we’re in good company, but it’s a cautionary tale for those giving their bot too much freedom.</span></p><h2>bot's all folks</h2><p><span style=\"font-weight: 400;\">The bot was initially a two week exploratory project to see what could be accomplished, but as we made good progress we were given extra time to complete the bot and implement additional features people had requested. </span></p><p><span style=\"font-weight: 400;\">Given the experimental and fast paced nature of the project, our choice of LUIS as a language parser was driven by its easy integration with the Botbuilder SDK. Given more time it would’ve been interesting to look more closely at the other parsers available such as Wit or API.ai. If you’re interested, our UX team has been looking at language parsers and </span><a href=\"http://blog.scottlogic.com/godds/\"><span style=\"font-weight: 400;\">Graham Odds</span></a><span style=\"font-weight: 400;\"> has written a couple of blog posts on their possible applications.</span></p><p><span style=\"font-weight: 400;\">We had a lot of fun developing our bot and, more importantly, we gained a great deal of knowledge about bot development and language parsing. We also experienced what it was like to work with constantly changing requirements to a tight deadline. The Scott Logic Euro 2016 table football final took place at our Friday Bar last week with an end result of 6-3 to England. Congratulations to Ali Sheehan-Dare who is now the official Scott Logic <span>Euro 2016 table football tournament</span> champion of 2016!</span></p>"},
{"publishDate": "2016-03-10 16:38", "category": "Careers", "author": "jwilson", "title": "Why the #pushforparity is a slow burn", "slug": "why-the-pushforparity-is-a-slow-burn", "summary": "Business must attract broader people into software and ensure the gender-based conditioning that has resulted in a male industry is confined to history.", "content": "<p><span style=\"font-weight: 400;\">I was fortunate enough last week to attend the International Women’s Day </span><a href=\"http://www.communityfoundation.org.uk/11032-womens-fund-raises-over-18000-at-international-womens-day-lunch\"><span style=\"font-weight: 400;\">Networking Lunch</span></a><span style=\"font-weight: 400;\"> in aid of the </span><a href=\"http://www.communityfoundation.org.uk/funds/womensfund\"><span style=\"font-weight: 400;\">Women’s Fund</span></a><span style=\"font-weight: 400;\"> at the </span><a href=\"http://www.communityfoundation.org.uk/\"><span style=\"font-weight: 400;\">Community Foundation</span></a><span style=\"font-weight: 400;\">. It was the second time I’ve attended this annual fundraising event, which is part of the many national and international activities organised to mark </span><a href=\"http://www.internationalwomensday.com/\"><span style=\"font-weight: 400;\">International Women’s Day</span></a><span style=\"font-weight: 400;\"> (IWD).</span></p><p><span style=\"font-weight: 400;\">When I last attended this event in 2013, I’ll admit I had never really come across it or the surrounding International Women’s Day campaign. Fast forward to now and what strikes me most is how much momentum has been gained for the cause in a relatively short space of time. This week, every news channel ran a feature or opinion piece focused on one or several inspirational women, or highlighting the huge discrepancies that exist in the rights women enjoy across the globe; even Facebook had an IWD banner I was encouraged to share to raise awareness.</span></p><p><span style=\"font-weight: 400;\">Inevitably, the day’s increased profile has also given rise to growing debate as to its value, and concerns heralded by critics range from it being ‘unnecessary’ to the risk of encouraging positive discrimination and the potential damage that may cause. The same debate rages on in the world of STEM (science, technology, engineering and maths), where women make up less than </span><a href=\"http://www.theguardian.com/news/datablog/2015/jun/13/how-well-are-women-represented-in-uk-science\"><span style=\"font-weight: 400;\">13 per cent</span></a><span style=\"font-weight: 400;\"> of the workforce. And in software the statistics show the female workforce is only </span><a href=\"http://fusion.net/story/115998/survey-says-92-percent-of-software-developers-are-men/\"><span style=\"font-weight: 400;\">eight per cent</span></a><span style=\"font-weight: 400;\">.</span></p><h2>Don’t play the blame game</h2><p><span style=\"font-weight: 400;\">However, it’s simply too easy to lay the blame at the door of the software industry, accusing it of discrimination, whether conscious or unconscious. It’s also wrong to perpetuate the myth that women are generally less talented, capable or interested in the field, even if that’s what they themselves believe. Worryingly, recent research revealed 60 per cent of girls are put off studying STEM subjects as they perceive them as </span><a href=\"http://www.recruitmentgrapevine.com/article/2016-03-03-empiric-wants-5000-women-to-be-interested-in-tech?utm_source=eshot&amp;utm_medium=email&amp;utm_campaign=RG-03/03/16n\"><span style=\"font-weight: 400;\">too difficult</span></a><span style=\"font-weight: 400;\">. But it was refreshing to see the tech sector being </span><a href=\"http://www.prweek.com/article/1386598/brands-gender-inequality-international-womens-day?bulletin=uk%2Fprweekdaily&amp;utm_medium=EMAIL&amp;utm_campaign=eNews%20Bulletin&amp;utm_source=20160309&amp;utm_content=www_prweek_com_article_1386598\"><span style=\"font-weight: 400;\">particularly active</span></a><span style=\"font-weight: 400;\"> on social media this IWD.</span></p><p><span style=\"font-weight: 400;\">It's reassuring and perhaps a little perplexing that prejudice isn’t what the growing number of women in our technical roles at Scott Logic tell us they’ve experienced in their software careers so far. Rather, the lack of a gender balance exists due to the assumptions and cultural pigeon-holing that continue to take place in wider society.</span></p><p><span style=\"font-weight: 400;\">The sad truth is that we are all placed into our own identifying little boxes on the basis of crude categorisations including gender and sexuality, even in some cases before we’re born. Think about whenever you have filled a form in. We are all easily shoehorned into these simple patterns of ticked or unticked boxes, and these permeate every aspect of our culture, from what we wear to the subjects we study and the jobs we do. Doors are closed for us before we’re even aware of them. The sitcom The IT Crowd is testament to some of these stereotypes. Even the ads we see online are rigidly targeted according to age.</span></p><h2>We’re all waking up</h2><p><span style=\"font-weight: 400;\">While it’s clear that there is still some way to go before society truly accepts and implements diversity, we are all becoming more conscious of bias. Slowly but surely, parents, schools and the media are waking up to the language they use, advice they give and opinions they have that can have such a huge influence on children, not least girls when choosing their future career path. Gradually, this will ensure the same opportunities to enter STEM fields are open to all, and that encouragement into those opportunities is equally shared regardless of gender.</span></p><p><span style=\"font-weight: 400;\">Businesses must also play their part to attract a broader range of people into considering one of the many varied roles software can offer. And this doesn’t just mean at the point of sale. Employers must work with schools, colleges and other relevant bodies to ensure this ‘attraction’ work begins from an early age, and that the gender-based conditioning that has resulted in such a male dominated industry is confined to the history books.</span></p><p><span style=\"font-weight: 400;\">At Scott Logic, we are passionate about this, hence our ongoing involvement with the Lovelace Colloquium, a one-day conference for undergraduates organised by </span><a href=\"http://bcswomen.bcs.org/\"><span style=\"font-weight: 400;\">BCSWomen</span></a><span style=\"font-weight: 400;\">, a branch of the British Computer Society, the Chartered Institute for IT, which we’ll be attending on </span><a href=\"http://bcswomen.bcs.org/?chronosly=bcswomen-lovelace-colloquium\"><span style=\"font-weight: 400;\">March 31st</span></a><span style=\"font-weight: 400;\">. The event honours Ada Lovelace, who is commonly regarded as the first computer programmer, and we’ll be there in an effort to attract some talented engineers and doing our bit to #pushforparity. </span></p><p><span style=\"font-weight: 400;\">We hope to see you there!</span></p>"},
{"publishDate": "2016-03-16 16:32", "category": "Careers", "author": "nhemley", "title": "Bristech: story of a meetup", "slug": "bristech-story-of-a-meet-up", "summary": "Nic Hemley, Head of Development for Scott Logic in Bristol, co-founded the Bristech meetup in July 2013, inspired by an existing group in Edinburgh. In this series of blog posts, Nic will be telling the story of this meetup: its genesis, challenges and possible future direction.", "content": "<p><i><span style=\"font-weight: 400;\">Nic Hemley, Head of Development for Scott Logic in Bristol, co-founded the Bristech meetup in July 2013, inspired by an existing group in Edinburgh. In this series of blog posts, Nic will be telling the story of this meetup: its genesis, challenges and possible future direction.</span></i></p><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/bristec.jpg?t=1511177678270&amp;width=634&amp;height=356&amp;name=bristec.jpg\" alt=\"bristec.jpg\" title=\"bristec.jpg\" width=\"634\" height=\"356\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/bristec.jpg?t=1511177678270&amp;width=317&amp;height=178&amp;name=bristec.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/bristec.jpg?t=1511177678270&amp;width=634&amp;height=356&amp;name=bristec.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/bristec.jpg?t=1511177678270&amp;width=951&amp;height=534&amp;name=bristec.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/bristec.jpg?t=1511177678270&amp;width=1268&amp;height=712&amp;name=bristec.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/bristec.jpg?t=1511177678270&amp;width=1585&amp;height=890&amp;name=bristec.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/bristec.jpg?t=1511177678270&amp;width=1902&amp;height=1068&amp;name=bristec.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"><br><p> <!--more--></p><h2>HOW BRISTECh BEGAN</h2><p><span style=\"font-weight: 400;\">Bristech began life inconspicuously; a few folk in a basement sharing knowledge on technical topics. The speakers clearly had something interesting and of value to other software practitioners as the monthly events slowly grew in attendance from perhaps 10 or 15 attendees, to past 30 and then 50, exceeding all expectations. Slowly but steadily the membership continued to build until it became clear that the existing venue in the old police station basement was no longer suitable (despite the novelty police cell toilets). A new venue was sought, options surveyed and the business incubator the EngineShed, settled upon.</span></p><p>The format remains unchanged since those early days; two speakers with 30-minute talks, followed by 15 minutes of questions from the floor. There’s also always been beer on tap; with pizzas (and sometimes tacos) available after the talks. Nothing out of the ordinary for us, but hugely successful at eking out a meetup niche over time. The static speaker format is perhaps one of the reasons for its success, but the quality and diversity of speakers is likely a large factor. Local software developers have come to know that on the first Thursday of the month at the EngineShed, they will be informed and entertained by local (and passionate) practitioners on a wide variety of software-related topics. This is another key plank of the Bristech success; it is not just focused on software development per se, but encompasses a wider technical landscape, consisting of related topics such as UX, academic research and other local initiatives. This has led to a smorgasbord of topics over the past three years - from flying Nodecopters, Groucho Marx interventions on selfies(!) and swarm robotics, to functional reactive programming, big data analytics and a cyber-dojo.</p><h2>HITTING MILESTONES</h2><p><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Bristech_Logo.png?t=1511177678270&amp;width=320&amp;name=Bristech_Logo.png\" alt=\"Bristech_Logo.png\" title=\"Bristech_Logo.png\" width=\"320\" style=\"width: 320px; margin: 0px 10px 10px 0px; float: left;\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Bristech_Logo.png?t=1511177678270&amp;width=160&amp;name=Bristech_Logo.png 160w, https://smarter.scottlogic.com/hs-fs/hubfs/Bristech_Logo.png?t=1511177678270&amp;width=320&amp;name=Bristech_Logo.png 320w, https://smarter.scottlogic.com/hs-fs/hubfs/Bristech_Logo.png?t=1511177678270&amp;width=480&amp;name=Bristech_Logo.png 480w, https://smarter.scottlogic.com/hs-fs/hubfs/Bristech_Logo.png?t=1511177678270&amp;width=640&amp;name=Bristech_Logo.png 640w, https://smarter.scottlogic.com/hs-fs/hubfs/Bristech_Logo.png?t=1511177678270&amp;width=800&amp;name=Bristech_Logo.png 800w, https://smarter.scottlogic.com/hs-fs/hubfs/Bristech_Logo.png?t=1511177678270&amp;width=960&amp;name=Bristech_Logo.png 960w\" sizes=\"(max-width: 320px) 100vw, 320px\">In December 2015 membership of the group inched past 1,000, confirming it as the largest tech meetup in the South West. It was at this point that I first entertained the idea of taking it to the next level and soon I found myself thinking through the logistics of hosting an annual conference. Once this idea had taken hold, it became an all-consuming challenge that felt ambitious, but also like a natural brand extension. However, others privately advised that without a bona fide event organiser involved, things weren’t likely to go smoothly. Running a conference is quite a step up from running a local meetup group. Luckily, I heeded this sage advice and engaged with a local event project manager who was to prove invaluable in running the event. </span></p><p><span style=\"font-weight: 400;\">Finally, on Thursday 15th October 2015, the doors opened @Bristol for the inaugural Bristech conference. This proved to be a sell out event consisting of 18 speakers across three different streams. With its focus on low cost tickets (early bird tickets went on sale at just £30) and predominantly community-based (quality) speakers, the scene has been set for an annual event that complements the monthly rhythm of the meetups.</span></p><p><span style=\"font-weight: 400;\">In a recent Tech Nation report (2016</span><span style=\"font-weight: 400;\">), it notes that “networks and face to face contact are essential to successful digital tech clusters…almost 180,000 individuals across the country have been involved in digital tech meetups.” In one sense, this rise charts the ongoing democratisation of knowledge; many meetups are used to share knowledge and ideas. However, it is also undeniable that events are inherently social. Just like other local tech meetups, Bristech is a good way for like-minded people to meet in relative informality.</span></p><h2>the benefits</h2><p><span style=\"font-weight: 400;\">Events are not only good for delegates; speakers benefit massively too. Local meetups provide an ideal opportunity for individuals to try out new ideas and further hone talks that may have only been aired within organisational walls. For example, employees at Scott Logic are actively encouraged to develop their ideas, firstly through blog posts, but subsequently through internal talks and presentations that translate well into public meetup sessions. Ambitions do not necessarily end there. Meetups can also lead to regional or national conference appearances. As such, they a great way to learn the craft of public speaking, in front of a friendly home crowd.</span></p><p><span style=\"font-weight: 400;\">Our monthly rhythm of events continues in 2016 with a full pipeline of speakers, and efforts are underway for the forthcoming October conference; a far cry from the damp days in the old police station.</span></p><p><i><span style=\"font-weight: 400;\">For more information on upcoming events, please follow </span></i><a href=\"https://twitter.com/bristechmeetup\"><i><span style=\"font-weight: 400;\">@bristechmeetup</span></i></a><i><span style=\"font-weight: 400;\"> on Twitter or visit the the meetup site at </span></i><a href=\"http://www.meetup.com/bristech/\"><i><span style=\"font-weight: 400;\">www.meetup.com/bristech/</span></i></a><i><span style=\"font-weight: 400;\"> All video content from previous talks are available on the </span></i><a href=\"https://www.youtube.com/user/bristechmeetup\"><i><span style=\"font-weight: 400;\">YouTube channel</span></i></a><i><span style=\"font-weight: 400;\">. For more info on the annual conference, please see</span></i> <a href=\"http://bris.tech\"><i><span style=\"font-weight: 400;\">bris.tech</span></i></a><i><span style=\"font-weight: 400;\">. Scott Logic is a bespoke software development consultancy with an office in Bristol city centre. For more information on what we do, visit </span></i><a href=\"http://www.scottlogic.com\"><i><span style=\"font-weight: 400;\">scottlogic.com</span></i></a></p><p><strong> <a href=\"http://www.techcityuk.com/wp-content/uploads/2016/02/Tech-Nation-2016_FINAL-ONLINE-1.pdf?utm_content=buffer2e58f&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer\"><span style=\"font-weight: 400;\">http://www.techcityuk.com/wp-content/uploads/2016/02/Tech-Nation-2016_FINAL-ONLINE-1.pdf</span></a><span style=\"font-weight: 400;\"> (pp. 27)</span></strong></p><p> </p><p> </p><p><strong><strong> </strong></strong></p>"},
{"publishDate": "2016-03-08 16:48", "category": "Careers", "author": "dmcnamee", "title": "Tackling the myths around a software testing career", "slug": "tacklingthemythsaroundasoftwaretestingcareer", "summary": "Lead Test Engineer Daniel tackles the myths around a software testing career.", "content": "<p>Testing as a career isn't new. People have been testing for as long as software has existed. But many still don't see testing as a valuable career choice, or a career choice at all. This is partly due to a lack of education when it comes to testing, myths about the role of a tester and the way the software industry has approached testing in the past.</p><p><strong><strong> </strong></strong>These have given rise to some common misconceptions:</p><h2>“I'VE HEARD SOFTWARE TESTING IS BORING”</h2><p>You heard wrong! Testing is misunderstood by many people and many organisations and neither test software in the right way. In software development, testing is quite honestly one of the most exciting and rewarding roles, providing you are in the right place; somewhere that will allow you to express yourself, be free to think creatively and utilise your testing superpowers.</p><p><span style=\"font-weight: 400;\">Testing is varied. You can dig deep into different mindsets, use psychological techniques to </span><a href=\"http://blog.scottlogic.com/2015/03/03/blink.html\"><span style=\"font-weight: 400;\">hunt bugs</span></a><span style=\"font-weight: 400;\">, organise others to </span><a href=\"http://blog.scottlogic.com/2015/10/20/Fun-effective-bug-hunts.html\"><span style=\"font-weight: 400;\">hunt bugs for you</span></a><span style=\"font-weight: 400;\">, get creative with both </span><a href=\"http://blog.scottlogic.com/2015/10/19/automating-bacon.html\"><span style=\"font-weight: 400;\">technology and code</span> </a><span style=\"font-weight: 400;\">and </span><a href=\"http://blog.scottlogic.com/2016/02/08/data-mocking.html\"><span style=\"font-weight: 400;\">solve difficult problems</span></a><span style=\"font-weight: 400;\">.</span></p><p><span style=\"font-weight: 400;\">This idea of testing being boring may originate from testing practices such as laboriously creating test scripts, repetition in execution, testing for regression and high documentation environments. Much of the time, these tasks were really only checking (</span><a href=\"http://www.satisfice.com/articles/cdt-automation.pdf\"><span style=\"font-weight: 400;\">see checking vs testing</span></a><span style=\"font-weight: 400;\">) and here’s where we can use tools. We can use our development skills as testers to write creative code, utilise tools, develop testing software so that we don’t have to do a lot of these ‘boring’ tasks manually.</span></p><h2>“IT'S FOR PEOPLE WHO AREN'T GOOD ENOUGH TO BE DEVELOPERS”</h2><p>This certainly isn’t the case. A lot of the time there may not be crossover between these two disciplines, and quite often, a different mindset separates great testers from great developers, but many developers started their careers as testers and many testers have been developers. This idea is apocryphal; it has perhaps come from places where testers and developers were adversarial, developers frustrated with low quality testing and testers frustrated with low quality code.</p><p><span style=\"font-weight: 400;\">Both roles are creative. Both can be technically challenging. Both aim to solve problems. An appreciation of one gives rise to a greater understanding of the other. At Scott Logic, respect goes in both directions. We aim to hire only the best.</span></p><h2>“TESTERS AREN'T RESPECTED”</h2><p>Any team or company that doesn't respect the role testers perform likely won't be producing software of the highest quality. Ask any of our developers and they will give an honest appraisal of respect for the role that testers perform. As much as any developer would like to think their code is perfect, it isn't and we make our developers look even better by finding where their code is broken so they can fix it before it’s released.</p><h2>TESTER SKILLS</h2><p>A tester needs a rounded view of the world, a keen eye for detail and an investigative nature with some technical skills thrown in. You may have an artistic background but be great at maths or technical skills, or a scientific background with a methodical way of working, or a law degree with a passion for technology. There is no one mould that makes a good tester.</p><p>At Scott Logic, we look for passionate problem solvers with a keen interest in technology, that have a love of learning, sharing their knowledge and producing high quality work.</p><h2>CAREER PATH AT SCOTT LOGIC</h2><p>We have a clearly defined career path that aims to nurture, support and help your career grow in the way that you choose; from graduate to principal consultant we can provide you with the tools and knowledge to apply your skills, learn new ones and enjoy the freedom to continually think outside the box to solve problems.</p><p>In the next post in this series, we'll explore some of the types of project our testers get to work on and the kind of work you can expect to be doing as a tester at Scott Logic. Stay tuned.</p>"},
{"publishDate": "2016-05-05 13:35", "category": "Careers", "author": "dmcnamee", "title": "Software Testing at Scott Logic: An Insight into how we work", "slug": "software-testing-at-scott-logic-an-insight-into-how-we-work", "summary": "An insight into how software testers at Scott Logic work.", "content": "<p><span style=\"font-weight: 400;\">In the last post, I talked about and hopefully dispelled some of the </span><a href=\"//smarter.scottlogic.com/careers/tacklingthemythsaroundasoftwaretestingcareer\"><span style=\"font-weight: 400;\">myths about a career in testing</span></a><span style=\"font-weight: 400;\">. Here, I’ll go into a bit more depth about current and past projects I've worked on, hopefully giving some insight into how testers work at Scott Logic.</span></p><p><span style=\"font-weight: 400;\">Since starting my current role in 2013, I’ve been involved in a few projects. In the first, I joined mid way through the application's development, but even joining late, I was able to shape future ways of working and promote a better way of testing. I also learnt a lot, using technologies in depth that I had only briefly used before. I've been able to take that knowledge and experience to the project I'm currently working on, where I became involved much earlier.</span></p><h2>So what about some of those myths?</h2><p><span style=\"font-weight: 400;\">What do testers do, if it's not writing and executing scripts?</span></p><p><span style=\"font-weight: 400;\">At Scott Logic, our testers are part of the development team and this is the case for my current project. I'm sat in the beating heart of the project team. We work with clients worldwide, although remotely from our UK-based offices. This makes communication a very important part of day to day work, from a morning scrum call, to conversing throughout the day with local or remote developers and business owners.</span></p><p><span style=\"font-weight: 400;\">My current project works to a loose Scrum method with the aim of producing working software, rather than documentation, so I test within each sprint; as the development of features and fixes is finished, you are able to test them. By test, I mean \"...the process of evaluating a product by learning about it through exploration and experimentation, which includes to some degree: questioning, study, modeling, observation, inference, etc.\"</span></p><p><span style=\"font-weight: 400;\">Each test informs me of the current state of the software being developed and I’m able to use that information to generate new ideas and tests. I use various heuristics to uncover possible problems and I report on those problems either by creating bugs or talking to the right person, which goes to the heart of one of the values of the </span><a href=\"http://agilemanifesto.org/\"><span style=\"font-weight: 400;\">agile manifesto</span></a><span style=\"font-weight: 400;\">: </span></p><p><em><span style=\"font-weight: 400;\">“individuals and interactions over process and tools”</span></em></p><p><span style=\"font-weight: 400;\">Of course, we do use process and tools. It's not a chaotic jumble of random stuff. We have a flow of developed features and bugs tracked in a JIRA board. </span></p><p><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/jira-board.jpg?t=1511177678270&amp;width=1800&amp;name=jira-board.jpg\" alt=\"jira-board.jpg\" title=\"jira-board.jpg\" width=\"1800\" style=\"width: 1800px;\" data-constrained=\"true\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/jira-board.jpg?t=1511177678270&amp;width=900&amp;name=jira-board.jpg 900w, https://smarter.scottlogic.com/hs-fs/hubfs/jira-board.jpg?t=1511177678270&amp;width=1800&amp;name=jira-board.jpg 1800w, https://smarter.scottlogic.com/hs-fs/hubfs/jira-board.jpg?t=1511177678270&amp;width=2700&amp;name=jira-board.jpg 2700w, https://smarter.scottlogic.com/hs-fs/hubfs/jira-board.jpg?t=1511177678270&amp;width=3600&amp;name=jira-board.jpg 3600w, https://smarter.scottlogic.com/hs-fs/hubfs/jira-board.jpg?t=1511177678270&amp;width=4500&amp;name=jira-board.jpg 4500w, https://smarter.scottlogic.com/hs-fs/hubfs/jira-board.jpg?t=1511177678270&amp;width=5400&amp;name=jira-board.jpg 5400w\" sizes=\"(max-width: 1800px) 100vw, 1800px\"></span></p><p><span style=\"font-weight: 400;\">This gives a view of the current sprint and this enables me, as a tester, to plan and move quickly. We use a branching strategy that enables me to test new features and fixes in isolation or altogether in a test branch. This test branch will contain all the changes that have been merged into development but is only built when I'm ready to continue testing. This way, I get a stable environment to test against, rather than developers pushing changes to the development branch and impacting the environment without my immediate knowledge.</span></p><h2>Where do I start?</h2><p><span style=\"font-weight: 400;\">Generally, I'll look at bug fixes first. They can often be quicker to validate and in most cases, don't have as great an impact as new features, so less problems are likely to be found. Of course, that isn't always the case, particularly if a bug fix fundamentally changes the behaviour of some functionality, or the code change is complex and wide ranging. In this case, a quick chat with the developer may be needed. However, working within the sprint, sitting in the project team, I’ve been able to get developers to note on the bug what impact this change is likely to have as a good approach for them to take, to make my, and their work easier. </span></p><h2>Delving a little deeper</h2><p><strong><span style=\"font-weight: 400;\">For new features, a more comprehensive look is needed. I often start with the acceptance criteria on the feature. Then, depending on what the new feature is, start exploring with some </span><a href=\"https://en.wikipedia.org/wiki/Heuristic\"><span style=\"font-weight: 400;\">heuristics</span></a><span style=\"font-weight: 400;\">: </span><a href=\"http://www.satisfice.com/articles/sfdpo.shtml\"><span style=\"font-weight: 400;\">SFDPOT</span></a><span style=\"font-weight: 400;\">, </span><a href=\"http://blog.scottlogic.com/2015/03/03/blink.html\"><span style=\"font-weight: 400;\">blink test</span></a><span style=\"font-weight: 400;\">, </span><a href=\"http://www.satisfice.com/blog/archives/467\"><span style=\"font-weight: 400;\">steeplechase, galumphing, creep and leap</span></a><span style=\"font-weight: 400;\">, </span><a href=\"http://www.developsense.com/blog/2009/04/of-testing-tours-and-dashboards/\"><span style=\"font-weight: 400;\">tours</span></a><span style=\"font-weight: 400;\"> or </span><a href=\"http://blog.scottlogic.com/2016/03/09/lonely-tester.html\"><span style=\"font-weight: 400;\">pair testing</span></a><span style=\"font-weight: 400;\">. I use my experience and knowledge of the application, and my lack of knowledge(!) in some cases, to spot patterns and check things I know have failed previously with similar features. For this, I keep a JIRA query of 'high risk failures'; bugs and features that I may want to keep re-checking regularly. I also use JIRA to mark features and bugs that I want to write automated checks for.</span></strong></p><p><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/ticket.jpg?t=1511177678270&amp;width=1800&amp;name=ticket.jpg\" alt=\"ticket.jpg\" title=\"ticket.jpg\" width=\"1800\" data-constrained=\"true\" style=\"width: 1800px;\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/ticket.jpg?t=1511177678270&amp;width=900&amp;name=ticket.jpg 900w, https://smarter.scottlogic.com/hs-fs/hubfs/ticket.jpg?t=1511177678270&amp;width=1800&amp;name=ticket.jpg 1800w, https://smarter.scottlogic.com/hs-fs/hubfs/ticket.jpg?t=1511177678270&amp;width=2700&amp;name=ticket.jpg 2700w, https://smarter.scottlogic.com/hs-fs/hubfs/ticket.jpg?t=1511177678270&amp;width=3600&amp;name=ticket.jpg 3600w, https://smarter.scottlogic.com/hs-fs/hubfs/ticket.jpg?t=1511177678270&amp;width=4500&amp;name=ticket.jpg 4500w, https://smarter.scottlogic.com/hs-fs/hubfs/ticket.jpg?t=1511177678270&amp;width=5400&amp;name=ticket.jpg 5400w\" sizes=\"(max-width: 1800px) 100vw, 1800px\"></p><p><span style=\"font-weight: 400;\">As we are using the Angular framework, this end-to-end automation is done using Protractor. And here is where I write scripts using JavaScript and the Jasmine notation, or more accurately, specs. Since starting on the project, this is something I work on intermittently but progressively, from setting up the small checks that ran initially, to the fully laid out framework of config files, page objects, helpers, data and specs that we have now.</span></p><p>Since my first project, we have hired more great testers and we work with the same ethos:</p><p><em>\"Creatively and with context\".</em></p><p>The work certainly isn't boring; it can be technically challenging and as for respect, well, ask any of our developers or clients that we’ve provided testers for.</p><p><strong><span style=\"font-weight: 400;\"> </span></strong></p>"},
{"publishDate": "2016-01-12 14:12", "category": "Careers", "author": "rnewsome", "title": "A glimpse into our 2015 graduate projects", "slug": "a-glimpse-into-our-2015-graduate-projects", "summary": "A glimpse into working life for new software developers and testers in the first few weeks of Scott Logic's graduate programme.", "content": "<h2>Introduction</h2><p><span style=\"font-weight: 400;\">After a rather hectic first few weeks of induction, socials and technical training, our graduates are then handed the reins to run their own team projects. This is an important next step in the Scott Logic graduate programme, and consists of a six-week design and build project, with small teams working in a more real-life, professional environment.</span></p><p><span style=\"font-weight: 400;\">In our Newcastle office we gave our new starters a loose brief to build a game: </span><i><span style=\"font-weight: 400;\">“Your game must be online, multiplayer, and incorporate WebSocket communication”</span></i><span style=\"font-weight: 400;\">.</span></p><p><span style=\"font-weight: 400;\">Experienced developers were assigned to mentor each team, and introduce them to the standard working practices of planning, daily stand ups and automated build and testing, but the creative and technical direction was entirely up to the teams themselves.</span></p><p><span style=\"font-weight: 400;\">At the end of six weeks, the teams wrote up and presented their games, the whole office tested them out. Here’s a taster of this year’s awesome entries:</span></p><h2>Elixir Inc.</h2><p><span style=\"font-weight: 400;\">Elixir Inc. is a cooperative, online multi-player game in which players must work together to defeat a virus which is threatening all mankind. Players can form their own strategy to win the game by training special units, such as doctors, scientists and soldiers. Each with its own benefits and drawbacks, the moral quandary surrounding the preservation of lives and containment of the outbreak make every turn vital to winning.</span></p><p><span style=\"font-weight: 400;\">User authentication was securely managed using Google OAuth, while MongoDB maintains an up to date database of all saved games and score tables. Mongoose and Node.js were used in the back end of the application. To make the game less computationally intensive for the end user, Knockout was used. Communication between users and the back end was managed using socket.io.</span></p><p><span style=\"font-weight: 400;\">Team member Jack said: “Everyone who works with software enjoys exploring their creative side. It was great to have the chance to make that fantasy a reality by building a game.”</span></p><p><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Elixir_Inc.jpg?t=1511177678270&amp;width=634&amp;height=357&amp;name=Elixir_Inc.jpg\" alt=\"Elixir_Inc.jpg\" title=\"Elixir_Inc.jpg\" width=\"634\" height=\"357\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Elixir_Inc.jpg?t=1511177678270&amp;width=317&amp;height=179&amp;name=Elixir_Inc.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/Elixir_Inc.jpg?t=1511177678270&amp;width=634&amp;height=357&amp;name=Elixir_Inc.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/Elixir_Inc.jpg?t=1511177678270&amp;width=951&amp;height=536&amp;name=Elixir_Inc.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/Elixir_Inc.jpg?t=1511177678270&amp;width=1268&amp;height=714&amp;name=Elixir_Inc.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/Elixir_Inc.jpg?t=1511177678270&amp;width=1585&amp;height=893&amp;name=Elixir_Inc.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/Elixir_Inc.jpg?t=1511177678270&amp;width=1902&amp;height=1071&amp;name=Elixir_Inc.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></span></p><p><span style=\"font-weight: 400;\"><a href=\"http://www.scottlogic.com/graduate-projects/elixir-inc/\">Click here</a> for the full story</span></p><h2>Bakery Defenders</h2><p><span style=\"font-weight: 400;\">Bakery Defenders is a cooperative, multi-player tower defence game developed entirely in JavaScript. The aim is to keep the bakery safe from oncoming waves of hungry locals and other obstacles that appear periodically.</span></p><p><span style=\"font-weight: 400;\">Players have to work together to build and upgrade towers made of pastries and cakes, that fire food-related projectiles to repel these periodic obstacles. The game was built using the Phaser.io game engine, with a Knockout.js front end and a Node.js back end.</span></p><p><span style=\"font-weight: 400;\">Team member Jamie said: “Building the full stack from scratch meant we had to understand each other's’ strengths and preferences in terms of development, and delegate tasks accordingly.”</span></p><p><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Bakery_Defenders.jpg?t=1511177678270&amp;width=634&amp;height=392&amp;name=Bakery_Defenders.jpg\" alt=\"Bakery_Defenders.jpg\" title=\"Bakery_Defenders.jpg\" width=\"634\" height=\"392\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Bakery_Defenders.jpg?t=1511177678270&amp;width=317&amp;height=196&amp;name=Bakery_Defenders.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/Bakery_Defenders.jpg?t=1511177678270&amp;width=634&amp;height=392&amp;name=Bakery_Defenders.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/Bakery_Defenders.jpg?t=1511177678270&amp;width=951&amp;height=588&amp;name=Bakery_Defenders.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/Bakery_Defenders.jpg?t=1511177678270&amp;width=1268&amp;height=784&amp;name=Bakery_Defenders.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/Bakery_Defenders.jpg?t=1511177678270&amp;width=1585&amp;height=980&amp;name=Bakery_Defenders.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/Bakery_Defenders.jpg?t=1511177678270&amp;width=1902&amp;height=1176&amp;name=Bakery_Defenders.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></span></p><p><span style=\"font-weight: 400;\"><a href=\"http://www.scottlogic.com/graduate-projects/bakery-defender/\">Click here</a> for the full story</span></p><h2>Grid Wars</h2><p><span style=\"font-weight: 400;\">Grid Wars is an online, multi-player, Real-time strategy (RTS) game. A single game hosts between two and four players, each battling to be the last base standing. To achieve this, participants need to spend their resources on either ‘turrets’ to defend their own base or ‘tanks’ to attack other bases. Resources are distributed through the destruction of other players’ units and ultimately by gaining their resources, helping a player dominate the game.  </span></p><p><span style=\"font-weight: 400;\">Team member Matt said: “As a team of three we created Grid Wars from the ground up, giving us a full-stack experience of various technologies including Java (RESTEasy, Netty &amp; MySQL) for the back end and JavaScript (Angular.js,</span><a href=\"http://phaser.io/\"> <span style=\"font-weight: 400;\">Phaser.io</span></a><span style=\"font-weight: 400;\"> &amp;</span><a href=\"http://socket.io/\"> <span style=\"font-weight: 400;\">Socket.io</span></a><span style=\"font-weight: 400;\">) for the front end, some of which we hadn’t used before.</span></p><p><span style=\"font-weight: 400;\">“The overall feeling from the group was that it was a fun and ambitious project to be involved in, that helped us learn in terms of both development and testing.”</span></p><p><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Grid_Wars-1.jpg?t=1511177678270&amp;width=634&amp;height=351&amp;name=Grid_Wars-1.jpg\" alt=\"Grid_Wars-1.jpg\" title=\"Grid_Wars-1.jpg\" width=\"634\" height=\"351\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Grid_Wars-1.jpg?t=1511177678270&amp;width=317&amp;height=176&amp;name=Grid_Wars-1.jpg 317w, https://smarter.scottlogic.com/hs-fs/hubfs/Grid_Wars-1.jpg?t=1511177678270&amp;width=634&amp;height=351&amp;name=Grid_Wars-1.jpg 634w, https://smarter.scottlogic.com/hs-fs/hubfs/Grid_Wars-1.jpg?t=1511177678270&amp;width=951&amp;height=527&amp;name=Grid_Wars-1.jpg 951w, https://smarter.scottlogic.com/hs-fs/hubfs/Grid_Wars-1.jpg?t=1511177678270&amp;width=1268&amp;height=702&amp;name=Grid_Wars-1.jpg 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/Grid_Wars-1.jpg?t=1511177678270&amp;width=1585&amp;height=878&amp;name=Grid_Wars-1.jpg 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/Grid_Wars-1.jpg?t=1511177678270&amp;width=1902&amp;height=1053&amp;name=Grid_Wars-1.jpg 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></span></p><p><span style=\"font-weight: 400;\"><a href=\"http://www.scottlogic.com/graduate-projects/grid-wars/\">Click here</a> for the full story</span></p><p><span style=\"font-weight: 400;\">These projects are crucial to the development of our graduates, and also that of our business. Robin, one of our Lead Developers, explained: “</span><span style=\"font-weight: 400;\">As a rapidly expanding IT consultancy, recruiting the best new talent in the sector is key.</span></p><p><span style=\"font-weight: 400;\">“We invest in putting our graduate intake through a structured induction programme each year, including projects such as these, as well as further training in current technologies and internal development work.</span></p><p><span style=\"font-weight: 400;\">“This closely supervised work allows us to accurately assess their potential on an individual basis, and leads eventually to them becoming involved in client projects when we're fully confident in their professional skills.”</span></p><p><span style=\"font-weight: 400;\">If you’d like the chance to explore your creative side with the support and encouragement of our experienced developers, testers and designers, why not consider applying to our <a href=\"http://www.scottlogic.com/careers/graduateprogramme/\">2016 graduate programme</a>?</span></p><p><strong><br><span style=\"font-weight: 400;\">To find out more about previous <a href=\"http://www.scottlogic.com/graduate-projects/\">graduate projects</a> or our graduate programme, check out our</span><a href=\"http://www.scottlogic.com/careers/graduateprogramme/\"> <span style=\"font-weight: 400;\">careers website</span></a><span style=\"font-weight: 400;\">, and</span><a href=\"/cdn-cgi/l/email-protection#8decfdfde1e4eeecf9e4e2e3fecdfeeee2f9f9e1e2eae4eea3eee2e0\"> <span style=\"font-weight: 400;\">get in touch</span></a><span style=\"font-weight: 400;\"> if you’d like to hear further detail.</span></strong></p>"},
{"publishDate": "2015-12-01 10:25", "category": "Careers", "author": "jwright", "title": "I don’t have a Computer Science degree - can I still work in software development?", "slug": "i-dont-have-a-computer-science-degree-can-i-still-work-in-software-development", "summary": "There’s a common misconception that there’s only one route into software engineering being one of them, but the truth is, the name of your degree is secondary to skills such as logical thinking, coding or testing ability, and arguably most importantly – passion. Here, two of our employees explain more.", "content": "<p><span style=\"font-weight: 400;\">There’s a common misconception that there’s only one route into certain jobs – software engineering being one of them. We’ve found it’s a real concern among non-computer science undergraduates who approach us at graduate careers fairs. The truth is, the name of your degree is secondary to skills such as logical thinking, coding or testing ability, and arguably most importantly </span><span style=\"font-weight: 400;\">–</span><span style=\"font-weight: 400;\"> passion. Here, two of our employees without computer science degrees explain more:</span></p><h2>I STUDIED ELECTRONIC ENGINEERING</h2><p><strong>Rob, who studied Electronic Engineering and joined us as a graduate developer in 2015, said: </strong><span style=\"font-weight: 400;\">“When it boils down to it, all STEM degrees are based around different forms of problem solving; whether that’s testing an electronic system for stability, or writing an application to track the transfer of bitcoins, everything can be broken down into small problems.</span></p><p><span style=\"font-weight: 400;\">“Coding was never something I thought I’d be doing when I started my degree. However, it quickly became my favourite lecture every week, up to the point where I chose a C-based final year project and spent a placement year doing coding.  I also have some experience with C++ (purely as a procedural language) and assembly, but my primary language is C, and none of my experience comes in the form of object-oriented languages.</span></p><p><span style=\"font-weight: 400;\">“At uni, the assignments just clicked for me, and while a lot of others in my degree didn’t particularly enjoy the coding lectures, it turned out to be exactly what I loved about engineering - being given a problem and using my knowledge to solve it. At the end of the day, it doesn’t really matter what degree you have behind you; if you enjoy coding and have a passion for solving puzzles, Scott Logic is the perfect place for you!”</span></p><p>Rob has now been at Scott Logic for four months, and feels he has learnt a great deal in a short space of time. He added: <span style=\"font-weight: 400;\">“My first project revolved around Java and JavaScript, which I had very little knowledge or experience of so I was thrown in at the deep end a bit, but who doesn’t love a challenge? While initially I felt a little out of my depth, I started to get my head around the project and by week two I was writing web applications without too much difficulty.</span></p><p><span style=\"font-weight: 400;\">\"By week four I was ready to work with two other graduates to make a browser-based game! It’s a steep learning curve, but if you’re willing to learn and like a challenge, it’s more than possible, and really enjoyable too.”</span></p><h2>WHAT ABOUT CIVIL ENGINEERING?</h2><p><strong>Luke recently joined us as a senior developer after a PhD in Civil Engineering, and said: </strong><span style=\"font-weight: 400;\">“There wasn’t much programming involved in my undergraduate engineering degree at all, other than some number crunching with MATLAB, but my PhD was a different story.</span></p><p><span style=\"font-weight: 400;\">“I realised very early on in my project that flood simulation was going to be as much about how to leverage computing power as it was solving equations. Programming graphics cards and learning the nuts and bolts of processor architectures quickly became my favourite part of the PhD, so it seemed logical to pursue a software career afterwards.</span></p><p><span style=\"font-weight: 400;\">“Many other aspects of my degrees proved useful though, such as project management, communication skills, and designing algorithms. A PhD especially provides good training for taking a complicated problem and breaking it down into smaller tasks. Despite all this, it’s not really the intricacies of how we work that excite me, it’s the end result that I care most about; I think many engineers from all disciplines feel that way, and that’s why it’s not essential to have a degree in computer science to be a good software engineer. And testament to that fact, I was surprised to find I wasn’t the first civil engineer to find my way on to the Scott Logic team.”</span></p><hr><p><span style=\"font-weight: 400;\">If you’re keen to see if a career in software might be for you, our paid summer </span><a href=\"http://www.scottlogic.com/careers/internship/\"><span style=\"font-weight: 400;\">internship</span></a><span style=\"font-weight: 400;\"> is currently open to applicants, and we also have a number of vacancies on our 2016 </span><a href=\"http://www.scottlogic.com/careers/graduateprogramme/\"><span style=\"font-weight: 400;\">graduate programme</span></a><span style=\"font-weight: 400;\">.</span></p>"},
{"publishDate": "2015-08-14 11:14", "category": "Careers", "author": "jwright", "title": "Day by day - week one as a Scott Logic graduate", "slug": "day-by-day-week-one-as-a-scott-logic-graduate", "summary": "A record 19 new recruits joined our 2015 graduate programme which began with an intense and enjoyable week involving technology, tiaras and table football.", "content": "<p dir=\"ltr\"><span>A record 19 new recruits joined our 2015 graduate programme which began with an intense and enjoyable week involving technology, tiaras and table football. Read on to find out more.<!--more--></span></p><h1 dir=\"ltr\"><img src=\"https://smarter.scottlogic.com/hubfs/_MG_1676_Copy_-_resized.jpg?t=1511177678270\" alt=\"_MG_1676_Copy_-_resized\"></h1><h1 dir=\"ltr\">Monday</h1><p dir=\"ltr\"><span>Grad Week started with an introduction to a raft of software development tools such as Maven, Grunt, Eclipse, Git, Node, Tomcat, Knockout and Less, before moving onto databases, namely MySQL. The week’s goal was revealed as the creation of a table football ladder, put together using all the tools and techniques that the week would feature.</span></p><p dir=\"ltr\"><span>The grads were paired up to decide how they’d structure the database, created it and practiced manipulating it. Sam, the experienced developer who put together the graduate programme said: </span></p><p dir=\"ltr\"><span>“Whilst relational database aren’t the most modern of storage technologies, we still find most of our clients are using them and it’s always a good place to start. Most of the grads have seen SQL before, but few have had the chance to use it in a real world setting and a little context goes a long way.”</span></p><p dir=\"ltr\"><span>A bit of teamwork was needed to break the ice as the annual ‘Greggs Challenge’ was tackled at lunchtime, resulting in an efficient tour of the city and the swift demolition of a mountain of sausage rolls, cookies and doughnuts. Once we’d come down from our sugar high, we spent the evening toasting a great start to our grads’ new careers at one of Newcastle’s popular watering holes, where they got to know us and the city a little better.</span></p><p dir=\"ltr\"><span>Newcastle’s Head of Development Rob said: “I’ve seen many of our graduates go on to achieve great things, often moving to senior positions within our project teams. I look forward to seeing what this year’s graduates achieve with us as they grow in confidence and experience.”</span></p><h1 dir=\"ltr\"><span>Tuesday</span></h1><p dir=\"ltr\"><span>The morning was spent publishing the database to RESTful. The focus was on creating a persistence layer using JDO, which introduced our graduates to automated testing of a data layer.</span></p><p dir=\"ltr\"><span>Chief Operating Officer of our product business </span><span>shinobicontrols</span><span>, Stuart, then gave a highly interactive overview of the business and its components before one of the highlights of the annual Grad Week calendar - go-karting!</span></p><p dir=\"ltr\"><span><img src=\"https://smarter.scottlogic.com/hubfs/Kartingteamday-1.jpg?t=1511177678270\" alt=\"Kartingteamday-1\"></span></p><p dir=\"ltr\"><span>Returning 2014 intern Mila said: “I really enjoyed my previous placement and the atmosphere at the company, so am pleased to be back as a full-time graduate.</span><span> </span></p><p dir=\"ltr\"><span>“The induction week so far is intense but really interesting. We’re working with lots of different technologies, many of which are new to me so I’m learning a lot.”</span></p><h1 dir=\"ltr\"><span>Wednesday</span></h1><p dir=\"ltr\"><span>Although a little stiff from around 40 laps each and a few hairpin bends at 50mph from our go-karting the night before, our grads knuckled down to graft. </span></p><p dir=\"ltr\"><span>Ian, an expert in web applications who started his Scott Logic career on the graduate programme, assisted our new team members in creating apps to connect to RESTful services, specifically helping them focus on learning Grunt, RequireJS and Knockout.</span></p><p dir=\"ltr\"><span>Jack graduated last month from a degree in Computer Science at Newcastle University. He said: “Scott Logic is a prestigious company that really focuses on providing people with solutions.</span><span> </span><span>Compared to other software firms, here it’s more about the science. It’s more about the technology.”</span></p><p dir=\"ltr\"><span>By the end of the afternoon, each team had something resembling a table football application, which would evolve throughout the week into a more sophisticated piece of software. Before hitting the pitch for an evening of full-size footie, the afternoon saw the grads briefed on software testing at Scott Logic, which for many was the first time working with those who specialise solely in this skill.</span></p><h1 dir=\"ltr\"><span>Thursday</span></h1><p dir=\"ltr\"><span>Anna, a member of our User Experience (UX) team, devised a practical session which let our grads’ creativity loose. They experimented cutting bits of paper up and sticking them together in different ways as an introduction to the importance of design in the user interface. </span></p><p dir=\"ltr\"><span>Meeting our Technology Director Colin was a great opportunity to get a better understanding of the breadth of work our keen minds might get involved in throughout their Scott Logic careers. They learnt about CSS and Preprocessors. Less provided a focal point to the session as the grads are lucky enough to work with one of the technology’s authors, Luke. </span></p><p dir=\"ltr\"><span>Lauren, a maths and computer science graduate from Bristol, said: “I picked Scott Logic’s graduate programme because I’m really interested in applying the knowledge from my degree to a company where I can build great web applications. </span></p><p dir=\"ltr\"><span>“The week has been really good fun, not only because of the social side but, although intense, the work we’ve been doing has been really interesting and enjoyable. Everyone’s been really helpful. We’ve been given the freedom to get to know the tools and techniques without being spoon-fed, but people are always close by if you need help or get stuck on something.”</span></p><p dir=\"ltr\"><span>By the end of the penultimate day of Grad Week, everyone had a table football ladder that was both visually pleasing and functioned around the needs of its user. They then headed to the local pool hall for a bit of good-natured competition and some refreshments to round off the day.</span></p><h1 dir=\"ltr\"><span>Friday</span></h1><p dir=\"ltr\"><span>A look at some of the more modern features of HTML5 focused on WebSockets to implement a ‘chat’ feature in the culmination of the week’s work - our table football applications. The systems raised a giggle or two as our graduates were surprised by a virtual Sam appearing on screen in real time </span><span>chat</span><span> to deliver feedback and ask questions.</span></p><p dir=\"ltr\"><span>Our grads were given the chance to individualise and embellish their table football applications before being grilled by our resident panel of technology experts</span><span>. </span><span>They were asked about the week’s tasks and technologies, and explained why they’d chosen their app’s specific features.<br><br></span><img src=\"https://smarter.scottlogic.com/hubfs/scorelogic_resized.jpg?t=1511177678270\" alt=\"scorelogic_resized\"></p><p dir=\"ltr\"><span><br>Judged on both the quality of their presentation and the appearance and functionality of the app, Jack and Lauren were crowned the best of the bunch and treated to a few pats on the back, as well as a customisable tiara each, at Friday bar - a monthly treat which is just one of the many perks of working at Scott Logic.</span></p><hr><p><img src=\"https://smarter.scottlogic.com/hubfs/Friday_bar_img.jpg?t=1511177678270\" alt=\"Friday_bar_img\"></p><p>It’s great to have been able to welcome so many technically gifted people to the team. Week one is an important part of our Graduate Programme orientation, designed not only to build technical learning, but to allow everyone to enjoy themselves and get to know each other socially.</p><p dir=\"ltr\">Our 2016 Graduate programme will open to applicants in October 2015.</p><div><span> </span></div>"},
{"publishDate": "2015-06-24 16:33", "category": "Careers", "author": "jwilson", "title": "why communication is the key to great software", "slug": "why-communication-is-the-key-to-great-software", "summary": "When hiring, many employers list communication skills as among the most essential competencies for a huge array of roles.", "content": "<h2 dir=\"ltr\"><img src=\"https://smarter.scottlogic.com/hubfs/comms_post_image.jpg?t=1511177678270\" alt=\"comms_post_image\"></h2><span id=\"docs-internal-guid-8ba36110-20aa-8f59-f28e-1b91d9c10924\"><br>When hiring, many employers list communication skills as among the most essential competencies for a huge array of roles. You might think they wouldn’t be top of the list for a software development firm, so we asked some of our team to explain why good communication is an indispensable skill at Scott Logic, regardless of job title.<!--more--><br></span><h2 dir=\"ltr\">For a Developer...</h2><p dir=\"ltr\">A common model is for members of a group to work individually on separate features, and merge their work at regular intervals. Whilst this model does allow parallel work, its results pale compared to those of a team that constantly collaborates. Pair programming sessions, shared design and swarming on tasks allow much greater gains than a parallel working model, but these techniques also rely on communication skills for excellence to be achieved.  <br><br><strong>David, Senior Developer</strong><br><br></p><h2>For a UX Designer...</h2><p dir=\"ltr\"><strong>Rui, UX Designer</strong><br><br></p><h2>For a Tester...</h2><p dir=\"ltr\"><strong>Daniel, Lead Tester</strong><br><br></p><h2>For a project manager...</h2><p dir=\"ltr\">Communication skills are both written and verbal. With respect to project governance, written communication skills are paramount in effectively communicating progress and any risks identified, usually through a weekly status report. Verbal communication skills are essential in allowing the project manager to build effective relationships based on trust and respect, with both project stakeholders and development teams alike. Finally let’s not forget the ability to listen and understand the meaning behind the words, from a project sponsor conveying the organisation’s vision, to a developer explaining a technical task in detail to help inform a decision-maker.<br><br><strong>Paul, Project Manager<br><br><br></strong><span id=\"docs-internal-guid-8ba36110-1bb1-1857-330d-463e8f30afec\">It can be easy to think of communication skills as more relevant to certain lines of work than others. However, as expressed by our team members above, collaboration is vital to all roles at Scott Logic, and key to successful collaboration is effective communication.</span><strong><br></strong></p><div><span> </span></div>"},
{"publishDate": "2017-03-28 10:00", "category": "Insights", "author": "khurley", "title": "RegTech and MiFID II", "slug": "regtech-and-mifid-ii", "summary": "RegTech seems to have surpassed FinTech in the vocabularies of a lot of our banking clients in 2017. No doubt one reason is the impending MiFID II deadline", "content": "<p><span style=\"font-weight: 400;\">RegTech – this term seems to have surpassed FinTech in the vocabularies of a lot of our banking clients in 2017. No doubt one significant reason for this is the impending, albeit amended, deadline for MiFID II in January 2018. </span></p><h2><span style=\"font-weight: 400;\">SHIFTING SANDS</span></h2><p><span style=\"font-weight: 400;\">When I attended <a href=\"/insights/etas-2016-an-experience-shared\" target=\"_blank\">ETAS</a> in November, startlingly few banks had even begun work on it, but judging by the number of requests we‘ve received for help so far this year, the Square Mile and Wharf have well and truly woken up to it now!</span></p><p><span style=\"font-weight: 400;\">As new regulations continue to be handed down at pace from the FCA, the EU and other authorities, there are no shortage of companies designing solutions to address these requirements. Ever since the financial crisis, spending in IT for banks has changed dramatically, with most change budgets being assigned to compliance, or anti-fraud programmes, and very little else. </span></p><p><span style=\"font-weight: 400;\">The smart operators in town have responded to this in force, with a few FinTechs shifting focus to RegTech. This, in turn, has led to some significant mergers and acquisitions activity, with larger players acquiring niche product companies, such as NEX (formerly ICAP) buying out Abide Financial and integrating it to its suite of reporting products. </span></p><p><span style=\"font-weight: 400;\">I also note, from a summit I attended last month, that a lot of the larger banks are taking advantage of start up RegTech solutions, either investing in them significantly themselves, or using larger consultancies to ensure the solutions are ‘enterprise ready’ and credible.</span></p><h2>DATA'S ROLE IN REGTECH</h2><p><span style=\"font-weight: 400;\">To use a familiar phrase, </span><i><span style=\"font-weight: 400;\">data is king</span></i><span style=\"font-weight: 400;\"> in RegTech. MiFID II has raised the stakes by requiring 65 reporting fields, with only 13 of the original 23 fields from MiFID I remaining unchanged. By anyone’s standards, this is a huge increase, and stitching said data together is no mean feat, let alone putting it into a decent presentation layer! </span></p><p><span style=\"font-weight: 400;\">With this in mind, new reporting products should be able to help, but getting the back end architecture in good enough shape to feed them is another challenge. At a recent <a href=\"/insights/fintech-code-themes-for-devops-and-agile-transformation-in-financial-services\" target=\"_blank\">DevOps conference I attended</a>, there were interesting discussions around how cloud technologies could be securely leveraged to address the increase in demand for infrastructure to serve these new requirements.</span></p><p><span style=\"font-weight: 400;\">On the other end of the scale, a lot of larger institutions are still attempting to tackle the full MiFID II problem in-house, with disparate sources of legacy technology stacks being cited as the main reason. </span><span style=\"font-weight: 400;\">I‘ve heard tell of a few Big Data technologies being experimented with to overcome this, which would make a great use case, and help overhaul some creaking IT estates. Also, the far-reaching view of MiFID II across more asset classes means that approaches that were once siloed now need to be rethought to be more strategic and cross-functional across the enterprise. </span></p><p><span style=\"font-weight: 400;\">Whatever the approach, be it adopting fresh new RegTech products, harnessing the expertise of third party consultancies, or using the wealth of knowledge retained in house, one thing’s for sure - there’s a lot to do and the window in which to do it is closing fast!</span></p>"},
{"publishDate": "2015-06-17 11:38", "category": "Careers", "author": "mcrease", "title": "Making the leap from academia to industry", "slug": "making-the-leap-from-academia-to-industry", "summary": "Murray Crease attends the inaugural PhD Horizons conference at the University of Edinburgh and discusses the breadth of career opportunities open to PhD graduates.", "content": "<br><br><br><br><br><h2 dir=\"ltr\"><span><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/murrays_blog_pic.jpg?t=1511177678270&amp;width=660&amp;name=murrays_blog_pic.jpg\" alt=\"murrays_blog_pic\" width=\"660\" style=\"width: 660px; display: block; margin-left: auto; margin-right: auto;\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/murrays_blog_pic.jpg?t=1511177678270&amp;width=330&amp;name=murrays_blog_pic.jpg 330w, https://smarter.scottlogic.com/hs-fs/hubfs/murrays_blog_pic.jpg?t=1511177678270&amp;width=660&amp;name=murrays_blog_pic.jpg 660w, https://smarter.scottlogic.com/hs-fs/hubfs/murrays_blog_pic.jpg?t=1511177678270&amp;width=990&amp;name=murrays_blog_pic.jpg 990w, https://smarter.scottlogic.com/hs-fs/hubfs/murrays_blog_pic.jpg?t=1511177678270&amp;width=1320&amp;name=murrays_blog_pic.jpg 1320w, https://smarter.scottlogic.com/hs-fs/hubfs/murrays_blog_pic.jpg?t=1511177678270&amp;width=1650&amp;name=murrays_blog_pic.jpg 1650w, https://smarter.scottlogic.com/hs-fs/hubfs/murrays_blog_pic.jpg?t=1511177678270&amp;width=1980&amp;name=murrays_blog_pic.jpg 1980w\" sizes=\"(max-width: 660px) 100vw, 660px\"><br>Panelist Presentations</span></h2><p dir=\"ltr\"><span>The conference took the form of a series of sessions, each with a panel of speakers who gave a 10-minute overview of the path their careers took following the completion of their PhD, before taking questions from the floor. </span></p><p dir=\"ltr\"><span>I was one of four ‘Business and IT’ panelists, each with very different backgrounds and experiences. Despite this, there were a couple of common themes that ran through all our presentations - luck and the broader skills you gain from doing a PhD.</span></p><p dir=\"ltr\"><span>In advance of the conference, panelists were asked to consider the role luck played in the path their careers took. Listening to the presentations, what stood out to me was that yes, there was luck involved, but the adage that you make your own luck - or perhaps the harder you work the luckier you get - has never been truer. </span></p><p dir=\"ltr\"><span>Whether it was a school careers adviser that sent a career down a certain path; a research contact that made a job available; or the flexibility afforded by academia to learn new skills, none of this would have been of any benefit without the foresight and ability each panelist had to take advantage of these lucky breaks.</span></p><p dir=\"ltr\"><span>A second point of agreement was that the skills a PhD teaches go far beyond those directly linked to the research undertaken. There was no commonality on how directly applicable the panellists’ PhD research had been to their subsequent careers. In some cases it was directly linked, while other contributors are now in a completely different industry, but the skills learnt in all cases had universal worth. </span></p><p dir=\"ltr\"><span>Perhaps the most obvious skill shared by the panel was problem-solving, the value of which cannot be underestimated, forming the basis of many PhDs. Perhaps less obvious are the communication skills that a PhD forces - often painfully - a student to learn. Whether it is the hours spent getting that paper under the word limit without removing any clarity or relevant information; the 15 minute presentation to give justice to a year’s work; or the ability to argue a point while listening to an alternative viewpoint; all teach communication skills that are invaluable in the workplace.</span></p><p dir=\"ltr\"><span>It may not seem like it at the time, but even those many hours spent explaining programming fundamentals to first year students who are only taking computing as a timetable filler, teaches the invaluable skill of explaining complicated ideas in a way that even management can understand.<br><br> </span></p><h2 dir=\"ltr\"><span>Audience Questions</span></h2><p dir=\"ltr\"><span>A short Q&amp;A session was followed by an informal networking session over coffee. Again, while the backgrounds of the students was varied, a common concern seemed to be the perceived difficulty of making the switch to industry. Many students asked how they could ‘catch up on lost time’, or get to a level comparable to someone who has spent their time in industry while they have been earning a PhD. </span></p><p dir=\"ltr\"><span>It seemed there was an assumption that employers would view the time spent earning a PhD as wasted, and I am sure there are some employers who may view it this way. I would argue, however, that this time isn’t wasted. It is merely spent differently. As previously mentioned, working on a PhD teaches a range of skills and provides opportunities that just aren’t typically available in industry at graduate level; not least leading a three or four-year project and producing (hopefully!) a significant deliverable at the end.</span></p><p dir=\"ltr\"><span>A second concern that was raised with me several times was more specifically related to PhD students interested in development roles. Many wondered how a PhD graduate with an undergraduate degree in Computing Science but limited development experience, would be viewed in comparison to a recent computing science graduate. The simple answer is that every case is different, but in my view a recent graduate and a PhD graduate are two very different individuals. The PhD has several more years of experience which, while not directly comparable to analogous experiences in industry, are valuable nonetheless. I certainly wouldn’t view the time spent working towards a PhD as somehow devaluing the earlier computing science degree, and this was something some were worried about.<br><br> </span></p><h2 dir=\"ltr\"><span>Scott Logic and PhD Graduates</span></h2><p dir=\"ltr\"><span>Scott Logic has always looked for candidates with a strong academic background, and having a PhD very much fit this profile. That said, we are a technology company so we need our candidates to be able to demonstrate good technical knowledge as well as the smarts that come with completing a PhD. We take pride in staffing our offices with smart individuals who like solving difficult problems for our clients. This is true regardless of background, so it is crucial that you keep up to date with your preferred technologies.</span></p><p dir=\"ltr\"><span>Keeping up with evolving trends is likely enough if you have worked on a PhD that required extensive coding - whether as the end product or a tool to support the research. If your PhD is less focused on development, you will need to maintain your skills in a different way. This could be by working on personal projects away from your research, or perhaps teaching software engineering courses. </span></p><p dir=\"ltr\"><span>An interesting extension to the conversations that arose was around making the transition to industry after some years as a post-doc researcher. Again, there was a general concern that those years spent in academia would be viewed as worthless in industry and, conversely, that making this move would be throwing away all the time spent in academia. To the latter point I’d say making any career change involves shelving some skills but I’d suggest the alternative - remaining in the same silo for the rest of your career - is less appealing. How years spent in academia are viewed in industry very much depends on how those years were spent. From Scott Logic’s perspective, working as a developer on a PhD research project raises the same questions as working as a developer in industry: </span></p><ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><span>how strong is your coding ability</span></p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><span>how good are your communication skills; and</span></p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><span>how would you fit into one of our teams? </span></p>\n</li>\n</ul><p dir=\"ltr\"><span>If you can give suitable answers to these questions then we would absolutely want to hear from you. If you think there are gaps in your skill set then you should seek to fill these as much as possible; as you would if you were coming to us from an industrial role.<br><br> </span></p><h2 dir=\"ltr\"><span>Conclusion</span></h2><p dir=\"ltr\"><span>The PhD Horizons conference at Edinburgh University was a fantastic opportunity for me to engage with a wide range of PhD students and give an indication of some of the opportunities we can offer at Scott Logic. </span></p><span id=\"docs-internal-guid-7edbdceb-fce8-38ec-03fc-d53df04f4e99\"><span>Doing a PhD is a fantastic opportunity, not only to work on a piece of novel research, but also to learn new skills away from the research itself. When the opportunity arises - whether while completing the PhD or after some years in academic research - it should enable a relatively straightforward transition into industry; and Scott Logic would certainly be interested in hearing from you.<br><br></span></span>"},
{"publishDate": "2017-01-19 16:05", "category": "Insights", "author": "ceberhardt", "title": "Our most popular Tech Blog posts of 2016", "slug": "our-most-popular-tech-blog-posts-of-2016", "summary": "OK, I’m a bit late; I intended this for the start of January, but this time last year I wrote a post on our most popular 2015 technical blogs. Here I am again!", "content": "<p>OK, so I’m a bit late; it was my intention to write this post at the start of January. However I’ve been a bit busy…which is a good thing!</p><p><span style=\"font-weight: 400;\">At the start of 2016 I </span><a href=\"//smarter.scottlogic.com/insights/most-popular-tech-blog-posts-of-2015\"><span style=\"font-weight: 400;\">wrote a brief post</span></a><span style=\"font-weight: 400;\"> that shared the most popular topics on our technical blog from the previous year, and here I am to repeat the exercise. </span></p><p><span style=\"font-weight: 400;\">Firstly, the number of visitors to our site has continued to increase. Towards the end of 2015 we exceeded 100,000 visitors per month for the first time; throughout 2016 visits have continued to grow, pushing towards 120,000 per month.</span></p><h2><span style=\"font-weight: 400;\">Strength in numbers</span></h2><p><span style=\"font-weight: 400;\">Looking at some of the other metrics, in 2016 we published:</span></p><ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">80 blog posts (+12 compared to 2015)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">By 32 different authors (+4 compared to 2015)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Including 18 new authors.</span></li>\n</ul><p><span style=\"font-weight: 400;\">While it's great to see an increase in the overall number of blog posts and visitors, I’m most pleased with the number of new authors we’ve attracted.</span></p><p><span style=\"font-weight: 400;\">Looking back on 2016 the five most popular blog posts (with visit counts suitably corrected based on the date they were published) were:</span></p><ul>\n<li style=\"font-weight: 400;\"><a href=\"http://blog.scottlogic.com/2016/01/20/restful-api-with-aspnet50.html\"><span style=\"font-weight: 400;\">Building a Restful API with ASP.NET 5</span></a><span style=\"font-weight: 400;\"> - In this post, Nick Soper walks through the process of creating a REST API with ASP.NET 5 (now ASP.NET Core 1.0). This was a very successful post which continues to attract large volumes of traffic, showing that practical posts with clear and simple instructions are very valuable </span></li>\n<li style=\"font-weight: 400;\"><a href=\"http://blog.scottlogic.com/2016/09/05/hosting-netcore-on-linux-with-docker.html\"><span style=\"font-weight: 400;\">Hosting .NET Core on Linux with Docker</span></a><span style=\"font-weight: 400;\"> - Another one from Nick Soper, this time building on the previous post to demonstrate deployment through Docker</span></li>\n<li style=\"font-weight: 400;\"><a href=\"http://blog.scottlogic.com/2016/11/01/go-particle-simulation.html\"><span style=\"font-weight: 400;\">Creating a Simple Particle Simulation with Go</span></a><span style=\"font-weight: 400;\"> - Here Will Ferguson shares his experience of learning a new language</span></li>\n<li style=\"font-weight: 400;\"><a href=\"http://blog.scottlogic.com/2016/05/19/redux-reducer-arrays.html\"><span style=\"font-weight: 400;\">Applying Redux Reducers to Arrays</span></a><span style=\"font-weight: 400;\"> - This is one of my posts, that explores the very popular Redux pattern</span></li>\n<li style=\"font-weight: 400;\"><a href=\"http://blog.scottlogic.com/2016/06/13/code-reuse-in-microservices-architecture.html\"><span style=\"font-weight: 400;\">Code Re-use in Microservice Architecture with Spring Boot</span></a><span style=\"font-weight: 400;\"> - Last but not least, this post from Bartosz Jedrzejewski explores code re-use within microservices. Another of his posts, </span><a href=\"http://blog.scottlogic.com/2016/01/05/java-microservices-with-dropwizard-tutorial.html\"><span style=\"font-weight: 400;\">Java Microservices with Dropwizard</span></a><span style=\"font-weight: 400;\">, narrowly missed out on a top five slot.</span></li>\n</ul><p><span style=\"font-weight: 400;\">It’s great to see such a diverse range of topics being covered on the blog, a trend I’m sure will continue throughout 2017. Happy New Year!</span></p><p><span style=\"font-weight: 400;\">Regards, Colin E.</span></p>"},
{"publishDate": "2017-01-11 12:54", "category": "Insights", "author": "sroebuck", "title": "Digital transformation: getting started and avoiding common pitfalls within the public sector", "slug": "digital-transformation-getting-started-and-avoiding-common-pitfalls", "summary": "Given the complexity of digital transformation, how does anyone faced with a responsibility to deliver get to grips with the issues and decide where to start?", "content": "<p><span style=\"font-weight: 400;\">Digital transformation and the </span><i><span style=\"font-weight: 400;\">Digital Service Standard</span></i><span style=\"font-weight: 400;\"> sit at the heart of plans to improve and reduce the cost of UK public services, but the terminology is confusing and implications hard to grasp.</span></p><p><span style=\"font-weight: 400;\">While </span><i><span style=\"font-weight: 400;\">digital transformation</span></i><span style=\"font-weight: 400;\"> implies technological change, there’s widespread recognition that it’s as much about focusing on customer needs and transforming public services as with new computer systems.</span></p><p><span style=\"font-weight: 400;\">Given the complexity of this area, how does anyone faced with a responsibility to deliver digital transformation come to grips with the key issues and decide where to start?<!--more--></span></p><h2>What’s driving this agenda?</h2><p><span style=\"font-weight: 400;\">It's hardly a surprise in a time of austerity that the key driver for digital transformation is the need to reduce the cost of delivering public services. And while cost reduction isn’t front and centre in the digital service standards of the UK and Scotland, there remains an expectation to reduce costs.</span></p><p><span style=\"font-weight: 400;\">What the standards do make clear is the need to identify performance indicators for any new service, of which four are pre-defined and mandatory. Unsurprisingly, the first of these focuses on cost:</span></p><ol>\n<li style=\"font-weight: 400;\"><a href=\"https://www.gov.uk/service-manual/measuring-success/measuring-cost-per-transaction\"><span style=\"font-weight: 400;\">Cost per transaction</span></a><span style=\"font-weight: 400;\"> - how much it costs the government each time someone completes the task your service provides</span></li>\n<li style=\"font-weight: 400;\"><a href=\"https://www.gov.uk/service-manual/measuring-success/measuring-user-satisfaction\"><span style=\"font-weight: 400;\">User satisfaction</span></a><span style=\"font-weight: 400;\"> - the percentage of users satisfied with their service experience</span></li>\n<li style=\"font-weight: 400;\"><a href=\"https://www.gov.uk/service-manual/measuring-success/measuring-completion-rate\"><span style=\"font-weight: 400;\">Completion rate</span></a><span style=\"font-weight: 400;\"> - the percentage of transactions users successfully complete</span></li>\n<li style=\"font-weight: 400;\"><a href=\"https://www.gov.uk/service-manual/measuring-success/measuring-digital-take-up\"><span style=\"font-weight: 400;\">Digital take-up</span></a><span style=\"font-weight: 400;\"> - the percentage of users choosing your digital service over non-digital channels.</span></li>\n</ol><h2>Getting from A to B: what does the roadmap look like?</h2><span style=\"font-weight: 400;\">To clarify </span><i><span style=\"font-weight: 400;\">digital transformation</span></i><span style=\"font-weight: 400;\">, the UK’s Government Digital Service (GDS) and the Scottish Government’s Digital Transformation Service (DTS) have published the </span><a href=\"https://www.gov.uk/service-manual/service-standard\"><i><span style=\"font-weight: 400;\">Digital Service Standard</span></i></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://resources.mygov.scot/standards/digital-first/\"><i><span style=\"font-weight: 400;\">Digital First Service Standard</span></i></a><span style=\"font-weight: 400;\"> respectively. These should be used as checklists for anyone carrying out digital transformation.</span><p><span style=\"font-weight: 400;\">However, the Standards’ criteria are sufficiently numerous that it’s hard to know where to start. The DSS has 18 separate criteria, the first five of which are:</span></p><ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Understand user needs</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Put a plan in place for ongoing user research</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Put in place a sustainable multi-disciplinary team that can design, build and operate the service</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Build the service using agile, iterative and user-centred methods</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Build a service that can be iterated and improved upon on a frequent basis.</span></li>\n</ol><p><span style=\"font-weight: 400;\">These are important considerations and encompass a huge wealth of knowledge that must lie behind successful digital transformation. For many this could seem overwhelming and all-encompassing. </span></p><p><span style=\"font-weight: 400;\">A good place to start is to ask two questions:</span></p><ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Do we really understand how the current service works?</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Do we have a vision of what the future service should be like?</span></li>\n</ol><p><span style=\"font-weight: 400;\">The questions are simple but the answers more difficult.</span></p><h2>Embracing the impact of current performance</h2><p><span style=\"font-weight: 400;\">It may seem counter-intuitive to look at the existing service. But many public services have existed for a long time, their underlying processes and systems having been built up over time, without any formal central documentation. In some cases, a process description may be out of date, but only the people who carry out the existing process realise this. In other cases, computer systems may have been delivered that failed to meet requirements, with manual processes introduced to compensate, without any widespread recognition. To duplicate any of these formally defined systems would duplicate a system that doesn't work.</span></p><p><span style=\"font-weight: 400;\">It’s far too easy to underestimate or misunderstand an existing service, or attempt to reproduce a system that doesn't work. Across pockets of the public sector, there are lots of good, tried and tested approaches to understanding existing services. Thought provoking starting points to this approach include:</span></p><ol>\n<li style=\"font-weight: 400;\"><a href=\"http://www.triarchypress.net/john-seddon.html\"><i><span style=\"font-weight: 400;\">Freedom from Command &amp; Control</span></i><span style=\"font-weight: 400;\"> and </span><i><span style=\"font-weight: 400;\">Systems Thinking in the Public Sector</span></i><span style=\"font-weight: 400;\">, both by John Seddon</span></a><span style=\"font-weight: 400;\">. The underlying principles of systems thinking are not unique to this author, but he's provocative and the read is both interesting and applicable to the UK public sector </span></li>\n<li style=\"font-weight: 400;\"><a href=\"http://www.gerrymcgovern.com/books/transform-rebels-guide-digital-transformation\"><i><span style=\"font-weight: 400;\">Transform: A rebel's guide for digital transformation</span></i><span style=\"font-weight: 400;\"> by Gerry McGovern</span></a><span style=\"font-weight: 400;\">. Gerry is an endless source of the kind of common sense that isn't common in practice.</span></li>\n</ol><p><span style=\"font-weight: 400;\">Ultimately, mapping services properly has become a specialised skill, part of the remit of User Experience (UX) designers. Sometimes mistaken for user interface designers who have a quite different skill base, UX designers are trained to map out and understand services from a user perspective, as well as find ways to redesign those services to make them more effective.</span></p><h2>A vision of the future</h2><p><span style=\"font-weight: 400;\">In the new world of Agile management and software design, it may seem that a clear picture of how a service works is all you need to get started on building something new. The Agile ideas of making small, incremental changes that always deliver a working system, and the repeatedly emphasised ability to adapt to rapid change seem both to remove the need and the value of creating long term plans. This is a common misunderstanding of Agile.</span></p><p><span style=\"font-weight: 400;\">Agile management techniques haven’t changed the long understood importance of having a clear vision of the future. While Agile </span><i><span style=\"font-weight: 400;\">does</span></i><span style=\"font-weight: 400;\"> enable work to start very quickly, without a long term vision this is a very bad way to start. It can lead to a false sense of productivity in an organisation that’s pressured to deliver results but unclear about its strategy.</span></p><p><span style=\"font-weight: 400;\">Agile techniques focus on delivering quick results towards a long term goal. The agility enables the process to carry on effectively as the long term goals change; it does not provide a way of delivering effective results without a long term goal.</span></p><p><span style=\"font-weight: 400;\">Digital transformation is crucially hinged around leadership and a vision of the end goal. The innovative and technical skills needed to provide this may be quite different from those required in the day-to-day management of existing services. This may be relatively rare in organisations that have placed an emphasis on the maintenance and stability of existing services.</span></p><p><span style=\"font-weight: 400;\">There are many current initiatives in public sector organisations to hire and rapidly promote managers with these critical skills, but their value will not necessarily be realised immediately. In the meantime, the need to work with agencies to bootstrap transformation projects with the required Agile management and technical architecture skills will continue. Experienced skills in these areas are vital at the beginning of transformation projects to avoid common pitfalls, reduce risks and costs, and establish confidence in the vision.</span></p><h2>Navigating common pitfalls</h2><p><span style=\"font-weight: 400;\">Every digital transformation project is different, but there are many common issues and misconceptions.</span></p><p><strong>1. Combined customer services are not the same as combined computer systems</strong></p><p><span style=\"font-weight: 400;\">The drive to reduce costs and deliver better and more customer focused services has led to a lot of discussion around delivering combined services. This may result in structural combining or collaboration between previously distinct service providers. Efficiencies of scale may be sought from structural integration or operational efficiencies may be anticipated from removing or simplifying duplicated processes and paperwork.</span></p><p><span style=\"font-weight: 400;\">It’s often assumed that combining services will also mean combining the back end computer systems that support those services. The correct recognition that data duplication is usually a bad thing may lead to an expectation that a better system is one that brings all the data together in one place.</span></p><p><span style=\"font-weight: 400;\">It turns out that contrary to former practice, modern back end system designs no longer enforce or rely upon centralising data. Indeed there are often strong arguments for system architectures that split large systems into smaller, more manageable systems that are designed to talk to each other. These systems spread risk, and can be more resilient to service failure, easier to maintain, and more readily scaled to address some of the massive loads demanded of services that address large proportions of the UK population.</span></p><p><span style=\"font-weight: 400;\">In contrast, large combined systems can become exceptionally expensive to develop and maintain. Rather than facilitating agile service change, they can become the greatest barrier to change. If existing systems are already difficult to manage, combining them will only multiply the difficulties.</span></p><p><strong>2. Well intended governance may increase risk</strong></p><p><span style=\"font-weight: 400;\">Good, Agile processes are designed to minimise risk by breaking work down into deliverables within short time frames. If anything goes wrong, the end result is very quickly visible and the consequences of scrapping or reworking are low. These practices work best when they are built on multi-disciplinary teams, empowered to make the decisions needed to progress the work.</span></p><p><span style=\"font-weight: 400;\">Well governed public services often introduce boards of advisors that meet infrequently to provide strategic oversight. These practices are intended to reduce the risk of bad decisions going unnoticed. If strategic governance is considered critical to the kinds of decisions being made by an Agile team, then situations can arise where Agile teams are not fully empowered to make critical decisions, or the work is only very infrequently assessed. Both of these circumstances remove the risk-avoiding benefits of Agile practice.</span></p><p><strong>3. Digital transformation is ongoing</strong></p><p><span style=\"font-weight: 400;\">The fifth criteria of both the GDS and DTS states:</span></p><p><em><span style=\"font-weight: 400;\">\"Build a service that can be iterated and improved upon on a frequent basis, and make sure that you have the capacity, resources and technical flexibility to do so.\"</span></em></p><p><span style=\"font-weight: 400;\">Despite this clear message, it’s still commonplace to look upon digital transformation as a project that can be outsourced to a large IT consultancy. Indeed there are still situations where aspects of these 'projects' are considered sufficiently large and complex that they can’t be carried out in any other way. But no public sector IT system should be so large and complex that only a handful of the world's largest consultancies are capable of delivering the product and handling the risk.</span></p><p><span style=\"font-weight: 400;\">Cloud computing and Big Data technologies have transformed the nature of large IT systems. In the past, there were only a few companies that understood and could manage the computing elements required to run large IT systems. But it’s now possible to design and develop systems that can manage the high frequency demands of the entire UK population on a laptop computer, and then deploy that software, at scale, to meet any level of fluctuating demand.</span></p><p><span style=\"font-weight: 400;\">Modern digital systems need to be manageable and flexible enough to be able to change rapidly to social and political changes. Digital transformation is about re-equipping the public sector with the skills and technologies that enable it to provide secure and reliable services, despite those changes. To find out how to go about achieving this and building the right team, check out my previous blog post, <em>Digital Transformation in Partnership</em> </span><a href=\"//smarter.scottlogic.com/insights/digital-transformation-in-partnership\"><span style=\"font-weight: 400;\">here</span></a><span style=\"font-weight: 400;\">.</span></p>"},
{"publishDate": "2016-12-01 16:51", "category": "Insights", "author": "tmakarem", "title": "How are businesses using Big Data?", "slug": "how-are-businesses-using-big-data", "summary": "Big Data can help businesses run more efficiently. Their main challenge is getting the best value from the data they have to turn it into actionable information", "content": "<p><span style=\"font-weight: 400;\">Analysing Big Data can help businesses run a lot more efficiently. The main challenge businesses face today is getting the best value from the data they have. They are beginning to explore where they fit within the Big Data cycle, and how to leverage data to turn it into actionable information. </span></p><p><span style=\"font-weight: 400;\">In this post I examine a typical Big Data cycle, highlighting examples of how businesses are investing in Big Data and the direction this is taking.</span></p><h2>THE TYPICAL BIG DATA CYCLE</h2><p><span style=\"font-weight: 400;\">Big Data means different things to different people. It's basically defined as, data that's too complex to be processed on one machine. This can be due to various factors like the volume of it, the speed at which it’s generated and processed, inconsistency, and the variety of its formats and sources. </span></p><p><span style=\"font-weight: 400;\">Big Data isn’t new, but traditional processing applications weren’t adequate to process these large and complex data sets. Newer technologies allow us to handle large scale data well, and carry out more detailed analysis to reveal patterns and trends. </span></p><p><span style=\"font-weight: 400;\">To produce something meaningful from data, businesses need to manipulate it. This may involve having to parse and validate it, sorting it, or combining multiple sets of data before interpreting and visualising it.</span></p><p><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Big-data-components.png?t=1511177678270&amp;width=500&amp;name=Big-data-components.png\" alt=\"Big-data-components.png\" width=\"500\" style=\"width: 500px; display: block; margin-left: auto; margin-right: auto;\" title=\"Big-data-components.png\" caption=\"false\" data-constrained=\"true\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Big-data-components.png?t=1511177678270&amp;width=250&amp;name=Big-data-components.png 250w, https://smarter.scottlogic.com/hs-fs/hubfs/Big-data-components.png?t=1511177678270&amp;width=500&amp;name=Big-data-components.png 500w, https://smarter.scottlogic.com/hs-fs/hubfs/Big-data-components.png?t=1511177678270&amp;width=750&amp;name=Big-data-components.png 750w, https://smarter.scottlogic.com/hs-fs/hubfs/Big-data-components.png?t=1511177678270&amp;width=1000&amp;name=Big-data-components.png 1000w, https://smarter.scottlogic.com/hs-fs/hubfs/Big-data-components.png?t=1511177678270&amp;width=1250&amp;name=Big-data-components.png 1250w, https://smarter.scottlogic.com/hs-fs/hubfs/Big-data-components.png?t=1511177678270&amp;width=1500&amp;name=Big-data-components.png 1500w\" sizes=\"(max-width: 500px) 100vw, 500px\"></span></p><p><span style=\"font-weight: 400;\">The above diagram is a simplified view of a typical Big Data cycle. It shows each stage in the cycle and the leading technologies that could be used.</span> <span style=\"font-weight: 400;\">For this cycle to work, the culture of Big Data needs to be embedded in the organisation’s business strategy.</span></p><h2>BIG DATA AT THE CORE OF THE BUSINESS</h2><h3>Enhancing customer experience and informing business decisions</h3><p><span style=\"font-weight: 400;\">Big Data analytics can be used to enhance the customer’s experience. Within retail, businesses can collect data about consumer behaviour in store and feed it back to the retailers and manufacturers. Knowing who users are allows businesses to better cater for them. They can use Big Data analytics to optimise promotions, implement targeted marketing, enhance the use of shelf space in the store, or improve demand forecasting.</span></p><p><span style=\"font-weight: 400;\">Recently, insurance firm </span><span style=\"font-weight: 400;\"><a href=\"http://www.admiral.com/\" rel=\"nofollow\" target=\"_blank\">Admiral</a> </span><span style=\"font-weight: 400;\">announced that it wanted to analyse the Facebook accounts of first time car owners to price their insurance. The project was prevented by Facebook, who wished to protect the privacy of its users. This controversy aside, we can look at this as an example of the type of insight businesses are trying to gain. Admiral’s </span><em><a href=\"https://www.firstcarquote.com/#/desktop\" rel=\"nofollow\" target=\"_blank\">firstcarquote</a></em><span style=\"font-weight: 400;\"> was to be optional and would have offered discounts to users deemed safe drivers, based on its analysis of the potential clients’ Facebook posts. It analysed linguistic characteristics such as excessive use of exclamation marks. It looked for personality traits that it thought were linked to safe driving and used that information to inform its pricing strategy.</span></p><p><span style=\"font-weight: 400;\">Big Data analytics can help inform business decisions. For example, when merchant bank </span><a href=\"http://www.closebrothers.com/\" rel=\"nofollow\" target=\"_blank\">Close Brothers</a><span style=\"font-weight: 400;\"> wanted to find optimal locations for expansion, it used statistical and geospatial modules to gain insight into where its customers live in relation to its branches. This allowed the firm to identify target locations for potential expansion. </span></p><h3>Sustaining competitive advantage</h3><p><span style=\"font-weight: 400;\">Big Data can give a business an edge over its competitors. </span><a href=\"http://www.gracenote.com/\" rel=\"nofollow\" target=\"_blank\">Gracenote</a><span style=\"font-weight: 400;\"> has the largest database of all music collections, with more than 28 million songs. Its online services handle a trillion queries a month. Leveraging its database, it built music recognition software </span><em><a href=\"http://musicid2.com/\" rel=\"nofollow\" target=\"_blank\">MusicID</a></em><span style=\"font-weight: 400;\">, which it uses to identify files and deliver track metadata, and relevant content. </span><i><span style=\"font-weight: 400;\">MusicID</span></i><span style=\"font-weight: 400;\"> retains audio fingerprints - unique digital identifiers for audio files that can then be used in queries. It identifies files by combining the audio fingerprint with its matching text. Users can view information like the artist’s page, biography, older releases and most popular songs. </span><i><span style=\"font-weight: 400;\">Gracenote</span></i><span style=\"font-weight: 400;\">’s database gives it an advantage over competitors like </span><a href=\"https://www.shazam.com/\" rel=\"nofollow\" target=\"_blank\">Shazam</a><span style=\"font-weight: 400;\">. </span></p><h3>Enhancing security</h3><p><span style=\"font-weight: 400;\">Advances in data science and real time analytics can drive major improvements in fraud detection and enhance security. This type of problem is time sensitive and requires immediate action, and while it used to take days to detect problems, Big Data analytics can detect anomalies in real time, so they can be addressed straight away.</span></p><p><span style=\"font-weight: 400;\">For example, banks can monitor and track the digital behaviour of users to prevent fraud. They can monitor how fast users generally type in their username and password, the geographic location from which they log in to their accounts, or frequent commands they use. A change in their behaviour can be quickly flagged. Cognitive systems can be used to prevent security threats at an unprecedented speed. </span></p><p><span style=\"font-weight: 400;\">Transport network </span><a href=\"https://www.uber.com/en-GB/\"><span style=\"font-weight: 400;\">Uber</span></a><span style=\"font-weight: 400;\"> recently partnered with </span><a href=\"https://www.microsoft.com/en-gb\" rel=\"nofollow\" target=\"_blank\"><span style=\"font-weight: 400;\">Microsoft</span></a><span style=\"font-weight: 400;\"> using its cognitive service</span> <em><a href=\"https://www.onmsft.com/news/microsoft-cognitive-services-at-the-heart-of-ubers-real-time-id-check\" rel=\"nofollow\" target=\"_blank\">Real-Time ID</a></em><span style=\"font-weight: 400;\"> to verify the identity of the driver. The driver takes a selfie that should match the picture associated with his or her account, to prevent fraudulent use. It instantly compares the photo sent by the driver to the one in the database and blocks the account if there’s no match. </span></p><h3>Predictive analytics and enhanced performance</h3><p><span style=\"font-weight: 400;\">Big Data can be used to improve the efficiency of an application and report issues in real time.</span> <span style=\"font-weight: 400;\">While reporting on the data is important, it’s only the first step. One of the greatest benefits to organisations of investing in Big Data is the ability to accurately predict what’s likely to happen. This is only possible with a large volume of data. This is how </span><span style=\"font-weight: 400;\">Shazam</span><span style=\"font-weight: 400;\">, for example, is able to predict the next number one song. Users have uploaded 15 million songs to be identified. This makes it possible to know what users are listening to at any given time, and to identify the tracks with the biggest spikes in the number of listeners. </span></p><p><span style=\"font-weight: 400;\">Using Big Data analytics to anticipate results is particularly useful for predictive maintenance. Data is used to learn about the current condition of a product, and predict when maintenance is needed.</span></p><p><span style=\"font-weight: 400;\">Using </span><a href=\"https://www.microsoft.com/en-gb/cloud-platform/internet-of-things-azure-iot-suite\" rel=\"nofollow\" target=\"_blank\">Microsoft's Azure IoT suite</a><span style=\"font-weight: 400;\">,</span> <span style=\"font-weight: 400;\">propulsion solutions provider, </span><a href=\"http://www.rolls-royce.com/products-and-services.aspx\" rel=\"nofollow\" target=\"_blank\">Rolls-Royce</a><i><span style=\"font-weight: 400;\">, </span></i><span style=\"font-weight: 400;\">is collecting and analysing airline operations data to ensure reliable operation, improve performance, reduce maintenance costs, reduce fuel consumption and detect technical issues before they even happen. Previously the company only analysed engine data. The engine monitoring system uses sensors to gather real time information about the health and performance of the engines. For instance, it collected data about the amount of fuel needed to make a set amount of power. </span></p><p><span style=\"font-weight: 400;\">Now, because it has the technology to process and analyse bigger sets of data, it receives data streams from both the engines and aircraft, and the aircraft monitoring system enables more information to be captured. For example, it can detect unusual aircraft speed and collect technical logs and black box data. This analysis then feeds into the product design, manufacturing and support.</span></p><p><span style=\"font-weight: 400;\">Similarly,</span> <a href=\"http://www.geaviation.com/\" rel=\"nofollow\" target=\"_blank\">GE Aviation</a> <span style=\"font-weight: 400;\">integrates flight data and analytics to optimise fuel consumption. By measuring how something currently functions, analysing inefficiencies, optimising performance and predicting failures, it turns the engine from a product into a service, allows repairs to be planned for scheduled downtimes. </span></p><h2>THE FUTURE OF BIG DATA</h2><p><span style=\"font-weight: 400;\">Big Data is useful for understanding how users interact with a product and detecting anomalies in real time, but its true potential is in its ability to predict what’s going to happen, rather than reacting to an event. It’s gradually moving from simple data reporting to more advanced analytics, with predictive modeling and machine learning. </span></p><p><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">While there’s a lot of value in Big Data projects, one of the main challenges that businesses will need to resolve is privacy protection for their users. We’ve already seen an example of that issue with </span><span style=\"font-weight: 400;\">Admiral</span><span style=\"font-weight: 400;\">’s </span><i><span style=\"font-weight: 400;\">firstcarquote</span></i><span style=\"font-weight: 400;\"> project, and some insurers even charge higher premiums for customers thought to be less likely to switch providers based on data analysis. There has always been a struggle to balance the use of data to drive business value, and respecting user privacy. This is set to become even more prominent now that data is constantly generated by everything around us and we’re better able to process it. </span></span></p>"},
{"publishDate": "2016-11-14 14:35", "category": "Insights", "author": "sroebuck", "title": "Digital transformation in partnership", "slug": "digital-transformation-in-partnership", "summary": "The demand for speed in Digital Transformation is set against a backdrop of legacy technology, processes and procurement methods, demanding a culture shift", "content": "<h2><span>delivering with the right SME team</span></h2><p>The UK Government has just been listed on both the United Nation’s E–Government Development Index and the E–Participation Index. In accepting, the Minister said: “We are committed to the UK’s Open Government National Action Plan, which sets out our commitments to greater openness, transparency and civic participation.” The Government has tried to harness the potential benefits of involving SMEs in the public sector marketplace for many years. The departments the National Audit Office spoke to, agreed that SMEs can offer a number of benefits to the public sector, compared with other providers, including more flexibility and innovative approaches (NAO March 2016).</p><p>However, that demand for speed and success is set against a backdrop of legacy technology, processes, suppliers and procurement methods. And that demands a massive culture shift, to the extent that Digital Transformation may be about change management as much as it is about technology.</p><h2>Change means culture means team</h2><p>Culture is intrinsic to effective change management. According to <a href=\"http://www.strategy-business.com/blog/Cultures-Critical-Role-in-Change-Management?gko=a3f98\" target=\"_blank\"><u>DeAnne Aguirre and Rutger von Post</u></a> of PwC, “Culture can be a great enabler of organisational change – whether the change involves digitisation, faster product development, or a systematic lowering of costs.”</p><p>Of course, being able to create the right culture depends significantly on the team you have, and that, in turn, depends on the team’s ability to agree a shared goal and to move, as one, towards that goal. Getting the right team in place is no small challenge. At the most fundamental level, Digital Transformation demands <em>more</em> people, <em>new</em> skills and <em>different</em> ways of working before the transformation work can even begin. So how do you put your team together?</p><p style=\"text-align: center;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Public%20sector%20blog%20fig%201-2.jpg?t=1511177678270&amp;width=500&amp;height=242&amp;name=Public%20sector%20blog%20fig%201-2.jpg\" alt=\"Public sector blog fig 1-2.jpg\" width=\"500\" height=\"242\" style=\"display: block; margin-left: auto; margin-right: auto;\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Public%20sector%20blog%20fig%201-2.jpg?t=1511177678270&amp;width=250&amp;height=121&amp;name=Public%20sector%20blog%20fig%201-2.jpg 250w, https://smarter.scottlogic.com/hs-fs/hubfs/Public%20sector%20blog%20fig%201-2.jpg?t=1511177678270&amp;width=500&amp;height=242&amp;name=Public%20sector%20blog%20fig%201-2.jpg 500w, https://smarter.scottlogic.com/hs-fs/hubfs/Public%20sector%20blog%20fig%201-2.jpg?t=1511177678270&amp;width=750&amp;height=363&amp;name=Public%20sector%20blog%20fig%201-2.jpg 750w, https://smarter.scottlogic.com/hs-fs/hubfs/Public%20sector%20blog%20fig%201-2.jpg?t=1511177678270&amp;width=1000&amp;height=484&amp;name=Public%20sector%20blog%20fig%201-2.jpg 1000w, https://smarter.scottlogic.com/hs-fs/hubfs/Public%20sector%20blog%20fig%201-2.jpg?t=1511177678270&amp;width=1250&amp;height=605&amp;name=Public%20sector%20blog%20fig%201-2.jpg 1250w, https://smarter.scottlogic.com/hs-fs/hubfs/Public%20sector%20blog%20fig%201-2.jpg?t=1511177678270&amp;width=1500&amp;height=726&amp;name=Public%20sector%20blog%20fig%201-2.jpg 1500w\" sizes=\"(max-width: 500px) 100vw, 500px\"><em>People, process and procurement are at the heart of Digital Transformation</em></p><p style=\"text-align: center;\"> </p><h2>Assembling your team: 5 key options</h2><h3>1) Employing more staff</h3><p>It may seem tempting to take on additional staff with the required skillset – after all, employment gives you greater control. But the acute shortage of those skills makes good people very hard to find – and correspondingly expensive. While they may be more cost effective than an outsourcing firm or a big consultancy, their ‘digital bonus’ could well unsettle and demoralise your existing staff.</p><p>Fast-rising, highly skilled specialists may not find the public sector sufficiently attractive, especially given the arduous job-application process. There’s no guarantee that they won’t leave prematurely (perhaps affected by a lack of morale in the existing team, or demotivated by legacy approaches), leaving you facing the same recruitment challenge all over again. Nor is there any guarantee that, should they stay, they won’t absorb the pre-existing culture or fall behind with their skills.</p><p>Furthermore, a room full of disparate people doesn’t instantly become a cohesive, high-performing team, no matter how skilled or enthusiastic. There’s a steep learning curve when it comes to your domain expertise and you need to create a project culture, all while designing your roadmap. And that’s without having to get <em>today’s</em> work done, too. And what do you do with all of these people once the project is up and running?</p><h3>2) Contracting staff in</h3><p>Contracting has its appeal: you get fast, flexible access to skilled people without affecting your own staff budget or pay scales. Contractors just want to get the job done, and then move on somewhere else – and you can tell them what to do. On the downside, they just want to get the job done (perhaps not fully participating in the team culture or the wider project); they may move on <em>too soon</em>; and you have to tell them what to do!</p><p>Contractors may have the technical know-how, but they’re unlikely to know your domain. And because they’re effectively self-employed individuals, they may not work well as part of a team and need a lot more oversight and management. While some will show initiative or take responsibility, most will have limited commitment to the organisation or the project. Plus, with their skills in such demand, they could be lured away at any moment. It may also be painful for existing staff to discover the pay rates of contracted staff.  </p><h3>3) Outsourcing</h3><p>Historically, outsourcing all or part of a project or service has been a commonplace model in the public sector. After all, you benefit from pre-determined costs and timescales. You devolve a large piece of work, along with the risk, to another organisation in exchange for a set fee, leaving you free to get on with something else.</p><p>But outsourcing is inherently problematic, which is why the Government has stated it wants to move away from it. For example, there’s the long and costly process of negotiating and specifying the project to begin with – and once the deliverables have been carved in stone, there’s little scope for flexibility or change. You are locked-in and it is costly to change. Outsourcing firms often have their own ways of working, so you’re more likely to have to adapt to <em>them</em> than they to you, all of which makes outsourcing a poor match for the flexible, modular approach demanded by Digital Transformation.</p><h3><span style=\"color: #000000;\">4) Consultancy </span></h3><p>Consultancy offers the appeal of a well-respected firm of specialists, but it also shares many of the disadvantages of outsourcing. Traditionally, the big consultancies have tended to deliver discrete projects to a defined specification, and at a relatively high cost, under the terms of a detailed contract. As with outsourcing, this is at odds with the vision of Digital Transformation, which doesn’t seek to have all the answers before a project begins – or to have a single organisation deliver the lion’s share of a project.</p><p>Since consultancies, unlike outsourcing companies, tend to work alongside you, you might expect to participate in two-way knowledge transfer: you hope to add to their <em>domain</em> knowledge while they add to your <em>technical</em> knowledge. However, it doesn’t always work out that way; some consultancies are less generous when it comes to sharing expertise, and you may be left with no one in-house who can solve similar challenges in future. </p><p>However, a tendency towards using their familiar technologies may lead to 'lock-in' and difficulties in the transfer of Intellectual Property Rights (IPR). Plus, your snagging phase may last long after the consultancy’s departure (‘parachute in, catapult out’).</p><h3><span style=\"color: #000000;\">5) partner with an sme </span></h3><p>The Government’s stated intention is to pull back from large, unwieldy contracts with large, unwieldy suppliers. As a result, SMEs now <a href=\"https://www.gov.uk/performance/g-cloud\" target=\"_blank\"><u>supply more</u></a> to the G-Cloud than big businesses do; in June 2016, for example, 63.5 per cent of G-Cloud sales were by SMEs. And this will only increase, since SMEs can represent a very good fit with the Technology Code of Practice.</p><p>But according to the National Audit Office (March 2016), the Government reported that more than 25 per cent of its spending reached SMEs in 2014/15. It now aims to increase this to 33 per cent by 2020. However, the NAO can't be certain the amount the Government spends with SMEs has increased since it set its original target in 2010. The NAO recommends that if the Government is serious about increasing its use of SMEs, it will need to focus on those areas where SMEs can deliver real benefits.</p><p>Scottish finance secretary Derek Mackay has <a href=\"http://futurescot.com/co-design-will-heart-scottish-government-digital-strategy/\" target=\"_blank\"><u>argued for</u></a> “more ‘co-design’ of digital government, insisting collaboration with micro businesses and even individuals could revolutionise the way public-sector services are delivered”.</p><p>SMEs are typically nimble, adapting readily to changing requirements. And because they operate in a very competitive band of the market, they tend to be highly responsive, willingly accountable and, of course, cost-effective. They also sit in that sweet spot of size, scope and approach; they don’t need every last detail ironed out before they’ll get started, like an outsourcing company; nor do they take the ‘land and expand’ approach of the large consultancies. On the other hand, neither are they a small team of 10 independent contractors waiting to be told what to do.</p><p>SMEs often bring with them invaluable thought leadership, plus the latest technologies and best practices from across the commercial sector, which may not yet be commonplace in public services. You have a good chance of finding a business which is already up to speed with the criteria required by the Digital Service Standard; for example, many will be familiar with Agile methodologies, and will favour pragmatism over substantial pieces of bespoke development.</p><p>One approach increasingly offered by SMEs, and of major appeal to Digital Transformation projects, is to place a team of experts in-house with you or a hybrid flexi-working, thereby augmenting your own staff. This team is scalable at short notice; you might begin with one or two technical architects to help you define your roadmap before ramping up the team with service designers and user experience designers, adding developers as and when required. Potentially, you might culminate with a team of trainers and support staff for the early stages of delivery.</p><p><span>The team imported from a reasonable sized SME always has access to additional expertise back at base. Significantly, SMEs are far more likely to be concerned about building trust and developing a long term relationship, ensuring that they have carried out the knowledge transfer work so that your team is comfortable self-managing the outcomes. </span>Overall, this enables you to build an agile, highly skilled team in less time, with a shorter learning curve for both the implanted team, in terms of your domain, and for your own staff in terms of methodologies and technologies.</p><h4><strong>Summary of options</strong></h4><table style=\"height: 774px; border-color: #a6a6a6; width: 631.531px;\" border=\"1\">\n<tbody>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px;\"> </td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"background-color: #ffffff; font-size: 12px;\"><strong>Employ new staff</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"background-color: #ffffff; font-size: 12px;\"><strong>Bring in contract workers</strong></span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"background-color: #ffffff; font-size: 12px;\"><strong>Outsource projects/modules</strong></span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"background-color: #ffffff; font-size: 12px;\"><strong>Bring in consultants</strong></span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"background-color: #ffffff; font-size: 12px;\"><strong>Partner with an SME</strong></span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Speed of procurement</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Fast</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Slow</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Slow</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Ease of procurement</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Hard</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Straightforward</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Hard</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Hard</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Straightforward</span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Degree of contract lock-in</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Pace 'out of the blocks'</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Fast</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Fast</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Fast</span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Level of day to day management required</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Need to define precise needs in advance</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Speed of forming an effective team</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Insight &amp; best practice from other sectors</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Agility &amp; adaptability</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Cost</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Very high</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n</tr>\n<tr style=\"border: 1px solid grey;\">\n<td style=\"width: 102px; border-color: #757272;\"><span style=\"font-size: 12px;\"><strong>Commitment to project</strong></span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n<td style=\"width: 102px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Low</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">Medium</span></td>\n<td style=\"width: 103px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n<td style=\"width: 103.531px; border-color: #757272; text-align: center;\"><span style=\"font-size: 12px;\">High</span></td>\n</tr>\n</tbody>\n</table><h2>Scott Logic</h2><p>Scott Logic offers teams of talented, experienced and commercially astute specialists who already meet – and will help you to meet – the Digital Service Standard. We take a partnership approach, offering a full range of services, including strategic technical advice, user experience design and software development, and project management.</p><p>We are a larger UK-based SME (200+ FTE) that has been delivering for over 11 years, with experts who have worked on more than 20 Government projects across many public sectors. In the last two financial years, we have grown revenues by 90 per cent and headcount by 72 per cent.</p><p>We welcome any conversation about contributing to Digital Transformation in the <a href=\"http://www.scottlogic.com/sectors/public-sector/\" target=\"_blank\"><u>public sector</u></a>. Please get in touch at <a href=\"/cdn-cgi/l/email-protection#15707b64607c677c70665566767a6161797a727c763b767a78\" target=\"_blank\"><span class=\"__cf_email__\" data-cfemail=\"0e6b607f7b677c676b7d4e7d6d617a7a626169676d206d6163\">[email protected]</span></a>.</p>"},
{"publishDate": "2016-10-20 11:52", "category": "Insights", "author": "jhill", "title": "The ins and outs of Bitcoin", "slug": "the-ins-and-outs-of-bitcoin", "summary": "Awareness of Bitcoin has steadily grown, but understanding of it less so. Allow us to shed some light.", "content": "<p><span style=\"font-weight: 400;\">Since 2008, when the mysterious </span><a href=\"https://en.wikipedia.org/wiki/History_of_bitcoin\"><span style=\"font-weight: 400;\">Satoshi Nakamoto</span></a><span style=\"font-weight: 400;\"> registered the domain name </span><a href=\"https://bitcoin.org/en/\"><span style=\"font-weight: 400;\">bitcoin.org</span></a><span style=\"font-weight: 400;\">, awareness of the peer-to-peer currency has steadily grown, and it has been joined by other second generation cryptocurrencies hailing themselves to be the future of money. But are we really close to that being the case when the average Joe is still unclear on what Bitcoin is? Allow us to shed some light.</span></p><h2>What is Bitcoin?</h2><p><span style=\"font-weight: 400;\">Bitcoin is the biggest and arguably the </span><a href=\"https://99bitcoins.com/who-accepts-bitcoins-payment-companies-stores-take-bitcoins/\"><span style=\"font-weight: 400;\">most well known</span></a><span style=\"font-weight: 400;\"> digital currency in the market. It’s a cryptocurrency; a currency where ownership of money or 'coins' is proven mathematically, and last year, the number of global merchants accepting payment in Bitcoin </span><a href=\"http://www.ibtimes.co.uk/bitcoin-now-accepted-by-100000-merchants-worldwide-1486613\"><span style=\"font-weight: 400;\">surpassed 100,000</span></a><span style=\"font-weight: 400;\">.</span></p><p><span style=\"font-weight: 400;\">There are two methods of acquiring Bitcoin, firstly by </span><i><span style=\"font-weight: 400;\">mining</span></i><span style=\"font-weight: 400;\"> it, or secondly, by purchasing it at an exchange. A miner is a single member of the network, whether an individual trader or a large corporation, as in most cases. Miners spend their time on the network validating transactions to create the next chapter (or block) of the currencies ledger. The network is a huge group of miners, all racing to check transactions and create the next block.</span></p><p><span style=\"font-weight: 400;\">A block is currently around 1Mb of data, or around 1,000 to 2,000 transactions, and there’s one block created approximately every 10 minutes. Each time a block is created, other miners will verify that the submitted block is valid, and all the transactions it contains are also valid. A huge publicly accessible ledger called the Blockchain exists, in which everyone submits transactions ie when Bitcoin changes hands, for </span><i><span style=\"font-weight: 400;\">miners</span></i><span style=\"font-weight: 400;\"> to read and either accept or reject, depending on whether they can be proven mathematically valid.</span></p><p><span style=\"font-weight: 400;\">If you want to see the public ledger for Bitcoin, it can be viewed at \"</span><a href=\"https://blockchain.info/\"><span style=\"font-weight: 400;\">https://blockchain.info/</span></a><span style=\"font-weight: 400;\">\". On this website you can see every transaction occurring around the world, as well as new blocks as they are created. Mining is a very difficult process as the number of miners you are competing against is huge. It’s very unlikely that over a year an individual miner will successfully mine a single block for Bitcoin, but if they do, the reward for that block is 12.5 bitcoins ($7113.25 USD - 16/08/2016).</span></p><p><span style=\"font-weight: 400;\">Purchasing from an exchange is the easiest method of acquiring bitcoin. Several major exchanges such as Poloniex, BTC-E, Bitfinex and Kraken allow users to associate bank accounts to purchase cryptocurrencies. One off payments can be made to smaller holding companies such as coinbase. And like any other currency, you are able to use an exchange to cash Bitcoin into a more convenient currency, like USD, EUR or GBP. With all exchanges, there will be a small fee associated with transferring the money, but this can be offset, given you’ve made enough profit.</span></p><p><span style=\"font-weight: 400;\">To spend any money in a cryptocurrency network, you need to be able to prove you own the coins you want to spend. In the case of transactions involving very large amounts, the miner will receive a minimum fee, which is a condition built into the underlying algorithm.</span></p><p><span style=\"font-weight: 400;\">To spend Bitcoin, you first need an address to pay money into. Whoever is involved in the transaction will provide </span><i><span style=\"font-weight: 400;\">addresses</span></i><span style=\"font-weight: 400;\"> to which Bitcoin can be paid. The term </span><i><span style=\"font-weight: 400;\">address</span></i><span style=\"font-weight: 400;\"> in this context refers to very large numbers calculated using things only the owner of that </span><a href=\"https://blockchain.info/address/152f1muMCNa7goXYhYAQC61hxEgGacmncB\"><span style=\"font-weight: 400;\">address</span></a><span style=\"font-weight: 400;\"> knows, and written in a form convenient and secure for users. Running some maths as an owner spending money from an address is how you prove ownership of the address, and therefore the Bitcoin in the transaction. An example of a Bitcoin address is </span><a href=\"https://blockchain.info/address/152f1muMCNa7goXYhYAQC61hxEgGacmncB\"><span style=\"font-weight: 400;\">152f1muMCNa7goXYhYAQC61hxEgGacmncB</span></a><span style=\"font-weight: 400;\">.</span></p><p><span style=\"font-weight: 400;\">Given to the Bitcoin handler of your choice, in the same way you interact with your high street bank for example, a transaction will be created using money located at addresses you currently own. The transaction will pay the recipient and also pay out to an address you own (for your change). Once money at an address has been spent, it cannot be returned. Instead, money in Bitcoin moves from address to address, and when using the network as it should be used, this recipient shouldn’t be at the same address more than once. This is to protect against potential hackers, as the more you re-use an address, the more information you give to them, in the same way as you shouldn’t use the same password for multiple online accounts.</span></p><h2>So should I be trading in Bitcoin?</h2><p><span style=\"font-weight: 400;\">Bitcoin, while still a small community relative to the countries behind foreign exchange currencies, currently has a $9 billion market cap (correct at the time of writing). It can be volatile to the point where it changes +/- five per cent over the course of a day, with other cryptocurrencies seeing shifts of +/- 30 per cent. Investment in cryptocurrencies can be extremely profitable, albeit very risky. There is a fairly low risk of hackers or any other online threats accessing your money. The danger of losing money to hackers or other threats is greater if you are handling your own private keys and addresses. Giving an exchange the task of calculating and arranging payments reduces the chance of you losing money.</span></p><p><span style=\"font-weight: 400;\">Bitcoin is primarily bought by people who are looking to invest. The highly volatile nature of the currency makes it very profitable for short term investments, albeit very risky, and several high profile names are being heralded as </span><a href=\"http://www.altcointoday.com/top-5-bitcoin-millionaires/\"><span style=\"font-weight: 400;\">Bitcoin millionaires</span></a><span style=\"font-weight: 400;\">. There are several websites which currently allow you to pay in Bitcoin and it has become a more popular payment method in recent years.</span></p><p><span style=\"font-weight: 400;\">Recent security breaches in cryptocurrency markets are in no way related to the underlying core blockchain algorithm that forms the basis of all cryptocurrencies. The two largest breaches in recent times are the DAO (</span><span style=\"font-weight: 400;\">Decentralized Autonomous Organisation)</span><span style=\"font-weight: 400;\"> hack ($132.7m at the time) and the Bitfinex ($72m at the time). The DAO is a cryptocurrency which runs atop another cryptocurrency network (ethereum). The breach involved exploiting smart contracts which are used to compromise the DAO. These smart contracts are not part of the blockchain algorithm. The breach at Bitfinex did not involve attacking the blockchain, but rather the exchange itself.</span></p><p><span style=\"font-weight: 400;\">In both cases, the underlying blockchain algorithms were not compromised and so remain safe. The basis of blockchain security is a cryptographic function, which to date has not been broken. This makes the currency itself secure; the danger in cryptocurrencies comes from losing your keys which prove you own coins. Most exchanges will handle keys for you, and in the event of hacks, the exchanges have refunded customers who have been victims in the past.</span></p><h2>What could the future look like?</h2><p><span style=\"font-weight: 400;\">While Bitcoin is currently a hugely volatile market, over the coming years we expect its growth will also provide stability. Right now, it’s a brilliant place to go for a quick return on investments, but its influence is ever expanding, and outside trading there are already potentially huge implications for how the underlying algorithm could be used by different industries, such as </span><a href=\"http://bravenewcoin.com/news/contest-launched-to-find-blockchain-solutions-to-us-healthcare-problems/\"><span style=\"font-weight: 400;\">healthcare</span></a><span style=\"font-weight: 400;\"> for example. And high street bank Santander has reportedly identified up to 25 potential </span><a href=\"http://uk.businessinsider.com/santander-has-20-25-use-cases-for-bitcoins-blockchain-technology-everyday-banking-2015-6\"><span style=\"font-weight: 400;\">use cases</span></a><span style=\"font-weight: 400;\"> for the currency.</span></p><p><span style=\"font-weight: 400;\">In the meantime, because the ledger is inherently so secure, very public and so widely distributed, it could inspire businesses to implement their own blockchain to prove purchases and log transactions, minimising the likelihood of human error. So, in the not too distant future, we may see Bitcoin becoming a household term instead of a buzzword that still holds so much mystery.</span></p><p><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/blockchain-diagram-edited.png?t=1511177678270&amp;width=632&amp;name=blockchain-diagram-edited.png\" alt=\"blockchain-diagram-edited.png\" width=\"632\" title=\"blockchain-diagram-edited.png\" caption=\"false\" data-constrained=\"true\" style=\"width: 632px;\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/blockchain-diagram-edited.png?t=1511177678270&amp;width=316&amp;name=blockchain-diagram-edited.png 316w, https://smarter.scottlogic.com/hs-fs/hubfs/blockchain-diagram-edited.png?t=1511177678270&amp;width=632&amp;name=blockchain-diagram-edited.png 632w, https://smarter.scottlogic.com/hs-fs/hubfs/blockchain-diagram-edited.png?t=1511177678270&amp;width=948&amp;name=blockchain-diagram-edited.png 948w, https://smarter.scottlogic.com/hs-fs/hubfs/blockchain-diagram-edited.png?t=1511177678270&amp;width=1264&amp;name=blockchain-diagram-edited.png 1264w, https://smarter.scottlogic.com/hs-fs/hubfs/blockchain-diagram-edited.png?t=1511177678270&amp;width=1580&amp;name=blockchain-diagram-edited.png 1580w, https://smarter.scottlogic.com/hs-fs/hubfs/blockchain-diagram-edited.png?t=1511177678270&amp;width=1896&amp;name=blockchain-diagram-edited.png 1896w\" sizes=\"(max-width: 632px) 100vw, 632px\"></p><hr><p><span>As a consultancy at the forefront of technology, we've set up our own cryptocurrency, Scottcoin, to be used by employees to buy treats at a special 'snack emporium' we've introduced. The general aim is to bring everyone up to speed with the practical use of cryptocurrencies such as Bitcoin and make it commonplace in the working environment.  </span></p><p><span></span><span>It’s a project we're encouraging widespread participation in, and it would be no surprise if the team found themselves developing such solutions for our financial services clients in future.</span></p><p>If you'd like to know more, why not contact us for a chat at <a href=\"/cdn-cgi/l/email-protection#d6b3b8a7a3bfa4bfb3a596a5b5b9a2a2bab9b1bfb5f8b5b9bb\"><span class=\"__cf_email__\" data-cfemail=\"fe9b908f8b978c979b8dbe8d9d918a8a929199979dd09d9193\">[email protected]</span></a>. </p>"},
{"publishDate": "2016-01-04 12:20", "category": "Insights", "author": "ceberhardt", "title": "Most popular Tech Blog posts of 2015", "slug": "most-popular-tech-blog-posts-of-2015", "summary": "Most popular tech blog posts of 2015", "content": "<p><strong><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/blog_image-1.png?t=1511177678270&amp;width=765&amp;name=blog_image-1.png\" alt=\"blog_image-1.png\" title=\"blog_image-1.png\" width=\"765\" data-constrained=\"true\" style=\"width: 765px;\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/blog_image-1.png?t=1511177678270&amp;width=383&amp;name=blog_image-1.png 383w, https://smarter.scottlogic.com/hs-fs/hubfs/blog_image-1.png?t=1511177678270&amp;width=765&amp;name=blog_image-1.png 765w, https://smarter.scottlogic.com/hs-fs/hubfs/blog_image-1.png?t=1511177678270&amp;width=1148&amp;name=blog_image-1.png 1148w, https://smarter.scottlogic.com/hs-fs/hubfs/blog_image-1.png?t=1511177678270&amp;width=1530&amp;name=blog_image-1.png 1530w, https://smarter.scottlogic.com/hs-fs/hubfs/blog_image-1.png?t=1511177678270&amp;width=1913&amp;name=blog_image-1.png 1913w, https://smarter.scottlogic.com/hs-fs/hubfs/blog_image-1.png?t=1511177678270&amp;width=2295&amp;name=blog_image-1.png 2295w\" sizes=\"(max-width: 765px) 100vw, 765px\"></span></strong></p><p><strong><span style=\"font-weight: 400;\">The </span><a href=\"http://blog.scottlogic.com/\" target=\"_blank\"><span style=\"font-weight: 400;\">Scott Logic tech blog</span></a><span style=\"font-weight: 400;\"> started life in 2008 when I migrated a handful of blog posts from my WordPress site over to the main company website. From these humble beginnings the blog has gone from strength to strength, with the number of visitors to the blog rising each year:<!--more--></span></strong></p><p> </p><p><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Blog_graph.png?t=1511177678270&amp;width=592&amp;height=171&amp;name=Blog_graph.png\" alt=\"Blog_graph.png\" title=\"Blog_graph.png\" width=\"592\" height=\"171\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Blog_graph.png?t=1511177678270&amp;width=296&amp;height=86&amp;name=Blog_graph.png 296w, https://smarter.scottlogic.com/hs-fs/hubfs/Blog_graph.png?t=1511177678270&amp;width=592&amp;height=171&amp;name=Blog_graph.png 592w, https://smarter.scottlogic.com/hs-fs/hubfs/Blog_graph.png?t=1511177678270&amp;width=888&amp;height=257&amp;name=Blog_graph.png 888w, https://smarter.scottlogic.com/hs-fs/hubfs/Blog_graph.png?t=1511177678270&amp;width=1184&amp;height=342&amp;name=Blog_graph.png 1184w, https://smarter.scottlogic.com/hs-fs/hubfs/Blog_graph.png?t=1511177678270&amp;width=1480&amp;height=428&amp;name=Blog_graph.png 1480w, https://smarter.scottlogic.com/hs-fs/hubfs/Blog_graph.png?t=1511177678270&amp;width=1776&amp;height=513&amp;name=Blog_graph.png 1776w\" sizes=\"(max-width: 592px) 100vw, 592px\"></p><p><span style=\"font-weight: 400;\">2015 was a busy year on the Scott Logic blog, with 68 posts published by 28 different authors, on a broad range of software development topics. The Scott Logic blog is open to any employee who want to share their thoughts, views and learnings with others.</span></p><p>There aren’t enough hours in the day to try out every new and interesting technology, and for that reason I love to read about other people's experiences. Furthermore, blog posts are great source of information if you find yourself with a tricky problem, you’re rarely the first person to have encountered a particular problem. On a number of occasions I have ‘googled’ a problem only to find the solution was to be found on our own blog!</p><p>Looking back on 2015 the five most popular blog posts, in alphabetical order, are as follows (with visit counts suitably corrected based on the date they were published).</p><ul>\n<li style=\"font-weight: 400;\"><a href=\"http://blog.scottlogic.com/2015/04/24/first-look-reactive-cocoa-3.html\" target=\"_blank\"><span style=\"font-weight: 400;\">A first look at ReactiveCocoa 3</span></a><span style=\"font-weight: 400;\"><em> by Colin Eberhardt</em> - ReactiveCocoa is a popular framework that brings a functional reactive programming style to iOS development. The 3.0 release, combined with the new ‘functional friendly’ Swift language, made this a very popular post.</span></li>\n<li style=\"font-weight: 400;\"><a href=\"http://blog.scottlogic.com/2015/05/14/aspnet50-intro.html\" target=\"_blank\"><span style=\"font-weight: 400;\">Introduction to ASP.NET 5.0</span></a><em><span style=\"font-weight: 400;\"> by </span></em><span style=\"font-weight: 400;\"><em>Effrosyni Kouri</em> - The Microsoft platform has undergone a number of changes over the past year, with the most significant being the move towards open source. </span></li>\n<li style=\"font-weight: 400;\"><a href=\"http://blog.scottlogic.com/2015/03/09/OAUTH2-Authentication-with-ADFS-3.0.html\" target=\"_blank\"><span style=\"font-weight: 400;\">OAUTH2 Authentication with ADFS 3.0</span></a><span style=\"font-weight: 400;\"><em> by Chris Price</em> - This blog post demonstrates the value of ‘practical’ blog posts, showing a step-by-step integration. This post has no doubt saved others many hours of frustration! </span></li>\n<li style=\"font-weight: 400;\"><a href=\"http://blog.scottlogic.com/2015/03/26/react-native-retrospective.html\" target=\"_blank\"><span style=\"font-weight: 400;\">Retrospective on Developing an App with React Native</span></a><span style=\"font-weight: 400;\"><em> by Colin Eberhardt</em> - React Native was fascinating from  a technical perspective, combining JavaScript with a native-UI. This post takes a look at how this approach compares to the many other solutions that currently exist for cross-platform mobile.</span></li>\n<li style=\"font-weight: 400;\"><a href=\"http://blog.scottlogic.com/2015/07/02/surprising-things-about-js.html\" target=\"_blank\"><span style=\"font-weight: 400;\">Seven Surprising JavaScript ‘Features’</span></a><span style=\"font-weight: 400;\"><em> by Luke Page</em> - JavaScript is one of the most widely used languages in 2015, however it is one of the most misunderstood. This post looks at some of the little-known features of the language, most of which are best avoided!</span></li>\n</ul><p><span style=\"font-weight: 400;\">I’d like to say a big ‘thank you’ to everyone who has contributed to our blog in 2015 and look forward to learning more from my colleagues throughout 2016.</span></p><p><strong><span style=\"font-weight: 400;\">Colin E.</span></strong></p>"},
{"publishDate": "2016-06-29 14:37", "category": "Careers", "author": "rbeckett", "title": "Grad Projects: How building a game was both galvanising and gratifying", "slug": "graduate-projects-building-a-game", "summary": "In this post, Richard and Andy will talk you through their ‘Hell Escape’ game project, one of the things they’ve worked on during their first few months working at Scott Logic as graduate developers.", "content": "<p><i><span style=\"font-weight: 400;\">In this post, Richard and Andy will talk you through their ‘Hell Escape’ game project, which is one of the things they’ve worked on during their first few months working at Scott Logic as graduate developers. Although not a games company, Scott Logic welcomes the transferable skills and experience built up from this kind of project such as JavaScript and Scrum. </span></i></p><p><span style=\"font-weight: 400;\"><!--more-->After six weeks’ induction and intense HTML5 training, which exposed us to a plethora of new technologies and libraries, we finished our first project project building a simplified trading platform. We were ready to move onto something new, and this something new was a game which was one of the worst kept secrets ever!</span></p><h2>the idea</h2><p><span style=\"font-weight: 400;\">After an initial brainstorming session we narrowed our choice of game down to a ‘Metal Slug’ style platformer with cooperative play, or a player vs player top down shooter, which was described as ‘Pacman where you can also play as the ghosts’. Whilst a cooperative game would have been fun to produce, the lure of player vs player was too strong. Choosing a theme was harder and deciding zombies is an overused genre, we decided on human vs demon.</span></p><p><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Hell_escape_image.png?t=1511177678270&amp;width=634&amp;height=528&amp;name=Hell_escape_image.png\" alt=\"Hell_escape_image.png\" width=\"634\" height=\"528\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Hell_escape_image.png?t=1511177678270&amp;width=317&amp;height=264&amp;name=Hell_escape_image.png 317w, https://smarter.scottlogic.com/hs-fs/hubfs/Hell_escape_image.png?t=1511177678270&amp;width=634&amp;height=528&amp;name=Hell_escape_image.png 634w, https://smarter.scottlogic.com/hs-fs/hubfs/Hell_escape_image.png?t=1511177678270&amp;width=951&amp;height=792&amp;name=Hell_escape_image.png 951w, https://smarter.scottlogic.com/hs-fs/hubfs/Hell_escape_image.png?t=1511177678270&amp;width=1268&amp;height=1056&amp;name=Hell_escape_image.png 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/Hell_escape_image.png?t=1511177678270&amp;width=1585&amp;height=1320&amp;name=Hell_escape_image.png 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/Hell_escape_image.png?t=1511177678270&amp;width=1902&amp;height=1584&amp;name=Hell_escape_image.png 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></span></p><h2>the tech</h2><p><span style=\"font-weight: 400;\">We were provided with a list of recommended technologies to use and guidance on how to get everything set up and then we were, to an extent, let loose. Node.js was highly recommended for the server and, as JavaScript was the the main language where our experience overlapped, it was the obvious choice. For any online multi-player game, the communication channel needs to be low latency, with a two-way connection between the client and server. With this in mind we used Socket.IO for the vast majority of the app. We also used Fetch (the next iteration of XMLHttpRequest) when sockets were unnecessary.</span></p><p>The client side of the game was implemented using the JavaScript game engine Phaser, with the rest of the app utilising Knockout.js. Both of these are lightweight packages with Phaser chosen for two reasons: it uses WebGL to help keep the frame rate up, and it had previously been used by others in the office, giving us an easily accessible advice channel should we need it.</p><p>Knockout was chosen ahead of other libraries such as Angular and React due to its simplicity and ability to display constantly up to date information through the websocket. We also made use of the Webpack module builder to manage and bundle our Single Page Application (SPA) assets.</p><h2>running the project</h2><p><span style=\"font-weight: 400;\">Using Scrum implementation of Agile development, our weeks were organised into sprints with a main goal achieved by completing stories, tasks and fixing bugs. Although we had doubts this would be useful to a team of just two, it quickly became evident that we were better organised and tasks were being correctly prioritised and estimated, thanks to our daily and weekly meetings. It helped give the project a professional feel and the approach meant we continuously saw tasks we had wanted to tackle, but weren’t essential, fail to make it into the game. Had we been given free reign to do as we pleased with the app, the final product may have been poorer for it.</span></p><p><span style=\"font-weight: 400;\">While we undertook all production ourselves, we weren’t alone. We were supported by other experienced employees acting as our scrum master, technical advisor and product owner. We’d also be regularly stunned by complicated questions, which more often than not, would lead us to re-evaluate and change how we were implementing some functionality.</span></p><p><span style=\"font-weight: 400;\"><img src=\"https://smarter.scottlogic.com/hs-fs/hubfs/Project_DefeatScreen-1.png?t=1511177678270&amp;width=634&amp;height=592&amp;name=Project_DefeatScreen-1.png\" alt=\"Project_DefeatScreen-1.png\" width=\"634\" height=\"592\" srcset=\"https://smarter.scottlogic.com/hs-fs/hubfs/Project_DefeatScreen-1.png?t=1511177678270&amp;width=317&amp;height=296&amp;name=Project_DefeatScreen-1.png 317w, https://smarter.scottlogic.com/hs-fs/hubfs/Project_DefeatScreen-1.png?t=1511177678270&amp;width=634&amp;height=592&amp;name=Project_DefeatScreen-1.png 634w, https://smarter.scottlogic.com/hs-fs/hubfs/Project_DefeatScreen-1.png?t=1511177678270&amp;width=951&amp;height=888&amp;name=Project_DefeatScreen-1.png 951w, https://smarter.scottlogic.com/hs-fs/hubfs/Project_DefeatScreen-1.png?t=1511177678270&amp;width=1268&amp;height=1184&amp;name=Project_DefeatScreen-1.png 1268w, https://smarter.scottlogic.com/hs-fs/hubfs/Project_DefeatScreen-1.png?t=1511177678270&amp;width=1585&amp;height=1480&amp;name=Project_DefeatScreen-1.png 1585w, https://smarter.scottlogic.com/hs-fs/hubfs/Project_DefeatScreen-1.png?t=1511177678270&amp;width=1902&amp;height=1776&amp;name=Project_DefeatScreen-1.png 1902w\" sizes=\"(max-width: 634px) 100vw, 634px\"></span></p><h2>lessons learned</h2><p><span style=\"font-weight: 400;\">The two of us on this project had a very different background which meant we brought distinct knowledge and skills to this project. However, the gap between a university project and a professional project is big and we’ve been amazed by the amount of knowledge we’ve gained through creating this game.</span></p><p><span style=\"font-weight: 400;\">Building the whole app from scratch gave us invaluable experience working with the full technology stack. We found certain areas more challenging, or more enjoyable than others, but it was both necessary and useful not to over specialise or actively avoid working on any particular part of the app. As a two person team, we took part in collective code ownership, we reviewed each other’s code and therefore needed to fully understand and interpret decisions to ensure this wasn’t a perfunctory task. Learning to regularly commit and share our code via Git, as well as effectively review each other's work was key to the game’s development.  </span></p><h2>mocking is great</h2><p><span style=\"font-weight: 400;\">As part of our development process we created unit tests for our code, but found we were unable to test functions that used websocket communication. We then decided to use mocking. By separating the socket communications into a separate layer, we were able to use a mock library to fake the socket and test what was previously untestable. Learning how to mock (and stub and spy) was a headache, but it significantly helped and looking back, was worth it.</span></p><h2>conclusions and improvements</h2><p><span style=\"font-weight: 400;\">While we are satisfied with the final game, it was nerve wracking to release it to the rest of the company to be played. But the feedback has been really encouraging and everyone seems to be enjoying it.  </span></p><p>There are several features we were unable to prioritise but given time we’d like to implement.  For example, collectible items (or pick-ups) was trimmed. This would have introduced limited ammunition and health regeneration, adding a tactical element to the game. Making the health pick-ups appear as bacon sandwiches, cake and coffee would also resonate with many in the office.</p><p>Similarly, it seems five or six-player games were a lot of fun but games limited to two or three players could be less interesting. This could’ve been improved with the addition of computer controlled opponents, but implementing artificial intelligence would be a complicated task. The demons  also had a slightly slower movement speed than humans which, in a two-player game ended up causing a ‘Benny Hill’ like situation. This was quickly and easily remedied by fine tuning the game’s config file, allowing a single demon to catch and kill a human.</p><p><span style=\"font-weight: 400;\">Overall, it’s been fun, interesting and challenging making our game. We’re very pleased with the results and the amount of knowledge we’ve gained in the process.</span></p>"}
]