[
{"postPath": "/careers/working-in-a-consultancy-and-working-in-house-a-view-from-the-inside", "postSummary": "Lead Developer Bartosz discusses the differences between working for a company that provides in-house development and working as a Scott Logic consultant"},
{"postPath": "/careers/voxxed-days-2017-learning-from-the-best-in-tech", "postSummary": "Hear how our graduate developers got on at Voxxed Days 2017"},
{"postPath": "/careers/beboldforchange-and-beat-the-elephant-in-the-room", "postSummary": "It’s an exciting time to work in UK tech, with companies growing each year. But there's something of an elephant in the room - the lack of women entering STEM"},
{"postPath": "/careers/scott-logic-bugathon-what-to-expect", "postSummary": "We're hosting a Bugathon on 18th March in partnership with Newcastle University, find out about how we created it and what to expect on the day."},
{"postPath": "/careers/2016-a-retrospective", "postSummary": "It’s hard to believe we’re coming to the end of another year, so I thought I’d take a moment to reflect on some of the things that my team has been involved in"},
{"postPath": "/careers/an-interview-with-our-technology-director", "postSummary": "After 10 years with the business, we asked our Technology Director his thoughts on technology both inside and outside Scott Logic."},
{"postPath": "/careers/office-insights-bristol-0", "postSummary": "Find out about our Bristol office and some of the things the team get up to inside and outside of work"},
{"postPath": "/careers/testing-is-boring-how-we-can-all-help-destroy-the-myth", "postSummary": "Lead Test Engineer Daniel recently produced a blog tackling the myths around software testing, one of which being ‘testing is boring’. In this post, fellow Test Engineer Hannah delves a little deeper into this misconception and things we can do to dispel it."},
{"postPath": "/careers/office-insights-london", "postSummary": "Gain an insight into the Scott Logic office and hear from some of the team members"},
{"postPath": "/careers/insight-into-our-2016-intern-projects", "postSummary": "This year we welcomed seven interns to our offices. In this blog post we explore the projects they worked on over their time here."},
{"postPath": "/careers/there-is-no-such-thing-as-the-wrong-degree", "postSummary": "Continuous learning is part of our culture at Scott Logic, our test engineer Hannah volunteers as a STEM Ambassador in local schools. Find out more here."},
{"postPath": "/careers/building-the-next-generation-of-technology-professionals", "postSummary": "Last week, five Scott Logic staff took time out of the Edinburgh office to lend a hand with the Prewired Summer Hack for young people aged eight to 19."},
{"postPath": "/careers/day-by-day-week-one-as-a-scott-logic-2016-graduate", "postSummary": "Last week was a busy week for our second lot of 2016 graduates as they embarked on their first week at Scott Logic - read on to find out what they got up to."},
{"postPath": "/careers/how-you-can-have-a-whole-bot-of-fun-at-scott-logic", "postSummary": "Euro 2016 may have been a little disappointing and flat, but the same can’t be said for the Scott Logic Euro 2016 table football tournament..."},
{"postPath": "/careers/graduate-projects-building-a-game", "postSummary": "In this post, Richard and Andy will talk you through their ‘Hell Escape’ game project, one of the things they’ve worked on during their first few months working at Scott Logic as graduate developers."},
{"postPath": "/careers/building-a-web-based-finance-application-framework-for-the-browser-and-desktop", "postSummary": "Here, Andy will talk you through what’s involved in building a web-based application framework for the browser and desktop."},
{"postPath": "/careers/introduction-to-business-analysis", "postSummary": "At Scott Logic business analysis is as important as the software development itself - why not take a look at Matt Burdis' introduction to business analysis"},
{"postPath": "/careers/software-testing-at-scott-logic-an-insight-into-how-we-work", "postSummary": "An insight into how software testers at Scott Logic work."},
{"postPath": "/careers/roles-in-software-developing-as-a-consultant", "postSummary": "I speak with clients regularly, constantly getting feedback on our teams and work. But this doesn’t just extend to our code; it’s more than that."},
{"postPath": "/careers/project-insights-building-a-web-based-foreign-exchange-application", "postSummary": "What are some of things you could be working on at Scott Logic? Here, Sam talks through building a web-based currency trading app."},
{"postPath": "/careers/the-2016-bcswomen-lovelace-colloquium-a-retrospective", "postSummary": "A first-timer at the annual BCSWomen Lovelace Colloquium, I wasn’t sure what to expect, but was keen to answer any questions about careers in software."},
{"postPath": "/careers/bristech-story-of-a-meet-up", "postSummary": "Nic Hemley, Head of Development for Scott Logic in Bristol, co-founded the Bristech meetup in July 2013, inspired by an existing group in Edinburgh. In this series of blog posts, Nic will be telling the story of this meetup: its genesis, challenges and possible future direction."},
{"postPath": "/careers/why-the-pushforparity-is-a-slow-burn", "postSummary": "Business must attract broader people into software and ensure the gender-based conditioning that has resulted in a male industry is confined to history."},
{"postPath": "/careers/tacklingthemythsaroundasoftwaretestingcareer", "postSummary": "Lead Test Engineer Daniel tackles the myths around a software testing career."},
{"postPath": "/careers/a-multi-skilled-developer-music-to-my-ears", "postSummary": "Recruitment Manager Michelle discusses the importance of being open minded when hiring Graduate Developers."},
{"postPath": "/careers/why-extra-curricular-activities-are-more-than-just-something-to-put-on-your-cv", "postSummary": "We were pleased to run two Hackathons last week which led our Recruitment Manager John to answer why extra-curricular activities are more than just ‘something to put on your CV’?"},
{"postPath": "/careers/4-signs-a-ux-design-role-is-your-job-match-made-in-heaven", "postSummary": "At Scott Logic we’ve got User Experience (UX) roles for both graduates and experienced applicants. So how do you know if a UX design role is for you?"},
{"postPath": "/careers/a-glimpse-into-our-2015-graduate-projects", "postSummary": "A glimpse into working life for new software developers and testers in the first few weeks of Scott Logic's graduate programme."},
{"postPath": "/careers/i-dont-have-a-computer-science-degree-can-i-still-work-in-software-development", "postSummary": "There’s a common misconception that there’s only one route into software engineering being one of them, but the truth is, the name of your degree is secondary to skills such as logical thinking, coding or testing ability, and arguably most importantly – passion. Here, two of our employees explain more."},
{"postPath": "/careers/graduate-fairs-on-the-other-side", "postSummary": "I recently attended my first graduate fair in what seems like an eternity since I was in those shoes, and of course, this was my first such event as a recruiter for Scott Logic."},
{"postPath": "/careers/6-steps-to-get-the-most-out-of-a-grad-fair", "postSummary": "6 steps to get the most out of a grad fair"},
{"postPath": "/careers/do-software-developers-need-an-online-presence", "postSummary": "Do software developers need an online presence?"},
{"postPath": "/careers/all-is-anything-but-lost-for-stem-in-the-north-east", "postSummary": "I was disappointed to read on this morning’s Journal front page that the number of A-Level students choosing Science, Technology, Engineering and Maths (STEM) related subjects is falling."},
{"postPath": "/careers/day-by-day-week-one-as-a-scott-logic-graduate", "postSummary": "A record 19 new recruits joined our 2015 graduate programme which began with an intense and enjoyable week involving technology, tiaras and table football."},
{"postPath": "/careers/scott-logic-employees-embrace-the-great-british-summer-of-sport", "postSummary": "Scott Logic's Newcastle office embraced the Wimbledon Tennis Championship and hosted the first ever Tennis-themed table football tournament."},
{"postPath": "/careers/our-interns-an-inside-track-on-the-industry", "postSummary": "As a leading software consultancy, we are proud to attract the best and brightest students from across the UK into our annual paid internship programme."},
{"postPath": "/careers/reassuring-revelations-from-our-new-recruits", "postSummary": "As a thought-leading software consultancy, Scott Logic attracts talent from all around the UK."},
{"postPath": "/careers/why-communication-is-the-key-to-great-software", "postSummary": "When hiring, many employers list communication skills as among the most essential competencies for a huge array of roles."},
{"postPath": "/insights/open-source-in-financial-services-survey", "postSummary": "We are interested in exploring the challenges faced by our Financial Services clients and their use of open source software."},
{"postPath": "/insights/regtech-and-mifid-ii", "postSummary": "RegTech seems to have surpassed FinTech in the vocabularies of a lot of our banking clients in 2017. No doubt one reason is the impending MiFID II deadline"},
{"postPath": "/careers/making-the-leap-from-academia-to-industry", "postSummary": "Murray Crease attends the inaugural PhD Horizons conference at the University of Edinburgh and discusses the breadth of career opportunities open to PhD graduates."},
{"postPath": "/careers/working-as-a-software-developer-for-scott-logic-richard", "postSummary": "We recently launched our ‘Day in the Life’ stories, which gives people a chance to learn more about what it’s like to work for Scott Logic from the perspective of our employees."},
{"postPath": "/careers/landing-your-first-graduate-job", "postSummary": "Being fully prepared at interview not only has positive effects on confidence but can throw-up interesting questions to ask."},
{"postPath": "/careers/welcome", "postSummary": "Welcome to the Scott Logic careers blog! We’ve created this blog to give you an insight into what it is like to work here. You'll be able to read up on what some of our people do through employee stories."},
{"postPath": "/insights/fintech-code-themes-for-devops-and-agile-transformation-in-financial-services", "postSummary": "The agenda for FinTech: Code mirrored a lot of what we hear our clients talk about, such as, “we need to do DevOps, but how can we do it well?”..."},
{"postPath": "/insights/government-ict-2017-reinvigorated-and-hugely-relevant", "postSummary": "Scott Logic recently attended the Government ICT conference as our first public sector conference."},
{"postPath": "/insights/our-most-popular-tech-blog-posts-of-2016", "postSummary": "OK, I’m a bit late; I intended this for the start of January, but this time last year I wrote a post on our most popular 2015 technical blogs. Here I am again!"},
{"postPath": "/insights/digital-transformation-getting-started-and-avoiding-common-pitfalls", "postSummary": "Given the complexity of digital transformation, how does anyone faced with a responsibility to deliver get to grips with the issues and decide where to start?"},
{"postPath": "/insights/2016-in-review", "postSummary": "As 2016 drew to an end, social media and technology research sites made their predictions for the year ahead, and articles show little has changed..."},
{"postPath": "/insights/how-are-businesses-using-big-data", "postSummary": "Big Data can help businesses run more efficiently. Their main challenge is getting the best value from the data they have to turn it into actionable information"},
{"postPath": "/insights/etas-2016-an-experience-shared", "postSummary": "This was our second consecutive year sponsoring ETAS, which promised to look at hot topics such as artificial intelligence, blockchain technologies and MiFID II"},
{"postPath": "/insights/digital-transformation-in-partnership", "postSummary": "The demand for speed in Digital Transformation is set against a backdrop of legacy technology, processes and procurement methods, demanding a culture shift"},
{"postPath": "/insights/unstoppable-html5", "postSummary": "HTML5 has won the battle against plugins, now universally viewed as dead technologies. Meanwhile the native vs. HTML5 mobile technology debate continues..."},
{"postPath": "/insights/the-ins-and-outs-of-bitcoin", "postSummary": "Awareness of Bitcoin has steadily grown, but understanding of it less so. Allow us to shed some light."},
{"postPath": "/insights/awssummit-2016-adoption-on-the-up-in-financial-services", "postSummary": "Last week, I had the pleasure of attending the annual Amazon Web Services (AWS) Enterprise Summit, an event that gets bigger every year..."},
{"postPath": "/insights/platforum-perceptions", "postSummary": "After attending as a delegate, Scott Logic sponsored the second annual Platforum D2C & Digital Conference, the theme of which was ‘Engaging Tomorrow’s Investor’"},
{"postPath": "/insights/dynamo-16-a-retrospective", "postSummary": "Scott Logic is a Dynamo North East member and there has been so much happening in the UK over the last couple of weeks, Dynamo 16 gave me much food for thought."},
{"postPath": "/insights/tintech-2016-reflections", "postSummary": "This was my first year attending TINTech and I was looking forward to some interesting industry insight around the usual IT concerns and trends."},
{"postPath": "/insights/the-day-i-met-brendan-eich-and-peter-beardsley", "postSummary": "Earlier this month, more than 100 City delegates descended on the East Wintergarden for FinJS. It was clear there was one person everyone was there to see..."},
{"postPath": "/insights/considering-users-in-context-to-innovate-in-retail-banking", "postSummary": "Smartphones & tablets have revolutionised business. These days, mobile banking is the default option for most consumers, but today, that isn’t enough."},
{"postPath": "/insights/tech-pulse-mobile-technologies-the-options-can-leave-you-standing-still", "postSummary": "Should businesses choose HTML5 or native for mobile apps? There’s no universal right answer; allow us to assist."},
{"postPath": "/insights/blockchain-burgers-and-bacon-sandwiches", "postSummary": "To keep abreast of the ever changing world of technology and finance I always ask my financial services clients the same question; “where will you be investing your time and money this year?” What role will blockchain and Bitcoin play in the world of corporate banking? Exactly how will the financial services sector embrace them?"},
{"postPath": "/insights/the-value-of-taking-baby-steps-towards-html5-migration", "postSummary": "Countless prospective Scott Logic clients have told of their reluctance to migrate their web applications to HTML5, despite the platform winning the war on web domination over plug-in technologies such as Flex and Silverlight some time ago. In our latest white paper, HTML5 Migration: Get started with a ‘Little Bang’, we tackle exactly this issue and provide an alternative solution to the either/or approach."},
{"postPath": "/insights/most-popular-tech-blog-posts-of-2015", "postSummary": "Most popular tech blog posts of 2015"},
{"postPath": "/insights/tech-pulse-web-technologies-a-continual-evolution", "postSummary": "Since the internet became embedded in all our lives in the late 1990s, the pace of evolution for web technologies has been frantic and it’s only getting faster; new frameworks, tools and libraries appear and disappear in the blink of an eye! So how can anyone be expected to keep up? That's where the Tech Pulse by Scott Logic can help. In this post, we examine our key findings in relation to web technologies"},
{"postPath": "/insights/five-questions-to-ask-in-finding-the-right-technology-consultancy", "postSummary": "Finding the right consultancy for your business isn’t necessarily straightforward. After all, it’s a competitive market out there and many companies have a great deal to shout about. With so much choice available, how do you go about ensuring you engage with the right consultancy for you, your project, and ultimately your own customers? Well, here are five crucial questions you should ask:"},
{"postPath": "/insights/tech-pulse-helping-you-to-keep-pace-with-technology", "postSummary": "Technology doesn't stand still - each day we are faced with new ideas, new frameworks and new techniques for developing software"},
{"postPath": "/insights/has-financial-services-software-in-the-north-east-come-of-age", "postSummary": "Has financial services software in the north east come of age?"},
{"postPath": "/insights/address-digital-disruption-investment-management", "postSummary": "There is a fundamental challenge for Investment Management firms today; how to evolve their services to meet a modern ‘omni-channel’ world that operates 24/7."},
{"postPath": "/insights/a-technological-underpinning-for-omni-channel", "postSummary": "A technical strategy for an omni-channel experience needs to support each individual channel, and also their combined usage."},
{"postPath": "/insights/making-technology-disappear", "postSummary": "‘Making technology disappear’ is a strong statement but one we feel is achievable if user experience underpins technological decision-making. In previous blog posts we have looked at the journey to omni-channel systems within capital markets and how to get started what the first steps are on the omni-channel journey."},
{"postPath": "/insights/the-time-is-right-for-finance-apps", "postSummary": "The financial services industry has been dabbling with wearables for some time now. In retail banking, consumer orientated apps have been appearing or announced for smart watches and in the world of financial trading, companies such as IG have launched a trading app to monitor a “watchlist” pun definitely intended, buy and sell shares & track market conditions."},
{"postPath": "/insights/how-to-start-your-omni-channel-journey", "postSummary": "With the proliferation of platforms and devices, or ‘platform explosion’, chasing technology and aiming to deliver all services on every single one is unfeasible. Consequently, businesses often miss the opportunity to create the genuine single experience that defines a true omni-channel system."},
{"postPath": "/insights/the-journey-to-omni-channel", "postSummary": "Multi-channel, cross-channel, omni-channel: all modern terms that are used to describe the evolving way in which users access systems and services. With the advent of smartphones and tablets, companies adopted a multi-channel strategy where customers could access the same system on a range of devices and platforms."},
{"postPath": "/insights/the-challenges-of-enterprise-html5", "postSummary": "The web has come a long way from its humble beginnings as a system of interlinked documents to the highly capable application platform it is today."},
{"postPath": "/insights/the-importance-of-making-strategic-decisions-when-developing-for-mobile", "postSummary": "In a few years the smartphone has evolved from expensive curiosity, through consumer leisure device to the point where they are now essential business tools. Regardless of the sector you operate in, if you are not already developing mobile applications then you probably feel under pressure to start."}
]